%%: 实现
-module(cfg_shenqi_chs).
-compile(export_all).
-include("cfg_shenqi.hrl").
-include("logger.hrl").

getRow(0,0)->
    #shenqiCfg {
    id = 0,
    level = 0,
    skill = 3036,
    resources = 2,
    name = "回怒技能"
    };
getRow(1,0)->
    #shenqiCfg {
    id = 1,
    level = 0,
    skill = 0,
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,1)->
    #shenqiCfg {
    id = 1,
    level = 1,
    upitem = [{2500,1}],
    skill = 3035,
    paladin = [{31,7.5,0},{30,7.5,0}],
    wizard = [{32,7.5,0},{33,7.5,0}],
    assassin = [{31,7.5,0},{33,7.5,0}],
    soulReaper = [{31,7.5,0},{32,7.5,0}],
    mechanic = [{31,7.5,0},{33,7.5,0}],
    newplayer_1 = [{31,7.5,0},{32,7.5,0}],
    newplayer_2 = [{31,7.5,0},{32,7.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,2)->
    #shenqiCfg {
    id = 1,
    level = 2,
    upgrade = [{2,1000}],
    skill = 3035,
    paladin = [{31,8.5,0},{30,8.5,0}],
    wizard = [{32,8.5,0},{33,8.5,0}],
    assassin = [{31,8.5,0},{33,8.5,0}],
    soulReaper = [{31,8.5,0},{32,8.5,0}],
    mechanic = [{31,8.5,0},{33,8.5,0}],
    newplayer_1 = [{31,8.5,0},{32,8.5,0}],
    newplayer_2 = [{31,8.5,0},{32,8.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,3)->
    #shenqiCfg {
    id = 1,
    level = 3,
    upgrade = [{2,2000}],
    skill = 3035,
    paladin = [{31,9.5,0},{30,9.5,0}],
    wizard = [{32,9.5,0},{33,9.5,0}],
    assassin = [{31,9.5,0},{33,9.5,0}],
    soulReaper = [{31,9.5,0},{32,9.5,0}],
    mechanic = [{31,9.5,0},{33,9.5,0}],
    newplayer_1 = [{31,9.5,0},{32,9.5,0}],
    newplayer_2 = [{31,9.5,0},{32,9.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,4)->
    #shenqiCfg {
    id = 1,
    level = 4,
    upgrade = [{2,3000}],
    skill = 3035,
    paladin = [{31,10,0},{30,10,0}],
    wizard = [{32,10,0},{33,10,0}],
    assassin = [{31,10,0},{33,10,0}],
    soulReaper = [{31,10,0},{32,10,0}],
    mechanic = [{31,10,0},{33,10,0}],
    newplayer_1 = [{31,10,0},{32,10,0}],
    newplayer_2 = [{31,10,0},{32,10,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,5)->
    #shenqiCfg {
    id = 1,
    level = 5,
    upgrade = [{2,4000}],
    skill = 3035,
    paladin = [{31,11,0},{30,11,0}],
    wizard = [{32,11,0},{33,11,0}],
    assassin = [{31,11,0},{33,11,0}],
    soulReaper = [{31,11,0},{32,11,0}],
    mechanic = [{31,11,0},{33,11,0}],
    newplayer_1 = [{31,11,0},{32,11,0}],
    newplayer_2 = [{31,11,0},{32,11,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,6)->
    #shenqiCfg {
    id = 1,
    level = 6,
    upgrade = [{2,5000}],
    skill = 3035,
    paladin = [{31,12,0},{30,12,0}],
    wizard = [{32,12,0},{33,12,0}],
    assassin = [{31,12,0},{33,12,0}],
    soulReaper = [{31,12,0},{32,12,0}],
    mechanic = [{31,12,0},{33,12,0}],
    newplayer_1 = [{31,12,0},{32,12,0}],
    newplayer_2 = [{31,12,0},{32,12,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,7)->
    #shenqiCfg {
    id = 1,
    level = 7,
    upgrade = [{2,6000}],
    skill = 3035,
    paladin = [{31,13,0},{30,13,0}],
    wizard = [{32,13,0},{33,13,0}],
    assassin = [{31,13,0},{33,13,0}],
    soulReaper = [{31,13,0},{32,13,0}],
    mechanic = [{31,13,0},{33,13,0}],
    newplayer_1 = [{31,13,0},{32,13,0}],
    newplayer_2 = [{31,13,0},{32,13,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,8)->
    #shenqiCfg {
    id = 1,
    level = 8,
    upgrade = [{2,7000}],
    skill = 3035,
    paladin = [{31,14,0},{30,14,0}],
    wizard = [{32,14,0},{33,14,0}],
    assassin = [{31,14,0},{33,14,0}],
    soulReaper = [{31,14,0},{32,14,0}],
    mechanic = [{31,14,0},{33,14,0}],
    newplayer_1 = [{31,14,0},{32,14,0}],
    newplayer_2 = [{31,14,0},{32,14,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,9)->
    #shenqiCfg {
    id = 1,
    level = 9,
    upgrade = [{2,8000}],
    skill = 3035,
    paladin = [{31,15,0},{30,15,0}],
    wizard = [{32,15,0},{33,15,0}],
    assassin = [{31,15,0},{33,15,0}],
    soulReaper = [{31,15,0},{32,15,0}],
    mechanic = [{31,15,0},{33,15,0}],
    newplayer_1 = [{31,15,0},{32,15,0}],
    newplayer_2 = [{31,15,0},{32,15,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,10)->
    #shenqiCfg {
    id = 1,
    level = 10,
    upgrade = [{2,9000}],
    skill = 3035,
    paladin = [{31,16,0},{30,16,0}],
    wizard = [{32,16,0},{33,16,0}],
    assassin = [{31,16,0},{33,16,0}],
    soulReaper = [{31,16,0},{32,16,0}],
    mechanic = [{31,16,0},{33,16,0}],
    newplayer_1 = [{31,16,0},{32,16,0}],
    newplayer_2 = [{31,16,0},{32,16,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,11)->
    #shenqiCfg {
    id = 1,
    level = 11,
    upgrade = [{2,10000}],
    skill = 3035,
    paladin = [{31,17.5,0},{30,17.5,0}],
    wizard = [{32,17.5,0},{33,17.5,0}],
    assassin = [{31,17.5,0},{33,17.5,0}],
    soulReaper = [{31,17.5,0},{32,17.5,0}],
    mechanic = [{31,17.5,0},{33,17.5,0}],
    newplayer_1 = [{31,17.5,0},{32,17.5,0}],
    newplayer_2 = [{31,17.5,0},{32,17.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,12)->
    #shenqiCfg {
    id = 1,
    level = 12,
    upgrade = [{2,20000}],
    skill = 3035,
    paladin = [{31,19,0},{30,19,0}],
    wizard = [{32,19,0},{33,19,0}],
    assassin = [{31,19,0},{33,19,0}],
    soulReaper = [{31,19,0},{32,19,0}],
    mechanic = [{31,19,0},{33,19,0}],
    newplayer_1 = [{31,19,0},{32,19,0}],
    newplayer_2 = [{31,19,0},{32,19,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,13)->
    #shenqiCfg {
    id = 1,
    level = 13,
    upgrade = [{2,30000}],
    skill = 3035,
    paladin = [{31,20,0},{30,20,0}],
    wizard = [{32,20,0},{33,20,0}],
    assassin = [{31,20,0},{33,20,0}],
    soulReaper = [{31,20,0},{32,20,0}],
    mechanic = [{31,20,0},{33,20,0}],
    newplayer_1 = [{31,20,0},{32,20,0}],
    newplayer_2 = [{31,20,0},{32,20,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,14)->
    #shenqiCfg {
    id = 1,
    level = 14,
    upgrade = [{2,40000}],
    skill = 3035,
    paladin = [{31,22,0},{30,22,0}],
    wizard = [{32,22,0},{33,22,0}],
    assassin = [{31,22,0},{33,22,0}],
    soulReaper = [{31,22,0},{32,22,0}],
    mechanic = [{31,22,0},{33,22,0}],
    newplayer_1 = [{31,22,0},{32,22,0}],
    newplayer_2 = [{31,22,0},{32,22,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,15)->
    #shenqiCfg {
    id = 1,
    level = 15,
    upgrade = [{2,50000}],
    skill = 3035,
    paladin = [{31,23.5,0},{30,23.5,0}],
    wizard = [{32,23.5,0},{33,23.5,0}],
    assassin = [{31,23.5,0},{33,23.5,0}],
    soulReaper = [{31,23.5,0},{32,23.5,0}],
    mechanic = [{31,23.5,0},{33,23.5,0}],
    newplayer_1 = [{31,23.5,0},{32,23.5,0}],
    newplayer_2 = [{31,23.5,0},{32,23.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,16)->
    #shenqiCfg {
    id = 1,
    level = 16,
    upgrade = [{2,60000}],
    skill = 3035,
    paladin = [{31,25.5,0},{30,25.5,0}],
    wizard = [{32,25.5,0},{33,25.5,0}],
    assassin = [{31,25.5,0},{33,25.5,0}],
    soulReaper = [{31,25.5,0},{32,25.5,0}],
    mechanic = [{31,25.5,0},{33,25.5,0}],
    newplayer_1 = [{31,25.5,0},{32,25.5,0}],
    newplayer_2 = [{31,25.5,0},{32,25.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,17)->
    #shenqiCfg {
    id = 1,
    level = 17,
    upgrade = [{2,70000}],
    skill = 3035,
    paladin = [{31,27.5,0},{30,27.5,0}],
    wizard = [{32,27.5,0},{33,27.5,0}],
    assassin = [{31,27.5,0},{33,27.5,0}],
    soulReaper = [{31,27.5,0},{32,27.5,0}],
    mechanic = [{31,27.5,0},{33,27.5,0}],
    newplayer_1 = [{31,27.5,0},{32,27.5,0}],
    newplayer_2 = [{31,27.5,0},{32,27.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,18)->
    #shenqiCfg {
    id = 1,
    level = 18,
    upgrade = [{2,80000}],
    skill = 3035,
    paladin = [{31,29.5,0},{30,29.5,0}],
    wizard = [{32,29.5,0},{33,29.5,0}],
    assassin = [{31,29.5,0},{33,29.5,0}],
    soulReaper = [{31,29.5,0},{32,29.5,0}],
    mechanic = [{31,29.5,0},{33,29.5,0}],
    newplayer_1 = [{31,29.5,0},{32,29.5,0}],
    newplayer_2 = [{31,29.5,0},{32,29.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,19)->
    #shenqiCfg {
    id = 1,
    level = 19,
    upgrade = [{2,90000}],
    skill = 3035,
    paladin = [{31,32,0},{30,32,0}],
    wizard = [{32,32,0},{33,32,0}],
    assassin = [{31,32,0},{33,32,0}],
    soulReaper = [{31,32,0},{32,32,0}],
    mechanic = [{31,32,0},{33,32,0}],
    newplayer_1 = [{31,32,0},{32,32,0}],
    newplayer_2 = [{31,32,0},{32,32,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,20)->
    #shenqiCfg {
    id = 1,
    level = 20,
    upgrade = [{2,100000}],
    skill = 3035,
    paladin = [{31,34.5,0},{30,34.5,0}],
    wizard = [{32,34.5,0},{33,34.5,0}],
    assassin = [{31,34.5,0},{33,34.5,0}],
    soulReaper = [{31,34.5,0},{32,34.5,0}],
    mechanic = [{31,34.5,0},{33,34.5,0}],
    newplayer_1 = [{31,34.5,0},{32,34.5,0}],
    newplayer_2 = [{31,34.5,0},{32,34.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,21)->
    #shenqiCfg {
    id = 1,
    level = 21,
    upgrade = [{2,200000}],
    skill = 3035,
    paladin = [{31,37.5,0},{30,37.5,0}],
    wizard = [{32,37.5,0},{33,37.5,0}],
    assassin = [{31,37.5,0},{33,37.5,0}],
    soulReaper = [{31,37.5,0},{32,37.5,0}],
    mechanic = [{31,37.5,0},{33,37.5,0}],
    newplayer_1 = [{31,37.5,0},{32,37.5,0}],
    newplayer_2 = [{31,37.5,0},{32,37.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,22)->
    #shenqiCfg {
    id = 1,
    level = 22,
    upgrade = [{2,300000}],
    skill = 3035,
    paladin = [{31,40,0},{30,40,0}],
    wizard = [{32,40,0},{33,40,0}],
    assassin = [{31,40,0},{33,40,0}],
    soulReaper = [{31,40,0},{32,40,0}],
    mechanic = [{31,40,0},{33,40,0}],
    newplayer_1 = [{31,40,0},{32,40,0}],
    newplayer_2 = [{31,40,0},{32,40,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,23)->
    #shenqiCfg {
    id = 1,
    level = 23,
    upgrade = [{2,400000}],
    skill = 3035,
    paladin = [{31,43.5,0},{30,43.5,0}],
    wizard = [{32,43.5,0},{33,43.5,0}],
    assassin = [{31,43.5,0},{33,43.5,0}],
    soulReaper = [{31,43.5,0},{32,43.5,0}],
    mechanic = [{31,43.5,0},{33,43.5,0}],
    newplayer_1 = [{31,43.5,0},{32,43.5,0}],
    newplayer_2 = [{31,43.5,0},{32,43.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,24)->
    #shenqiCfg {
    id = 1,
    level = 24,
    upgrade = [{2,500000}],
    skill = 3035,
    paladin = [{31,47,0},{30,47,0}],
    wizard = [{32,47,0},{33,47,0}],
    assassin = [{31,47,0},{33,47,0}],
    soulReaper = [{31,47,0},{32,47,0}],
    mechanic = [{31,47,0},{33,47,0}],
    newplayer_1 = [{31,47,0},{32,47,0}],
    newplayer_2 = [{31,47,0},{32,47,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,25)->
    #shenqiCfg {
    id = 1,
    level = 25,
    upgrade = [{2,600000}],
    skill = 3035,
    paladin = [{31,50.5,0},{30,50.5,0}],
    wizard = [{32,50.5,0},{33,50.5,0}],
    assassin = [{31,50.5,0},{33,50.5,0}],
    soulReaper = [{31,50.5,0},{32,50.5,0}],
    mechanic = [{31,50.5,0},{33,50.5,0}],
    newplayer_1 = [{31,50.5,0},{32,50.5,0}],
    newplayer_2 = [{31,50.5,0},{32,50.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,26)->
    #shenqiCfg {
    id = 1,
    level = 26,
    upgrade = [{2,700000}],
    skill = 3035,
    paladin = [{31,54.5,0},{30,54.5,0}],
    wizard = [{32,54.5,0},{33,54.5,0}],
    assassin = [{31,54.5,0},{33,54.5,0}],
    soulReaper = [{31,54.5,0},{32,54.5,0}],
    mechanic = [{31,54.5,0},{33,54.5,0}],
    newplayer_1 = [{31,54.5,0},{32,54.5,0}],
    newplayer_2 = [{31,54.5,0},{32,54.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,27)->
    #shenqiCfg {
    id = 1,
    level = 27,
    upgrade = [{2,800000}],
    skill = 3035,
    paladin = [{31,59,0},{30,59,0}],
    wizard = [{32,59,0},{33,59,0}],
    assassin = [{31,59,0},{33,59,0}],
    soulReaper = [{31,59,0},{32,59,0}],
    mechanic = [{31,59,0},{33,59,0}],
    newplayer_1 = [{31,59,0},{32,59,0}],
    newplayer_2 = [{31,59,0},{32,59,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,28)->
    #shenqiCfg {
    id = 1,
    level = 28,
    upgrade = [{2,900000}],
    skill = 3035,
    paladin = [{31,63.5,0},{30,63.5,0}],
    wizard = [{32,63.5,0},{33,63.5,0}],
    assassin = [{31,63.5,0},{33,63.5,0}],
    soulReaper = [{31,63.5,0},{32,63.5,0}],
    mechanic = [{31,63.5,0},{33,63.5,0}],
    newplayer_1 = [{31,63.5,0},{32,63.5,0}],
    newplayer_2 = [{31,63.5,0},{32,63.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,29)->
    #shenqiCfg {
    id = 1,
    level = 29,
    upgrade = [{2,1000000}],
    skill = 3035,
    paladin = [{31,68.5,0},{30,68.5,0}],
    wizard = [{32,68.5,0},{33,68.5,0}],
    assassin = [{31,68.5,0},{33,68.5,0}],
    soulReaper = [{31,68.5,0},{32,68.5,0}],
    mechanic = [{31,68.5,0},{33,68.5,0}],
    newplayer_1 = [{31,68.5,0},{32,68.5,0}],
    newplayer_2 = [{31,68.5,0},{32,68.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,30)->
    #shenqiCfg {
    id = 1,
    level = 30,
    upgrade = [{2,1200000}],
    skill = 3035,
    paladin = [{31,74,0},{30,74,0}],
    wizard = [{32,74,0},{33,74,0}],
    assassin = [{31,74,0},{33,74,0}],
    soulReaper = [{31,74,0},{32,74,0}],
    mechanic = [{31,74,0},{33,74,0}],
    newplayer_1 = [{31,74,0},{32,74,0}],
    newplayer_2 = [{31,74,0},{32,74,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,31)->
    #shenqiCfg {
    id = 1,
    level = 31,
    upgrade = [{2,1400000}],
    skill = 3035,
    paladin = [{31,80,0},{30,80,0}],
    wizard = [{32,80,0},{33,80,0}],
    assassin = [{31,80,0},{33,80,0}],
    soulReaper = [{31,80,0},{32,80,0}],
    mechanic = [{31,80,0},{33,80,0}],
    newplayer_1 = [{31,80,0},{32,80,0}],
    newplayer_2 = [{31,80,0},{32,80,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,32)->
    #shenqiCfg {
    id = 1,
    level = 32,
    upgrade = [{2,1600000}],
    skill = 3035,
    paladin = [{31,86.5,0},{30,86.5,0}],
    wizard = [{32,86.5,0},{33,86.5,0}],
    assassin = [{31,86.5,0},{33,86.5,0}],
    soulReaper = [{31,86.5,0},{32,86.5,0}],
    mechanic = [{31,86.5,0},{33,86.5,0}],
    newplayer_1 = [{31,86.5,0},{32,86.5,0}],
    newplayer_2 = [{31,86.5,0},{32,86.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,33)->
    #shenqiCfg {
    id = 1,
    level = 33,
    upgrade = [{2,1800000}],
    skill = 3035,
    paladin = [{31,93,0},{30,93,0}],
    wizard = [{32,93,0},{33,93,0}],
    assassin = [{31,93,0},{33,93,0}],
    soulReaper = [{31,93,0},{32,93,0}],
    mechanic = [{31,93,0},{33,93,0}],
    newplayer_1 = [{31,93,0},{32,93,0}],
    newplayer_2 = [{31,93,0},{32,93,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,34)->
    #shenqiCfg {
    id = 1,
    level = 34,
    upgrade = [{2,2000000}],
    skill = 3035,
    paladin = [{31,100.5,0},{30,100.5,0}],
    wizard = [{32,100.5,0},{33,100.5,0}],
    assassin = [{31,100.5,0},{33,100.5,0}],
    soulReaper = [{31,100.5,0},{32,100.5,0}],
    mechanic = [{31,100.5,0},{33,100.5,0}],
    newplayer_1 = [{31,100.5,0},{32,100.5,0}],
    newplayer_2 = [{31,100.5,0},{32,100.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,35)->
    #shenqiCfg {
    id = 1,
    level = 35,
    upgrade = [{2,2200000}],
    skill = 3035,
    paladin = [{31,108.5,0},{30,108.5,0}],
    wizard = [{32,108.5,0},{33,108.5,0}],
    assassin = [{31,108.5,0},{33,108.5,0}],
    soulReaper = [{31,108.5,0},{32,108.5,0}],
    mechanic = [{31,108.5,0},{33,108.5,0}],
    newplayer_1 = [{31,108.5,0},{32,108.5,0}],
    newplayer_2 = [{31,108.5,0},{32,108.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,36)->
    #shenqiCfg {
    id = 1,
    level = 36,
    upgrade = [{2,2400000}],
    skill = 3035,
    paladin = [{31,117,0},{30,117,0}],
    wizard = [{32,117,0},{33,117,0}],
    assassin = [{31,117,0},{33,117,0}],
    soulReaper = [{31,117,0},{32,117,0}],
    mechanic = [{31,117,0},{33,117,0}],
    newplayer_1 = [{31,117,0},{32,117,0}],
    newplayer_2 = [{31,117,0},{32,117,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,37)->
    #shenqiCfg {
    id = 1,
    level = 37,
    upgrade = [{2,2600000}],
    skill = 3035,
    paladin = [{31,126.5,0},{30,126.5,0}],
    wizard = [{32,126.5,0},{33,126.5,0}],
    assassin = [{31,126.5,0},{33,126.5,0}],
    soulReaper = [{31,126.5,0},{32,126.5,0}],
    mechanic = [{31,126.5,0},{33,126.5,0}],
    newplayer_1 = [{31,126.5,0},{32,126.5,0}],
    newplayer_2 = [{31,126.5,0},{32,126.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,38)->
    #shenqiCfg {
    id = 1,
    level = 38,
    upgrade = [{2,2800000}],
    skill = 3035,
    paladin = [{31,136.5,0},{30,136.5,0}],
    wizard = [{32,136.5,0},{33,136.5,0}],
    assassin = [{31,136.5,0},{33,136.5,0}],
    soulReaper = [{31,136.5,0},{32,136.5,0}],
    mechanic = [{31,136.5,0},{33,136.5,0}],
    newplayer_1 = [{31,136.5,0},{32,136.5,0}],
    newplayer_2 = [{31,136.5,0},{32,136.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,39)->
    #shenqiCfg {
    id = 1,
    level = 39,
    upgrade = [{2,3000000}],
    skill = 3035,
    paladin = [{31,147.5,0},{30,147.5,0}],
    wizard = [{32,147.5,0},{33,147.5,0}],
    assassin = [{31,147.5,0},{33,147.5,0}],
    soulReaper = [{31,147.5,0},{32,147.5,0}],
    mechanic = [{31,147.5,0},{33,147.5,0}],
    newplayer_1 = [{31,147.5,0},{32,147.5,0}],
    newplayer_2 = [{31,147.5,0},{32,147.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,40)->
    #shenqiCfg {
    id = 1,
    level = 40,
    upgrade = [{2,3200000}],
    skill = 3035,
    paladin = [{31,159,0},{30,159,0}],
    wizard = [{32,159,0},{33,159,0}],
    assassin = [{31,159,0},{33,159,0}],
    soulReaper = [{31,159,0},{32,159,0}],
    mechanic = [{31,159,0},{33,159,0}],
    newplayer_1 = [{31,159,0},{32,159,0}],
    newplayer_2 = [{31,159,0},{32,159,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,41)->
    #shenqiCfg {
    id = 1,
    level = 41,
    upgrade = [{2,3400000}],
    skill = 3035,
    paladin = [{31,171.5,0},{30,171.5,0}],
    wizard = [{32,171.5,0},{33,171.5,0}],
    assassin = [{31,171.5,0},{33,171.5,0}],
    soulReaper = [{31,171.5,0},{32,171.5,0}],
    mechanic = [{31,171.5,0},{33,171.5,0}],
    newplayer_1 = [{31,171.5,0},{32,171.5,0}],
    newplayer_2 = [{31,171.5,0},{32,171.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,42)->
    #shenqiCfg {
    id = 1,
    level = 42,
    upgrade = [{2,3600000}],
    skill = 3035,
    paladin = [{31,185.5,0},{30,185.5,0}],
    wizard = [{32,185.5,0},{33,185.5,0}],
    assassin = [{31,185.5,0},{33,185.5,0}],
    soulReaper = [{31,185.5,0},{32,185.5,0}],
    mechanic = [{31,185.5,0},{33,185.5,0}],
    newplayer_1 = [{31,185.5,0},{32,185.5,0}],
    newplayer_2 = [{31,185.5,0},{32,185.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,43)->
    #shenqiCfg {
    id = 1,
    level = 43,
    upgrade = [{2,3800000}],
    skill = 3035,
    paladin = [{31,200,0},{30,200,0}],
    wizard = [{32,200,0},{33,200,0}],
    assassin = [{31,200,0},{33,200,0}],
    soulReaper = [{31,200,0},{32,200,0}],
    mechanic = [{31,200,0},{33,200,0}],
    newplayer_1 = [{31,200,0},{32,200,0}],
    newplayer_2 = [{31,200,0},{32,200,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,44)->
    #shenqiCfg {
    id = 1,
    level = 44,
    upgrade = [{2,4000000}],
    skill = 3035,
    paladin = [{31,216,0},{30,216,0}],
    wizard = [{32,216,0},{33,216,0}],
    assassin = [{31,216,0},{33,216,0}],
    soulReaper = [{31,216,0},{32,216,0}],
    mechanic = [{31,216,0},{33,216,0}],
    newplayer_1 = [{31,216,0},{32,216,0}],
    newplayer_2 = [{31,216,0},{32,216,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,45)->
    #shenqiCfg {
    id = 1,
    level = 45,
    upgrade = [{2,4200000}],
    skill = 3035,
    paladin = [{31,233,0},{30,233,0}],
    wizard = [{32,233,0},{33,233,0}],
    assassin = [{31,233,0},{33,233,0}],
    soulReaper = [{31,233,0},{32,233,0}],
    mechanic = [{31,233,0},{33,233,0}],
    newplayer_1 = [{31,233,0},{32,233,0}],
    newplayer_2 = [{31,233,0},{32,233,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,46)->
    #shenqiCfg {
    id = 1,
    level = 46,
    upgrade = [{2,4400000}],
    skill = 3035,
    paladin = [{31,251.5,0},{30,251.5,0}],
    wizard = [{32,251.5,0},{33,251.5,0}],
    assassin = [{31,251.5,0},{33,251.5,0}],
    soulReaper = [{31,251.5,0},{32,251.5,0}],
    mechanic = [{31,251.5,0},{33,251.5,0}],
    newplayer_1 = [{31,251.5,0},{32,251.5,0}],
    newplayer_2 = [{31,251.5,0},{32,251.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,47)->
    #shenqiCfg {
    id = 1,
    level = 47,
    upgrade = [{2,4600000}],
    skill = 3035,
    paladin = [{31,271.5,0},{30,271.5,0}],
    wizard = [{32,271.5,0},{33,271.5,0}],
    assassin = [{31,271.5,0},{33,271.5,0}],
    soulReaper = [{31,271.5,0},{32,271.5,0}],
    mechanic = [{31,271.5,0},{33,271.5,0}],
    newplayer_1 = [{31,271.5,0},{32,271.5,0}],
    newplayer_2 = [{31,271.5,0},{32,271.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,48)->
    #shenqiCfg {
    id = 1,
    level = 48,
    upgrade = [{2,4800000}],
    skill = 3035,
    paladin = [{31,293,0},{30,293,0}],
    wizard = [{32,293,0},{33,293,0}],
    assassin = [{31,293,0},{33,293,0}],
    soulReaper = [{31,293,0},{32,293,0}],
    mechanic = [{31,293,0},{33,293,0}],
    newplayer_1 = [{31,293,0},{32,293,0}],
    newplayer_2 = [{31,293,0},{32,293,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,49)->
    #shenqiCfg {
    id = 1,
    level = 49,
    upgrade = [{2,5000000}],
    skill = 3035,
    paladin = [{31,316.5,0},{30,316.5,0}],
    wizard = [{32,316.5,0},{33,316.5,0}],
    assassin = [{31,316.5,0},{33,316.5,0}],
    soulReaper = [{31,316.5,0},{32,316.5,0}],
    mechanic = [{31,316.5,0},{33,316.5,0}],
    newplayer_1 = [{31,316.5,0},{32,316.5,0}],
    newplayer_2 = [{31,316.5,0},{32,316.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,50)->
    #shenqiCfg {
    id = 1,
    level = 50,
    upgrade = [{2,6000000}],
    skill = 3035,
    paladin = [{31,341.5,0},{30,341.5,0}],
    wizard = [{32,341.5,0},{33,341.5,0}],
    assassin = [{31,341.5,0},{33,341.5,0}],
    soulReaper = [{31,341.5,0},{32,341.5,0}],
    mechanic = [{31,341.5,0},{33,341.5,0}],
    newplayer_1 = [{31,341.5,0},{32,341.5,0}],
    newplayer_2 = [{31,341.5,0},{32,341.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,51)->
    #shenqiCfg {
    id = 1,
    level = 51,
    upgrade = [{2,7000000}],
    skill = 3035,
    paladin = [{31,368.5,0},{30,368.5,0}],
    wizard = [{32,368.5,0},{33,368.5,0}],
    assassin = [{31,368.5,0},{33,368.5,0}],
    soulReaper = [{31,368.5,0},{32,368.5,0}],
    mechanic = [{31,368.5,0},{33,368.5,0}],
    newplayer_1 = [{31,368.5,0},{32,368.5,0}],
    newplayer_2 = [{31,368.5,0},{32,368.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,52)->
    #shenqiCfg {
    id = 1,
    level = 52,
    upgrade = [{2,8000000}],
    skill = 3035,
    paladin = [{31,397.5,0},{30,397.5,0}],
    wizard = [{32,397.5,0},{33,397.5,0}],
    assassin = [{31,397.5,0},{33,397.5,0}],
    soulReaper = [{31,397.5,0},{32,397.5,0}],
    mechanic = [{31,397.5,0},{33,397.5,0}],
    newplayer_1 = [{31,397.5,0},{32,397.5,0}],
    newplayer_2 = [{31,397.5,0},{32,397.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,53)->
    #shenqiCfg {
    id = 1,
    level = 53,
    upgrade = [{2,9000000}],
    skill = 3035,
    paladin = [{31,429.5,0},{30,429.5,0}],
    wizard = [{32,429.5,0},{33,429.5,0}],
    assassin = [{31,429.5,0},{33,429.5,0}],
    soulReaper = [{31,429.5,0},{32,429.5,0}],
    mechanic = [{31,429.5,0},{33,429.5,0}],
    newplayer_1 = [{31,429.5,0},{32,429.5,0}],
    newplayer_2 = [{31,429.5,0},{32,429.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,54)->
    #shenqiCfg {
    id = 1,
    level = 54,
    upgrade = [{2,10000000}],
    skill = 3035,
    paladin = [{31,463.5,0},{30,463.5,0}],
    wizard = [{32,463.5,0},{33,463.5,0}],
    assassin = [{31,463.5,0},{33,463.5,0}],
    soulReaper = [{31,463.5,0},{32,463.5,0}],
    mechanic = [{31,463.5,0},{33,463.5,0}],
    newplayer_1 = [{31,463.5,0},{32,463.5,0}],
    newplayer_2 = [{31,463.5,0},{32,463.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,55)->
    #shenqiCfg {
    id = 1,
    level = 55,
    upgrade = [{2,12000000}],
    skill = 3035,
    paladin = [{31,500,0},{30,500,0}],
    wizard = [{32,500,0},{33,500,0}],
    assassin = [{31,500,0},{33,500,0}],
    soulReaper = [{31,500,0},{32,500,0}],
    mechanic = [{31,500,0},{33,500,0}],
    newplayer_1 = [{31,500,0},{32,500,0}],
    newplayer_2 = [{31,500,0},{32,500,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,56)->
    #shenqiCfg {
    id = 1,
    level = 56,
    upgrade = [{2,15000000}],
    skill = 3035,
    paladin = [{31,540,0},{30,540,0}],
    wizard = [{32,540,0},{33,540,0}],
    assassin = [{31,540,0},{33,540,0}],
    soulReaper = [{31,540,0},{32,540,0}],
    mechanic = [{31,540,0},{33,540,0}],
    newplayer_1 = [{31,540,0},{32,540,0}],
    newplayer_2 = [{31,540,0},{32,540,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,57)->
    #shenqiCfg {
    id = 1,
    level = 57,
    upgrade = [{2,20000000}],
    skill = 3035,
    paladin = [{31,582.5,0},{30,582.5,0}],
    wizard = [{32,582.5,0},{33,582.5,0}],
    assassin = [{31,582.5,0},{33,582.5,0}],
    soulReaper = [{31,582.5,0},{32,582.5,0}],
    mechanic = [{31,582.5,0},{33,582.5,0}],
    newplayer_1 = [{31,582.5,0},{32,582.5,0}],
    newplayer_2 = [{31,582.5,0},{32,582.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,58)->
    #shenqiCfg {
    id = 1,
    level = 58,
    upgrade = [{2,30000000}],
    skill = 3035,
    paladin = [{31,629,0},{30,629,0}],
    wizard = [{32,629,0},{33,629,0}],
    assassin = [{31,629,0},{33,629,0}],
    soulReaper = [{31,629,0},{32,629,0}],
    mechanic = [{31,629,0},{33,629,0}],
    newplayer_1 = [{31,629,0},{32,629,0}],
    newplayer_2 = [{31,629,0},{32,629,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,59)->
    #shenqiCfg {
    id = 1,
    level = 59,
    upgrade = [{2,40000000}],
    skill = 3035,
    paladin = [{31,678.5,0},{30,678.5,0}],
    wizard = [{32,678.5,0},{33,678.5,0}],
    assassin = [{31,678.5,0},{33,678.5,0}],
    soulReaper = [{31,678.5,0},{32,678.5,0}],
    mechanic = [{31,678.5,0},{33,678.5,0}],
    newplayer_1 = [{31,678.5,0},{32,678.5,0}],
    newplayer_2 = [{31,678.5,0},{32,678.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,60)->
    #shenqiCfg {
    id = 1,
    level = 60,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,732.5,0},{30,732.5,0}],
    wizard = [{32,732.5,0},{33,732.5,0}],
    assassin = [{31,732.5,0},{33,732.5,0}],
    soulReaper = [{31,732.5,0},{32,732.5,0}],
    mechanic = [{31,732.5,0},{33,732.5,0}],
    newplayer_1 = [{31,732.5,0},{32,732.5,0}],
    newplayer_2 = [{31,732.5,0},{32,732.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,61)->
    #shenqiCfg {
    id = 1,
    level = 61,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,782.5,0},{30,782.5,0}],
    wizard = [{32,782.5,0},{33,782.5,0}],
    assassin = [{31,782.5,0},{33,782.5,0}],
    soulReaper = [{31,782.5,0},{32,782.5,0}],
    mechanic = [{31,782.5,0},{33,782.5,0}],
    newplayer_1 = [{31,782.5,0},{32,782.5,0}],
    newplayer_2 = [{31,782.5,0},{32,782.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,62)->
    #shenqiCfg {
    id = 1,
    level = 62,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,832.5,0},{30,832.5,0}],
    wizard = [{32,832.5,0},{33,832.5,0}],
    assassin = [{31,832.5,0},{33,832.5,0}],
    soulReaper = [{31,832.5,0},{32,832.5,0}],
    mechanic = [{31,832.5,0},{33,832.5,0}],
    newplayer_1 = [{31,832.5,0},{32,832.5,0}],
    newplayer_2 = [{31,832.5,0},{32,832.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,63)->
    #shenqiCfg {
    id = 1,
    level = 63,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,882.5,0},{30,882.5,0}],
    wizard = [{32,882.5,0},{33,882.5,0}],
    assassin = [{31,882.5,0},{33,882.5,0}],
    soulReaper = [{31,882.5,0},{32,882.5,0}],
    mechanic = [{31,882.5,0},{33,882.5,0}],
    newplayer_1 = [{31,882.5,0},{32,882.5,0}],
    newplayer_2 = [{31,882.5,0},{32,882.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,64)->
    #shenqiCfg {
    id = 1,
    level = 64,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,932.5,0},{30,932.5,0}],
    wizard = [{32,932.5,0},{33,932.5,0}],
    assassin = [{31,932.5,0},{33,932.5,0}],
    soulReaper = [{31,932.5,0},{32,932.5,0}],
    mechanic = [{31,932.5,0},{33,932.5,0}],
    newplayer_1 = [{31,932.5,0},{32,932.5,0}],
    newplayer_2 = [{31,932.5,0},{32,932.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,65)->
    #shenqiCfg {
    id = 1,
    level = 65,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,982.5,0},{30,982.5,0}],
    wizard = [{32,982.5,0},{33,982.5,0}],
    assassin = [{31,982.5,0},{33,982.5,0}],
    soulReaper = [{31,982.5,0},{32,982.5,0}],
    mechanic = [{31,982.5,0},{33,982.5,0}],
    newplayer_1 = [{31,982.5,0},{32,982.5,0}],
    newplayer_2 = [{31,982.5,0},{32,982.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,66)->
    #shenqiCfg {
    id = 1,
    level = 66,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,1032.5,0},{30,1032.5,0}],
    wizard = [{32,1032.5,0},{33,1032.5,0}],
    assassin = [{31,1032.5,0},{33,1032.5,0}],
    soulReaper = [{31,1032.5,0},{32,1032.5,0}],
    mechanic = [{31,1032.5,0},{33,1032.5,0}],
    newplayer_1 = [{31,1032.5,0},{32,1032.5,0}],
    newplayer_2 = [{31,1032.5,0},{32,1032.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,67)->
    #shenqiCfg {
    id = 1,
    level = 67,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,1082.5,0},{30,1082.5,0}],
    wizard = [{32,1082.5,0},{33,1082.5,0}],
    assassin = [{31,1082.5,0},{33,1082.5,0}],
    soulReaper = [{31,1082.5,0},{32,1082.5,0}],
    mechanic = [{31,1082.5,0},{33,1082.5,0}],
    newplayer_1 = [{31,1082.5,0},{32,1082.5,0}],
    newplayer_2 = [{31,1082.5,0},{32,1082.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,68)->
    #shenqiCfg {
    id = 1,
    level = 68,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,1132.5,0},{30,1132.5,0}],
    wizard = [{32,1132.5,0},{33,1132.5,0}],
    assassin = [{31,1132.5,0},{33,1132.5,0}],
    soulReaper = [{31,1132.5,0},{32,1132.5,0}],
    mechanic = [{31,1132.5,0},{33,1132.5,0}],
    newplayer_1 = [{31,1132.5,0},{32,1132.5,0}],
    newplayer_2 = [{31,1132.5,0},{32,1132.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,69)->
    #shenqiCfg {
    id = 1,
    level = 69,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,1182.5,0},{30,1182.5,0}],
    wizard = [{32,1182.5,0},{33,1182.5,0}],
    assassin = [{31,1182.5,0},{33,1182.5,0}],
    soulReaper = [{31,1182.5,0},{32,1182.5,0}],
    mechanic = [{31,1182.5,0},{33,1182.5,0}],
    newplayer_1 = [{31,1182.5,0},{32,1182.5,0}],
    newplayer_2 = [{31,1182.5,0},{32,1182.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,70)->
    #shenqiCfg {
    id = 1,
    level = 70,
    upgrade = [{2,50000000}],
    skill = 3035,
    paladin = [{31,1232.5,0},{30,1232.5,0}],
    wizard = [{32,1232.5,0},{33,1232.5,0}],
    assassin = [{31,1232.5,0},{33,1232.5,0}],
    soulReaper = [{31,1232.5,0},{32,1232.5,0}],
    mechanic = [{31,1232.5,0},{33,1232.5,0}],
    newplayer_1 = [{31,1232.5,0},{32,1232.5,0}],
    newplayer_2 = [{31,1232.5,0},{32,1232.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,71)->
    #shenqiCfg {
    id = 1,
    level = 71,
    upgrade = [{2,60000000}],
    skill = 3035,
    paladin = [{31,1282.5,0},{30,1282.5,0}],
    wizard = [{32,1282.5,0},{33,1282.5,0}],
    assassin = [{31,1282.5,0},{33,1282.5,0}],
    soulReaper = [{31,1282.5,0},{32,1282.5,0}],
    mechanic = [{31,1282.5,0},{33,1282.5,0}],
    newplayer_1 = [{32,1282.5,0},{32,1282.5,0}],
    newplayer_2 = [{32,1282.5,0},{32,1282.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,72)->
    #shenqiCfg {
    id = 1,
    level = 72,
    upgrade = [{2,60000000}],
    skill = 3035,
    paladin = [{31,1332.5,0},{30,1332.5,0}],
    wizard = [{32,1332.5,0},{33,1332.5,0}],
    assassin = [{31,1332.5,0},{33,1332.5,0}],
    soulReaper = [{31,1332.5,0},{32,1332.5,0}],
    mechanic = [{31,1332.5,0},{33,1332.5,0}],
    newplayer_1 = [{32,1332.5,0},{32,1332.5,0}],
    newplayer_2 = [{32,1332.5,0},{32,1332.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,73)->
    #shenqiCfg {
    id = 1,
    level = 73,
    upgrade = [{2,60000000}],
    skill = 3035,
    paladin = [{31,1382.5,0},{30,1382.5,0}],
    wizard = [{32,1382.5,0},{33,1382.5,0}],
    assassin = [{31,1382.5,0},{33,1382.5,0}],
    soulReaper = [{31,1382.5,0},{32,1382.5,0}],
    mechanic = [{31,1382.5,0},{33,1382.5,0}],
    newplayer_1 = [{32,1382.5,0},{32,1382.5,0}],
    newplayer_2 = [{32,1382.5,0},{32,1382.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,74)->
    #shenqiCfg {
    id = 1,
    level = 74,
    upgrade = [{2,60000000}],
    skill = 3035,
    paladin = [{31,1432.5,0},{30,1432.5,0}],
    wizard = [{32,1432.5,0},{33,1432.5,0}],
    assassin = [{31,1432.5,0},{33,1432.5,0}],
    soulReaper = [{31,1432.5,0},{32,1432.5,0}],
    mechanic = [{31,1432.5,0},{33,1432.5,0}],
    newplayer_1 = [{32,1432.5,0},{32,1432.5,0}],
    newplayer_2 = [{32,1432.5,0},{32,1432.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(1,75)->
    #shenqiCfg {
    id = 1,
    level = 75,
    upgrade = [{2,60000000}],
    skill = 3035,
    paladin = [{31,1482.5,0},{30,1482.5,0}],
    wizard = [{32,1482.5,0},{33,1482.5,0}],
    assassin = [{31,1482.5,0},{33,1482.5,0}],
    soulReaper = [{31,1482.5,0},{32,1482.5,0}],
    mechanic = [{31,1482.5,0},{33,1482.5,0}],
    newplayer_1 = [{32,1482.5,0},{32,1482.5,0}],
    newplayer_2 = [{32,1482.5,0},{32,1482.5,0}],
    resources = 2,
    name = "海神之戟",
    txt = "海啸潮汐,上古天神波塞冬遗落人间之神物,传说拥有此物者可以呼风唤雨。"
    };
getRow(2,0)->
    #shenqiCfg {
    id = 2,
    level = 0,
    skill = 0,
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,1)->
    #shenqiCfg {
    id = 2,
    level = 1,
    upitem = [{2501,1}],
    skill = 3037,
    paladin = [{1,23,0}],
    wizard = [{3,23,0}],
    assassin = [{2,23,0}],
    soulReaper = [{1,23,0}],
    mechanic = [{2,23,0}],
    newplayer_1 = [{1,23,0}],
    newplayer_2 = [{1,23,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,2)->
    #shenqiCfg {
    id = 2,
    level = 2,
    upgrade = [{2,500},{4,100}],
    skill = 3037,
    paladin = [{1,27,0}],
    wizard = [{3,27,0}],
    assassin = [{2,27,0}],
    soulReaper = [{1,27,0}],
    mechanic = [{2,27,0}],
    newplayer_1 = [{1,27,0}],
    newplayer_2 = [{1,27,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,3)->
    #shenqiCfg {
    id = 2,
    level = 3,
    upgrade = [{2,1000},{4,200}],
    skill = 3037,
    paladin = [{1,29,0}],
    wizard = [{3,29,0}],
    assassin = [{2,29,0}],
    soulReaper = [{1,29,0}],
    mechanic = [{2,29,0}],
    newplayer_1 = [{1,29,0}],
    newplayer_2 = [{1,29,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,4)->
    #shenqiCfg {
    id = 2,
    level = 4,
    upgrade = [{2,1500},{4,300}],
    skill = 3037,
    paladin = [{1,31,0}],
    wizard = [{3,31,0}],
    assassin = [{2,31,0}],
    soulReaper = [{1,31,0}],
    mechanic = [{2,31,0}],
    newplayer_1 = [{1,31,0}],
    newplayer_2 = [{1,31,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,5)->
    #shenqiCfg {
    id = 2,
    level = 5,
    upgrade = [{2,2000},{4,400}],
    skill = 3037,
    paladin = [{1,34,0}],
    wizard = [{3,34,0}],
    assassin = [{2,34,0}],
    soulReaper = [{1,34,0}],
    mechanic = [{2,34,0}],
    newplayer_1 = [{1,34,0}],
    newplayer_2 = [{1,34,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,6)->
    #shenqiCfg {
    id = 2,
    level = 6,
    upgrade = [{2,2500},{4,500}],
    skill = 3037,
    paladin = [{1,36,0}],
    wizard = [{3,36,0}],
    assassin = [{2,36,0}],
    soulReaper = [{1,36,0}],
    mechanic = [{2,36,0}],
    newplayer_1 = [{1,36,0}],
    newplayer_2 = [{1,36,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,7)->
    #shenqiCfg {
    id = 2,
    level = 7,
    upgrade = [{2,3000},{4,600}],
    skill = 3037,
    paladin = [{1,39,0}],
    wizard = [{3,39,0}],
    assassin = [{2,39,0}],
    soulReaper = [{1,39,0}],
    mechanic = [{2,39,0}],
    newplayer_1 = [{1,39,0}],
    newplayer_2 = [{1,39,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,8)->
    #shenqiCfg {
    id = 2,
    level = 8,
    upgrade = [{2,3500},{4,700}],
    skill = 3037,
    paladin = [{1,42,0}],
    wizard = [{3,42,0}],
    assassin = [{2,42,0}],
    soulReaper = [{1,42,0}],
    mechanic = [{2,42,0}],
    newplayer_1 = [{1,42,0}],
    newplayer_2 = [{1,42,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,9)->
    #shenqiCfg {
    id = 2,
    level = 9,
    upgrade = [{2,4000},{4,800}],
    skill = 3037,
    paladin = [{1,46,0}],
    wizard = [{3,46,0}],
    assassin = [{2,46,0}],
    soulReaper = [{1,46,0}],
    mechanic = [{2,46,0}],
    newplayer_1 = [{1,46,0}],
    newplayer_2 = [{1,46,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,10)->
    #shenqiCfg {
    id = 2,
    level = 10,
    upgrade = [{2,4500},{4,900}],
    skill = 3037,
    paladin = [{1,49,0}],
    wizard = [{3,49,0}],
    assassin = [{2,49,0}],
    soulReaper = [{1,49,0}],
    mechanic = [{2,49,0}],
    newplayer_1 = [{1,49,0}],
    newplayer_2 = [{1,49,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,11)->
    #shenqiCfg {
    id = 2,
    level = 11,
    upgrade = [{2,5000},{4,1000}],
    skill = 3037,
    paladin = [{1,53,0}],
    wizard = [{3,53,0}],
    assassin = [{2,53,0}],
    soulReaper = [{1,53,0}],
    mechanic = [{2,53,0}],
    newplayer_1 = [{1,53,0}],
    newplayer_2 = [{1,53,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,12)->
    #shenqiCfg {
    id = 2,
    level = 12,
    upgrade = [{2,10000},{4,1100}],
    skill = 3037,
    paladin = [{1,58,0}],
    wizard = [{3,58,0}],
    assassin = [{2,58,0}],
    soulReaper = [{1,58,0}],
    mechanic = [{2,58,0}],
    newplayer_1 = [{1,58,0}],
    newplayer_2 = [{1,58,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,13)->
    #shenqiCfg {
    id = 2,
    level = 13,
    upgrade = [{2,15000},{4,1200}],
    skill = 3037,
    paladin = [{1,62,0}],
    wizard = [{3,62,0}],
    assassin = [{2,62,0}],
    soulReaper = [{1,62,0}],
    mechanic = [{2,62,0}],
    newplayer_1 = [{1,62,0}],
    newplayer_2 = [{1,62,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,14)->
    #shenqiCfg {
    id = 2,
    level = 14,
    upgrade = [{2,20000},{4,1300}],
    skill = 3037,
    paladin = [{1,67,0}],
    wizard = [{3,67,0}],
    assassin = [{2,67,0}],
    soulReaper = [{1,67,0}],
    mechanic = [{2,67,0}],
    newplayer_1 = [{1,67,0}],
    newplayer_2 = [{1,67,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,15)->
    #shenqiCfg {
    id = 2,
    level = 15,
    upgrade = [{2,25000},{4,1400}],
    skill = 3037,
    paladin = [{1,72,0}],
    wizard = [{3,72,0}],
    assassin = [{2,72,0}],
    soulReaper = [{1,72,0}],
    mechanic = [{2,72,0}],
    newplayer_1 = [{1,72,0}],
    newplayer_2 = [{1,72,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,16)->
    #shenqiCfg {
    id = 2,
    level = 16,
    upgrade = [{2,30000},{4,1500}],
    skill = 3037,
    paladin = [{1,78,0}],
    wizard = [{3,78,0}],
    assassin = [{2,78,0}],
    soulReaper = [{1,78,0}],
    mechanic = [{2,78,0}],
    newplayer_1 = [{1,78,0}],
    newplayer_2 = [{1,78,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,17)->
    #shenqiCfg {
    id = 2,
    level = 17,
    upgrade = [{2,35000},{4,1600}],
    skill = 3037,
    paladin = [{1,84,0}],
    wizard = [{3,84,0}],
    assassin = [{2,84,0}],
    soulReaper = [{1,84,0}],
    mechanic = [{2,84,0}],
    newplayer_1 = [{1,84,0}],
    newplayer_2 = [{1,84,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,18)->
    #shenqiCfg {
    id = 2,
    level = 18,
    upgrade = [{2,40000},{4,1700}],
    skill = 3037,
    paladin = [{1,91,0}],
    wizard = [{3,91,0}],
    assassin = [{2,91,0}],
    soulReaper = [{1,91,0}],
    mechanic = [{2,91,0}],
    newplayer_1 = [{1,91,0}],
    newplayer_2 = [{1,91,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,19)->
    #shenqiCfg {
    id = 2,
    level = 19,
    upgrade = [{2,45000},{4,1800}],
    skill = 3037,
    paladin = [{1,98,0}],
    wizard = [{3,98,0}],
    assassin = [{2,98,0}],
    soulReaper = [{1,98,0}],
    mechanic = [{2,98,0}],
    newplayer_1 = [{1,98,0}],
    newplayer_2 = [{1,98,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,20)->
    #shenqiCfg {
    id = 2,
    level = 20,
    upgrade = [{2,50000},{4,1900}],
    skill = 3037,
    paladin = [{1,106,0}],
    wizard = [{3,106,0}],
    assassin = [{2,106,0}],
    soulReaper = [{1,106,0}],
    mechanic = [{2,106,0}],
    newplayer_1 = [{1,106,0}],
    newplayer_2 = [{1,106,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,21)->
    #shenqiCfg {
    id = 2,
    level = 21,
    upgrade = [{2,100000},{4,2000}],
    skill = 3037,
    paladin = [{1,115,0}],
    wizard = [{3,115,0}],
    assassin = [{2,115,0}],
    soulReaper = [{1,115,0}],
    mechanic = [{2,115,0}],
    newplayer_1 = [{1,115,0}],
    newplayer_2 = [{1,115,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,22)->
    #shenqiCfg {
    id = 2,
    level = 22,
    upgrade = [{2,150000},{4,2100}],
    skill = 3037,
    paladin = [{1,124,0}],
    wizard = [{3,124,0}],
    assassin = [{2,124,0}],
    soulReaper = [{1,124,0}],
    mechanic = [{2,124,0}],
    newplayer_1 = [{1,124,0}],
    newplayer_2 = [{1,124,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,23)->
    #shenqiCfg {
    id = 2,
    level = 23,
    upgrade = [{2,200000},{4,2200}],
    skill = 3037,
    paladin = [{1,133,0}],
    wizard = [{3,133,0}],
    assassin = [{2,133,0}],
    soulReaper = [{1,133,0}],
    mechanic = [{2,133,0}],
    newplayer_1 = [{1,133,0}],
    newplayer_2 = [{1,133,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,24)->
    #shenqiCfg {
    id = 2,
    level = 24,
    upgrade = [{2,250000},{4,2300}],
    skill = 3037,
    paladin = [{1,144,0}],
    wizard = [{3,144,0}],
    assassin = [{2,144,0}],
    soulReaper = [{1,144,0}],
    mechanic = [{2,144,0}],
    newplayer_1 = [{1,144,0}],
    newplayer_2 = [{1,144,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,25)->
    #shenqiCfg {
    id = 2,
    level = 25,
    upgrade = [{2,300000},{4,2400}],
    skill = 3037,
    paladin = [{1,155,0}],
    wizard = [{3,155,0}],
    assassin = [{2,155,0}],
    soulReaper = [{1,155,0}],
    mechanic = [{2,155,0}],
    newplayer_1 = [{1,155,0}],
    newplayer_2 = [{1,155,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,26)->
    #shenqiCfg {
    id = 2,
    level = 26,
    upgrade = [{2,350000},{4,2500}],
    skill = 3037,
    paladin = [{1,168,0}],
    wizard = [{3,168,0}],
    assassin = [{2,168,0}],
    soulReaper = [{1,168,0}],
    mechanic = [{2,168,0}],
    newplayer_1 = [{1,168,0}],
    newplayer_2 = [{1,168,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,27)->
    #shenqiCfg {
    id = 2,
    level = 27,
    upgrade = [{2,400000},{4,2600}],
    skill = 3037,
    paladin = [{1,181,0}],
    wizard = [{3,181,0}],
    assassin = [{2,181,0}],
    soulReaper = [{1,181,0}],
    mechanic = [{2,181,0}],
    newplayer_1 = [{1,181,0}],
    newplayer_2 = [{1,181,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,28)->
    #shenqiCfg {
    id = 2,
    level = 28,
    upgrade = [{2,450000},{4,2700}],
    skill = 3037,
    paladin = [{1,195,0}],
    wizard = [{3,195,0}],
    assassin = [{2,195,0}],
    soulReaper = [{1,195,0}],
    mechanic = [{2,195,0}],
    newplayer_1 = [{1,195,0}],
    newplayer_2 = [{1,195,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,29)->
    #shenqiCfg {
    id = 2,
    level = 29,
    upgrade = [{2,500000},{4,2800}],
    skill = 3037,
    paladin = [{1,211,0}],
    wizard = [{3,211,0}],
    assassin = [{2,211,0}],
    soulReaper = [{1,211,0}],
    mechanic = [{2,211,0}],
    newplayer_1 = [{1,211,0}],
    newplayer_2 = [{1,211,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,30)->
    #shenqiCfg {
    id = 2,
    level = 30,
    upgrade = [{2,600000},{4,2900}],
    skill = 3037,
    paladin = [{1,228,0}],
    wizard = [{3,228,0}],
    assassin = [{2,228,0}],
    soulReaper = [{1,228,0}],
    mechanic = [{2,228,0}],
    newplayer_1 = [{1,228,0}],
    newplayer_2 = [{1,228,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,31)->
    #shenqiCfg {
    id = 2,
    level = 31,
    upgrade = [{2,700000},{4,3000}],
    skill = 3037,
    paladin = [{1,246,0}],
    wizard = [{3,246,0}],
    assassin = [{2,246,0}],
    soulReaper = [{1,246,0}],
    mechanic = [{2,246,0}],
    newplayer_1 = [{1,246,0}],
    newplayer_2 = [{1,246,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,32)->
    #shenqiCfg {
    id = 2,
    level = 32,
    upgrade = [{2,800000},{4,3200}],
    skill = 3037,
    paladin = [{1,265,0}],
    wizard = [{3,265,0}],
    assassin = [{2,265,0}],
    soulReaper = [{1,265,0}],
    mechanic = [{2,265,0}],
    newplayer_1 = [{1,265,0}],
    newplayer_2 = [{1,265,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,33)->
    #shenqiCfg {
    id = 2,
    level = 33,
    upgrade = [{2,900000},{4,3400}],
    skill = 3037,
    paladin = [{1,286,0}],
    wizard = [{3,286,0}],
    assassin = [{2,286,0}],
    soulReaper = [{1,286,0}],
    mechanic = [{2,286,0}],
    newplayer_1 = [{1,286,0}],
    newplayer_2 = [{1,286,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,34)->
    #shenqiCfg {
    id = 2,
    level = 34,
    upgrade = [{2,1000000},{4,3600}],
    skill = 3037,
    paladin = [{1,309,0}],
    wizard = [{3,309,0}],
    assassin = [{2,309,0}],
    soulReaper = [{1,309,0}],
    mechanic = [{2,309,0}],
    newplayer_1 = [{1,309,0}],
    newplayer_2 = [{1,309,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,35)->
    #shenqiCfg {
    id = 2,
    level = 35,
    upgrade = [{2,1100000},{4,3900}],
    skill = 3037,
    paladin = [{1,334,0}],
    wizard = [{3,334,0}],
    assassin = [{2,334,0}],
    soulReaper = [{1,334,0}],
    mechanic = [{2,334,0}],
    newplayer_1 = [{1,334,0}],
    newplayer_2 = [{1,334,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,36)->
    #shenqiCfg {
    id = 2,
    level = 36,
    upgrade = [{2,1200000},{4,4300}],
    skill = 3037,
    paladin = [{1,360,0}],
    wizard = [{3,360,0}],
    assassin = [{2,360,0}],
    soulReaper = [{1,360,0}],
    mechanic = [{2,360,0}],
    newplayer_1 = [{1,360,0}],
    newplayer_2 = [{1,360,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,37)->
    #shenqiCfg {
    id = 2,
    level = 37,
    upgrade = [{2,1300000},{4,4700}],
    skill = 3037,
    paladin = [{1,389,0}],
    wizard = [{3,389,0}],
    assassin = [{2,389,0}],
    soulReaper = [{1,389,0}],
    mechanic = [{2,389,0}],
    newplayer_1 = [{1,389,0}],
    newplayer_2 = [{1,389,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,38)->
    #shenqiCfg {
    id = 2,
    level = 38,
    upgrade = [{2,1400000},{4,5300}],
    skill = 3037,
    paladin = [{1,419,0}],
    wizard = [{3,419,0}],
    assassin = [{2,419,0}],
    soulReaper = [{1,419,0}],
    mechanic = [{2,419,0}],
    newplayer_1 = [{1,419,0}],
    newplayer_2 = [{1,419,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,39)->
    #shenqiCfg {
    id = 2,
    level = 39,
    upgrade = [{2,1500000},{4,5900}],
    skill = 3037,
    paladin = [{1,453,0}],
    wizard = [{3,453,0}],
    assassin = [{2,453,0}],
    soulReaper = [{1,453,0}],
    mechanic = [{2,453,0}],
    newplayer_1 = [{1,453,0}],
    newplayer_2 = [{1,453,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,40)->
    #shenqiCfg {
    id = 2,
    level = 40,
    upgrade = [{2,1600000},{4,6700}],
    skill = 3037,
    paladin = [{1,489,0}],
    wizard = [{3,489,0}],
    assassin = [{2,489,0}],
    soulReaper = [{1,489,0}],
    mechanic = [{2,489,0}],
    newplayer_1 = [{1,489,0}],
    newplayer_2 = [{1,489,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,41)->
    #shenqiCfg {
    id = 2,
    level = 41,
    upgrade = [{2,1700000},{4,7500}],
    skill = 3037,
    paladin = [{1,527,0}],
    wizard = [{3,527,0}],
    assassin = [{2,527,0}],
    soulReaper = [{1,527,0}],
    mechanic = [{2,527,0}],
    newplayer_1 = [{1,527,0}],
    newplayer_2 = [{1,527,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,42)->
    #shenqiCfg {
    id = 2,
    level = 42,
    upgrade = [{2,1800000},{4,8500}],
    skill = 3037,
    paladin = [{1,569,0}],
    wizard = [{3,569,0}],
    assassin = [{2,569,0}],
    soulReaper = [{1,569,0}],
    mechanic = [{2,569,0}],
    newplayer_1 = [{1,569,0}],
    newplayer_2 = [{1,569,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,43)->
    #shenqiCfg {
    id = 2,
    level = 43,
    upgrade = [{2,1900000},{4,9700}],
    skill = 3037,
    paladin = [{1,614,0}],
    wizard = [{3,614,0}],
    assassin = [{2,614,0}],
    soulReaper = [{1,614,0}],
    mechanic = [{2,614,0}],
    newplayer_1 = [{1,614,0}],
    newplayer_2 = [{1,614,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,44)->
    #shenqiCfg {
    id = 2,
    level = 44,
    upgrade = [{2,2000000},{4,11000}],
    skill = 3037,
    paladin = [{1,663,0}],
    wizard = [{3,663,0}],
    assassin = [{2,663,0}],
    soulReaper = [{1,663,0}],
    mechanic = [{2,663,0}],
    newplayer_1 = [{1,663,0}],
    newplayer_2 = [{1,663,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,45)->
    #shenqiCfg {
    id = 2,
    level = 45,
    upgrade = [{2,2100000},{4,12000}],
    skill = 3037,
    paladin = [{1,716,0}],
    wizard = [{3,716,0}],
    assassin = [{2,716,0}],
    soulReaper = [{1,716,0}],
    mechanic = [{2,716,0}],
    newplayer_1 = [{1,716,0}],
    newplayer_2 = [{1,716,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,46)->
    #shenqiCfg {
    id = 2,
    level = 46,
    upgrade = [{2,2200000},{4,14000}],
    skill = 3037,
    paladin = [{1,772,0}],
    wizard = [{3,772,0}],
    assassin = [{2,772,0}],
    soulReaper = [{1,772,0}],
    mechanic = [{2,772,0}],
    newplayer_1 = [{1,772,0}],
    newplayer_2 = [{1,772,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,47)->
    #shenqiCfg {
    id = 2,
    level = 47,
    upgrade = [{2,2300000},{4,16000}],
    skill = 3037,
    paladin = [{1,834,0}],
    wizard = [{3,834,0}],
    assassin = [{2,834,0}],
    soulReaper = [{1,834,0}],
    mechanic = [{2,834,0}],
    newplayer_1 = [{1,834,0}],
    newplayer_2 = [{1,834,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,48)->
    #shenqiCfg {
    id = 2,
    level = 48,
    upgrade = [{2,2400000},{4,18000}],
    skill = 3037,
    paladin = [{1,900,0}],
    wizard = [{3,900,0}],
    assassin = [{2,900,0}],
    soulReaper = [{1,900,0}],
    mechanic = [{2,900,0}],
    newplayer_1 = [{1,900,0}],
    newplayer_2 = [{1,900,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,49)->
    #shenqiCfg {
    id = 2,
    level = 49,
    upgrade = [{2,2500000},{4,20000}],
    skill = 3037,
    paladin = [{1,971,0}],
    wizard = [{3,971,0}],
    assassin = [{2,971,0}],
    soulReaper = [{1,971,0}],
    mechanic = [{2,971,0}],
    newplayer_1 = [{1,971,0}],
    newplayer_2 = [{1,971,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,50)->
    #shenqiCfg {
    id = 2,
    level = 50,
    upgrade = [{2,3000000},{4,22000}],
    skill = 3037,
    paladin = [{1,1048,0}],
    wizard = [{3,1048,0}],
    assassin = [{2,1048,0}],
    soulReaper = [{1,1048,0}],
    mechanic = [{2,1048,0}],
    newplayer_1 = [{1,1048,0}],
    newplayer_2 = [{1,1048,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,51)->
    #shenqiCfg {
    id = 2,
    level = 51,
    upgrade = [{2,3500000},{4,25000}],
    skill = 3037,
    paladin = [{1,1132,0}],
    wizard = [{3,1132,0}],
    assassin = [{2,1132,0}],
    soulReaper = [{1,1132,0}],
    mechanic = [{2,1132,0}],
    newplayer_1 = [{1,1132,0}],
    newplayer_2 = [{1,1132,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,52)->
    #shenqiCfg {
    id = 2,
    level = 52,
    upgrade = [{2,4000000},{4,28000}],
    skill = 3037,
    paladin = [{1,1221,0}],
    wizard = [{3,1221,0}],
    assassin = [{2,1221,0}],
    soulReaper = [{1,1221,0}],
    mechanic = [{2,1221,0}],
    newplayer_1 = [{1,1221,0}],
    newplayer_2 = [{1,1221,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,53)->
    #shenqiCfg {
    id = 2,
    level = 53,
    upgrade = [{2,4500000},{4,31000}],
    skill = 3037,
    paladin = [{1,1318,0}],
    wizard = [{3,1318,0}],
    assassin = [{2,1318,0}],
    soulReaper = [{1,1318,0}],
    mechanic = [{2,1318,0}],
    newplayer_1 = [{1,1318,0}],
    newplayer_2 = [{1,1318,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,54)->
    #shenqiCfg {
    id = 2,
    level = 54,
    upgrade = [{2,5000000},{4,34000}],
    skill = 3037,
    paladin = [{1,1423,0}],
    wizard = [{3,1423,0}],
    assassin = [{2,1423,0}],
    soulReaper = [{1,1423,0}],
    mechanic = [{2,1423,0}],
    newplayer_1 = [{1,1423,0}],
    newplayer_2 = [{1,1423,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,55)->
    #shenqiCfg {
    id = 2,
    level = 55,
    upgrade = [{2,6000000},{4,38000}],
    skill = 3037,
    paladin = [{1,1536,0}],
    wizard = [{3,1536,0}],
    assassin = [{2,1536,0}],
    soulReaper = [{1,1536,0}],
    mechanic = [{2,1536,0}],
    newplayer_1 = [{1,1536,0}],
    newplayer_2 = [{1,1536,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,56)->
    #shenqiCfg {
    id = 2,
    level = 56,
    upgrade = [{2,7500000},{4,42000}],
    skill = 3037,
    paladin = [{1,1658,0}],
    wizard = [{3,1658,0}],
    assassin = [{2,1658,0}],
    soulReaper = [{1,1658,0}],
    mechanic = [{2,1658,0}],
    newplayer_1 = [{1,1658,0}],
    newplayer_2 = [{1,1658,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,57)->
    #shenqiCfg {
    id = 2,
    level = 57,
    upgrade = [{2,10000000},{4,46000}],
    skill = 3037,
    paladin = [{1,1789,0}],
    wizard = [{3,1789,0}],
    assassin = [{2,1789,0}],
    soulReaper = [{1,1789,0}],
    mechanic = [{2,1789,0}],
    newplayer_1 = [{1,1789,0}],
    newplayer_2 = [{1,1789,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,58)->
    #shenqiCfg {
    id = 2,
    level = 58,
    upgrade = [{2,15000000},{4,50000}],
    skill = 3037,
    paladin = [{1,1931,0}],
    wizard = [{3,1931,0}],
    assassin = [{2,1931,0}],
    soulReaper = [{1,1931,0}],
    mechanic = [{2,1931,0}],
    newplayer_1 = [{1,1931,0}],
    newplayer_2 = [{1,1931,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,59)->
    #shenqiCfg {
    id = 2,
    level = 59,
    upgrade = [{2,20000000},{4,55000}],
    skill = 3037,
    paladin = [{1,2085,0}],
    wizard = [{3,2085,0}],
    assassin = [{2,2085,0}],
    soulReaper = [{1,2085,0}],
    mechanic = [{2,2085,0}],
    newplayer_1 = [{1,2085,0}],
    newplayer_2 = [{1,2085,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,60)->
    #shenqiCfg {
    id = 2,
    level = 60,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,2250,0}],
    wizard = [{3,2250,0}],
    assassin = [{2,2250,0}],
    soulReaper = [{1,2250,0}],
    mechanic = [{2,2250,0}],
    newplayer_1 = [{1,2250,0}],
    newplayer_2 = [{1,2250,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,61)->
    #shenqiCfg {
    id = 2,
    level = 61,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,2400,0}],
    wizard = [{3,2400,0}],
    assassin = [{2,2400,0}],
    soulReaper = [{1,2400,0}],
    mechanic = [{2,2400,0}],
    newplayer_1 = [{1,2400,0}],
    newplayer_2 = [{1,2400,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,62)->
    #shenqiCfg {
    id = 2,
    level = 62,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,2550,0}],
    wizard = [{3,2550,0}],
    assassin = [{2,2550,0}],
    soulReaper = [{1,2550,0}],
    mechanic = [{2,2550,0}],
    newplayer_1 = [{1,2550,0}],
    newplayer_2 = [{1,2550,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,63)->
    #shenqiCfg {
    id = 2,
    level = 63,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,2700,0}],
    wizard = [{3,2700,0}],
    assassin = [{2,2700,0}],
    soulReaper = [{1,2700,0}],
    mechanic = [{2,2700,0}],
    newplayer_1 = [{1,2700,0}],
    newplayer_2 = [{1,2700,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,64)->
    #shenqiCfg {
    id = 2,
    level = 64,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,2850,0}],
    wizard = [{3,2850,0}],
    assassin = [{2,2850,0}],
    soulReaper = [{1,2850,0}],
    mechanic = [{2,2850,0}],
    newplayer_1 = [{1,2850,0}],
    newplayer_2 = [{1,2850,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,65)->
    #shenqiCfg {
    id = 2,
    level = 65,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,3000,0}],
    wizard = [{3,3000,0}],
    assassin = [{2,3000,0}],
    soulReaper = [{1,3000,0}],
    mechanic = [{2,3000,0}],
    newplayer_1 = [{1,3000,0}],
    newplayer_2 = [{1,3000,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,66)->
    #shenqiCfg {
    id = 2,
    level = 66,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,3150,0}],
    wizard = [{3,3150,0}],
    assassin = [{2,3150,0}],
    soulReaper = [{1,3150,0}],
    mechanic = [{2,3150,0}],
    newplayer_1 = [{1,3150,0}],
    newplayer_2 = [{1,3150,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,67)->
    #shenqiCfg {
    id = 2,
    level = 67,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,3300,0}],
    wizard = [{3,3300,0}],
    assassin = [{2,3300,0}],
    soulReaper = [{1,3300,0}],
    mechanic = [{2,3300,0}],
    newplayer_1 = [{1,3300,0}],
    newplayer_2 = [{1,3300,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,68)->
    #shenqiCfg {
    id = 2,
    level = 68,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,3450,0}],
    wizard = [{3,3450,0}],
    assassin = [{2,3450,0}],
    soulReaper = [{1,3450,0}],
    mechanic = [{2,3450,0}],
    newplayer_1 = [{1,3450,0}],
    newplayer_2 = [{1,3450,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,69)->
    #shenqiCfg {
    id = 2,
    level = 69,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,3600,0}],
    wizard = [{3,3600,0}],
    assassin = [{2,3600,0}],
    soulReaper = [{1,3600,0}],
    mechanic = [{2,3600,0}],
    newplayer_1 = [{1,3600,0}],
    newplayer_2 = [{1,3600,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,70)->
    #shenqiCfg {
    id = 2,
    level = 70,
    upgrade = [{2,25000000},{4,60000}],
    skill = 3037,
    paladin = [{1,3750,0}],
    wizard = [{3,3750,0}],
    assassin = [{2,3750,0}],
    soulReaper = [{1,3750,0}],
    mechanic = [{2,3750,0}],
    newplayer_1 = [{1,3750,0}],
    newplayer_2 = [{1,3750,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,71)->
    #shenqiCfg {
    id = 2,
    level = 71,
    upgrade = [{2,30000000},{4,61000}],
    skill = 3037,
    paladin = [{1,3450,0}],
    wizard = [{3,3450,0}],
    assassin = [{2,3450,0}],
    soulReaper = [{1,3450,0}],
    mechanic = [{2,3450,0}],
    newplayer_1 = [{1,3450,0}],
    newplayer_2 = [{1,3450,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,72)->
    #shenqiCfg {
    id = 2,
    level = 72,
    upgrade = [{2,30000000},{4,62000}],
    skill = 3037,
    paladin = [{1,3600,0}],
    wizard = [{3,3600,0}],
    assassin = [{2,3600,0}],
    soulReaper = [{1,3600,0}],
    mechanic = [{2,3600,0}],
    newplayer_1 = [{1,3600,0}],
    newplayer_2 = [{1,3600,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,73)->
    #shenqiCfg {
    id = 2,
    level = 73,
    upgrade = [{2,30000000},{4,63000}],
    skill = 3037,
    paladin = [{1,3750,0}],
    wizard = [{3,3750,0}],
    assassin = [{2,3750,0}],
    soulReaper = [{1,3750,0}],
    mechanic = [{2,3750,0}],
    newplayer_1 = [{1,3750,0}],
    newplayer_2 = [{1,3750,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,74)->
    #shenqiCfg {
    id = 2,
    level = 74,
    upgrade = [{2,30000000},{4,64000}],
    skill = 3037,
    paladin = [{1,3900,0}],
    wizard = [{3,3900,0}],
    assassin = [{2,3900,0}],
    soulReaper = [{1,3900,0}],
    mechanic = [{2,3900,0}],
    newplayer_1 = [{1,3900,0}],
    newplayer_2 = [{1,3900,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(2,75)->
    #shenqiCfg {
    id = 2,
    level = 75,
    upgrade = [{2,30000000},{4,65000}],
    skill = 3037,
    paladin = [{1,4050,0}],
    wizard = [{3,4050,0}],
    assassin = [{2,4050,0}],
    soulReaper = [{1,4050,0}],
    mechanic = [{2,4050,0}],
    newplayer_1 = [{1,4050,0}],
    newplayer_2 = [{1,4050,0}],
    resources = 1,
    name = "圣光壁垒",
    txt = "上古时期,天使与恶龙交战时大天使所持圣盾,传说拥有者可以抵御一切伤害。"
    };
getRow(3,0)->
    #shenqiCfg {
    id = 3,
    level = 0,
    skill = 0,
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,1)->
    #shenqiCfg {
    id = 3,
    level = 1,
    upitem = [{2502,1}],
    skill = 3038,
    paladin = [{4,45,0}],
    wizard = [{4,45,0}],
    assassin = [{4,45,0}],
    soulReaper = [{4,45,0}],
    mechanic = [{4,45,0}],
    newplayer_1 = [{4,45,0}],
    newplayer_2 = [{4,45,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,2)->
    #shenqiCfg {
    id = 3,
    level = 2,
    upgrade = [{2,500},{9,100}],
    skill = 3038,
    paladin = [{4,52,0}],
    wizard = [{4,52,0}],
    assassin = [{4,52,0}],
    soulReaper = [{4,52,0}],
    mechanic = [{4,52,0}],
    newplayer_1 = [{4,52,0}],
    newplayer_2 = [{4,52,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,3)->
    #shenqiCfg {
    id = 3,
    level = 3,
    upgrade = [{2,1000},{9,200}],
    skill = 3038,
    paladin = [{4,57,0}],
    wizard = [{4,57,0}],
    assassin = [{4,57,0}],
    soulReaper = [{4,57,0}],
    mechanic = [{4,57,0}],
    newplayer_1 = [{4,57,0}],
    newplayer_2 = [{4,57,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,4)->
    #shenqiCfg {
    id = 3,
    level = 4,
    upgrade = [{2,1500},{9,300}],
    skill = 3038,
    paladin = [{4,61,0}],
    wizard = [{4,61,0}],
    assassin = [{4,61,0}],
    soulReaper = [{4,61,0}],
    mechanic = [{4,61,0}],
    newplayer_1 = [{4,61,0}],
    newplayer_2 = [{4,61,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,5)->
    #shenqiCfg {
    id = 3,
    level = 5,
    upgrade = [{2,2000},{9,400}],
    skill = 3038,
    paladin = [{4,66,0}],
    wizard = [{4,66,0}],
    assassin = [{4,66,0}],
    soulReaper = [{4,66,0}],
    mechanic = [{4,66,0}],
    newplayer_1 = [{4,66,0}],
    newplayer_2 = [{4,66,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,6)->
    #shenqiCfg {
    id = 3,
    level = 6,
    upgrade = [{2,2500},{9,500}],
    skill = 3038,
    paladin = [{4,71,0}],
    wizard = [{4,71,0}],
    assassin = [{4,71,0}],
    soulReaper = [{4,71,0}],
    mechanic = [{4,71,0}],
    newplayer_1 = [{4,71,0}],
    newplayer_2 = [{4,71,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,7)->
    #shenqiCfg {
    id = 3,
    level = 7,
    upgrade = [{2,3000},{9,600}],
    skill = 3038,
    paladin = [{4,77,0}],
    wizard = [{4,77,0}],
    assassin = [{4,77,0}],
    soulReaper = [{4,77,0}],
    mechanic = [{4,77,0}],
    newplayer_1 = [{4,77,0}],
    newplayer_2 = [{4,77,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,8)->
    #shenqiCfg {
    id = 3,
    level = 8,
    upgrade = [{2,3500},{9,700}],
    skill = 3038,
    paladin = [{4,83,0}],
    wizard = [{4,83,0}],
    assassin = [{4,83,0}],
    soulReaper = [{4,83,0}],
    mechanic = [{4,83,0}],
    newplayer_1 = [{4,83,0}],
    newplayer_2 = [{4,83,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,9)->
    #shenqiCfg {
    id = 3,
    level = 9,
    upgrade = [{2,4000},{9,800}],
    skill = 3038,
    paladin = [{4,89,0}],
    wizard = [{4,89,0}],
    assassin = [{4,89,0}],
    soulReaper = [{4,89,0}],
    mechanic = [{4,89,0}],
    newplayer_1 = [{4,89,0}],
    newplayer_2 = [{4,89,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,10)->
    #shenqiCfg {
    id = 3,
    level = 10,
    upgrade = [{2,4500},{9,900}],
    skill = 3038,
    paladin = [{4,97,0}],
    wizard = [{4,97,0}],
    assassin = [{4,97,0}],
    soulReaper = [{4,97,0}],
    mechanic = [{4,97,0}],
    newplayer_1 = [{4,97,0}],
    newplayer_2 = [{4,97,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,11)->
    #shenqiCfg {
    id = 3,
    level = 11,
    upgrade = [{2,5000},{9,1000}],
    skill = 3038,
    paladin = [{4,104,0}],
    wizard = [{4,104,0}],
    assassin = [{4,104,0}],
    soulReaper = [{4,104,0}],
    mechanic = [{4,104,0}],
    newplayer_1 = [{4,104,0}],
    newplayer_2 = [{4,104,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,12)->
    #shenqiCfg {
    id = 3,
    level = 12,
    upgrade = [{2,10000},{9,1100}],
    skill = 3038,
    paladin = [{4,113,0}],
    wizard = [{4,113,0}],
    assassin = [{4,113,0}],
    soulReaper = [{4,113,0}],
    mechanic = [{4,113,0}],
    newplayer_1 = [{4,113,0}],
    newplayer_2 = [{4,113,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,13)->
    #shenqiCfg {
    id = 3,
    level = 13,
    upgrade = [{2,15000},{9,1200}],
    skill = 3038,
    paladin = [{4,121,0}],
    wizard = [{4,121,0}],
    assassin = [{4,121,0}],
    soulReaper = [{4,121,0}],
    mechanic = [{4,121,0}],
    newplayer_1 = [{4,121,0}],
    newplayer_2 = [{4,121,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,14)->
    #shenqiCfg {
    id = 3,
    level = 14,
    upgrade = [{2,20000},{9,1300}],
    skill = 3038,
    paladin = [{4,131,0}],
    wizard = [{4,131,0}],
    assassin = [{4,131,0}],
    soulReaper = [{4,131,0}],
    mechanic = [{4,131,0}],
    newplayer_1 = [{4,131,0}],
    newplayer_2 = [{4,131,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,15)->
    #shenqiCfg {
    id = 3,
    level = 15,
    upgrade = [{2,25000},{9,1400}],
    skill = 3038,
    paladin = [{4,141,0}],
    wizard = [{4,141,0}],
    assassin = [{4,141,0}],
    soulReaper = [{4,141,0}],
    mechanic = [{4,141,0}],
    newplayer_1 = [{4,141,0}],
    newplayer_2 = [{4,141,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,16)->
    #shenqiCfg {
    id = 3,
    level = 16,
    upgrade = [{2,30000},{9,1500}],
    skill = 3038,
    paladin = [{4,153,0}],
    wizard = [{4,153,0}],
    assassin = [{4,153,0}],
    soulReaper = [{4,153,0}],
    mechanic = [{4,153,0}],
    newplayer_1 = [{4,153,0}],
    newplayer_2 = [{4,153,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,17)->
    #shenqiCfg {
    id = 3,
    level = 17,
    upgrade = [{2,35000},{9,1600}],
    skill = 3038,
    paladin = [{4,165,0}],
    wizard = [{4,165,0}],
    assassin = [{4,165,0}],
    soulReaper = [{4,165,0}],
    mechanic = [{4,165,0}],
    newplayer_1 = [{4,165,0}],
    newplayer_2 = [{4,165,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,18)->
    #shenqiCfg {
    id = 3,
    level = 18,
    upgrade = [{2,40000},{9,1700}],
    skill = 3038,
    paladin = [{4,178,0}],
    wizard = [{4,178,0}],
    assassin = [{4,178,0}],
    soulReaper = [{4,178,0}],
    mechanic = [{4,178,0}],
    newplayer_1 = [{4,178,0}],
    newplayer_2 = [{4,178,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,19)->
    #shenqiCfg {
    id = 3,
    level = 19,
    upgrade = [{2,45000},{9,1800}],
    skill = 3038,
    paladin = [{4,192,0}],
    wizard = [{4,192,0}],
    assassin = [{4,192,0}],
    soulReaper = [{4,192,0}],
    mechanic = [{4,192,0}],
    newplayer_1 = [{4,192,0}],
    newplayer_2 = [{4,192,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,20)->
    #shenqiCfg {
    id = 3,
    level = 20,
    upgrade = [{2,50000},{9,1900}],
    skill = 3038,
    paladin = [{4,207,0}],
    wizard = [{4,207,0}],
    assassin = [{4,207,0}],
    soulReaper = [{4,207,0}],
    mechanic = [{4,207,0}],
    newplayer_1 = [{4,207,0}],
    newplayer_2 = [{4,207,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,21)->
    #shenqiCfg {
    id = 3,
    level = 21,
    upgrade = [{2,100000},{9,2000}],
    skill = 3038,
    paladin = [{4,224,0}],
    wizard = [{4,224,0}],
    assassin = [{4,224,0}],
    soulReaper = [{4,224,0}],
    mechanic = [{4,224,0}],
    newplayer_1 = [{4,224,0}],
    newplayer_2 = [{4,224,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,22)->
    #shenqiCfg {
    id = 3,
    level = 22,
    upgrade = [{2,150000},{9,2100}],
    skill = 3038,
    paladin = [{4,241,0}],
    wizard = [{4,241,0}],
    assassin = [{4,241,0}],
    soulReaper = [{4,241,0}],
    mechanic = [{4,241,0}],
    newplayer_1 = [{4,241,0}],
    newplayer_2 = [{4,241,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,23)->
    #shenqiCfg {
    id = 3,
    level = 23,
    upgrade = [{2,200000},{9,2200}],
    skill = 3038,
    paladin = [{4,261,0}],
    wizard = [{4,261,0}],
    assassin = [{4,261,0}],
    soulReaper = [{4,261,0}],
    mechanic = [{4,261,0}],
    newplayer_1 = [{4,261,0}],
    newplayer_2 = [{4,261,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,24)->
    #shenqiCfg {
    id = 3,
    level = 24,
    upgrade = [{2,250000},{9,2300}],
    skill = 3038,
    paladin = [{4,281,0}],
    wizard = [{4,281,0}],
    assassin = [{4,281,0}],
    soulReaper = [{4,281,0}],
    mechanic = [{4,281,0}],
    newplayer_1 = [{4,281,0}],
    newplayer_2 = [{4,281,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,25)->
    #shenqiCfg {
    id = 3,
    level = 25,
    upgrade = [{2,300000},{9,2400}],
    skill = 3038,
    paladin = [{4,304,0}],
    wizard = [{4,304,0}],
    assassin = [{4,304,0}],
    soulReaper = [{4,304,0}],
    mechanic = [{4,304,0}],
    newplayer_1 = [{4,304,0}],
    newplayer_2 = [{4,304,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,26)->
    #shenqiCfg {
    id = 3,
    level = 26,
    upgrade = [{2,350000},{9,2500}],
    skill = 3038,
    paladin = [{4,328,0}],
    wizard = [{4,328,0}],
    assassin = [{4,328,0}],
    soulReaper = [{4,328,0}],
    mechanic = [{4,328,0}],
    newplayer_1 = [{4,328,0}],
    newplayer_2 = [{4,328,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,27)->
    #shenqiCfg {
    id = 3,
    level = 27,
    upgrade = [{2,400000},{9,2600}],
    skill = 3038,
    paladin = [{4,354,0}],
    wizard = [{4,354,0}],
    assassin = [{4,354,0}],
    soulReaper = [{4,354,0}],
    mechanic = [{4,354,0}],
    newplayer_1 = [{4,354,0}],
    newplayer_2 = [{4,354,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,28)->
    #shenqiCfg {
    id = 3,
    level = 28,
    upgrade = [{2,450000},{9,2700}],
    skill = 3038,
    paladin = [{4,382,0}],
    wizard = [{4,382,0}],
    assassin = [{4,382,0}],
    soulReaper = [{4,382,0}],
    mechanic = [{4,382,0}],
    newplayer_1 = [{4,382,0}],
    newplayer_2 = [{4,382,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,29)->
    #shenqiCfg {
    id = 3,
    level = 29,
    upgrade = [{2,500000},{9,2800}],
    skill = 3038,
    paladin = [{4,412,0}],
    wizard = [{4,412,0}],
    assassin = [{4,412,0}],
    soulReaper = [{4,412,0}],
    mechanic = [{4,412,0}],
    newplayer_1 = [{4,412,0}],
    newplayer_2 = [{4,412,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,30)->
    #shenqiCfg {
    id = 3,
    level = 30,
    upgrade = [{2,600000},{9,2900}],
    skill = 3038,
    paladin = [{4,445,0}],
    wizard = [{4,445,0}],
    assassin = [{4,445,0}],
    soulReaper = [{4,445,0}],
    mechanic = [{4,445,0}],
    newplayer_1 = [{4,445,0}],
    newplayer_2 = [{4,445,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,31)->
    #shenqiCfg {
    id = 3,
    level = 31,
    upgrade = [{2,700000},{9,3000}],
    skill = 3038,
    paladin = [{4,480,0}],
    wizard = [{4,480,0}],
    assassin = [{4,480,0}],
    soulReaper = [{4,480,0}],
    mechanic = [{4,480,0}],
    newplayer_1 = [{4,480,0}],
    newplayer_2 = [{4,480,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,32)->
    #shenqiCfg {
    id = 3,
    level = 32,
    upgrade = [{2,800000},{9,3200}],
    skill = 3038,
    paladin = [{4,518,0}],
    wizard = [{4,518,0}],
    assassin = [{4,518,0}],
    soulReaper = [{4,518,0}],
    mechanic = [{4,518,0}],
    newplayer_1 = [{4,518,0}],
    newplayer_2 = [{4,518,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,33)->
    #shenqiCfg {
    id = 3,
    level = 33,
    upgrade = [{2,900000},{9,3500}],
    skill = 3038,
    paladin = [{4,559,0}],
    wizard = [{4,559,0}],
    assassin = [{4,559,0}],
    soulReaper = [{4,559,0}],
    mechanic = [{4,559,0}],
    newplayer_1 = [{4,559,0}],
    newplayer_2 = [{4,559,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,34)->
    #shenqiCfg {
    id = 3,
    level = 34,
    upgrade = [{2,1000000},{9,3900}],
    skill = 3038,
    paladin = [{4,604,0}],
    wizard = [{4,604,0}],
    assassin = [{4,604,0}],
    soulReaper = [{4,604,0}],
    mechanic = [{4,604,0}],
    newplayer_1 = [{4,604,0}],
    newplayer_2 = [{4,604,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,35)->
    #shenqiCfg {
    id = 3,
    level = 35,
    upgrade = [{2,1100000},{9,4400}],
    skill = 3038,
    paladin = [{4,652,0}],
    wizard = [{4,652,0}],
    assassin = [{4,652,0}],
    soulReaper = [{4,652,0}],
    mechanic = [{4,652,0}],
    newplayer_1 = [{4,652,0}],
    newplayer_2 = [{4,652,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,36)->
    #shenqiCfg {
    id = 3,
    level = 36,
    upgrade = [{2,1200000},{9,5000}],
    skill = 3038,
    paladin = [{4,703,0}],
    wizard = [{4,703,0}],
    assassin = [{4,703,0}],
    soulReaper = [{4,703,0}],
    mechanic = [{4,703,0}],
    newplayer_1 = [{4,703,0}],
    newplayer_2 = [{4,703,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,37)->
    #shenqiCfg {
    id = 3,
    level = 37,
    upgrade = [{2,1300000},{9,5700}],
    skill = 3038,
    paladin = [{4,759,0}],
    wizard = [{4,759,0}],
    assassin = [{4,759,0}],
    soulReaper = [{4,759,0}],
    mechanic = [{4,759,0}],
    newplayer_1 = [{4,759,0}],
    newplayer_2 = [{4,759,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,38)->
    #shenqiCfg {
    id = 3,
    level = 38,
    upgrade = [{2,1400000},{9,6500}],
    skill = 3038,
    paladin = [{4,819,0}],
    wizard = [{4,819,0}],
    assassin = [{4,819,0}],
    soulReaper = [{4,819,0}],
    mechanic = [{4,819,0}],
    newplayer_1 = [{4,819,0}],
    newplayer_2 = [{4,819,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,39)->
    #shenqiCfg {
    id = 3,
    level = 39,
    upgrade = [{2,1500000},{9,7400}],
    skill = 3038,
    paladin = [{4,884,0}],
    wizard = [{4,884,0}],
    assassin = [{4,884,0}],
    soulReaper = [{4,884,0}],
    mechanic = [{4,884,0}],
    newplayer_1 = [{4,884,0}],
    newplayer_2 = [{4,884,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,40)->
    #shenqiCfg {
    id = 3,
    level = 40,
    upgrade = [{2,1600000},{9,8400}],
    skill = 3038,
    paladin = [{4,954,0}],
    wizard = [{4,954,0}],
    assassin = [{4,954,0}],
    soulReaper = [{4,954,0}],
    mechanic = [{4,954,0}],
    newplayer_1 = [{4,954,0}],
    newplayer_2 = [{4,954,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,41)->
    #shenqiCfg {
    id = 3,
    level = 41,
    upgrade = [{2,1700000},{9,9600}],
    skill = 3038,
    paladin = [{4,1030,0}],
    wizard = [{4,1030,0}],
    assassin = [{4,1030,0}],
    soulReaper = [{4,1030,0}],
    mechanic = [{4,1030,0}],
    newplayer_1 = [{4,1030,0}],
    newplayer_2 = [{4,1030,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,42)->
    #shenqiCfg {
    id = 3,
    level = 42,
    upgrade = [{2,1800000},{9,11000}],
    skill = 3038,
    paladin = [{4,1112,0}],
    wizard = [{4,1112,0}],
    assassin = [{4,1112,0}],
    soulReaper = [{4,1112,0}],
    mechanic = [{4,1112,0}],
    newplayer_1 = [{4,1112,0}],
    newplayer_2 = [{4,1112,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,43)->
    #shenqiCfg {
    id = 3,
    level = 43,
    upgrade = [{2,1900000},{9,12000}],
    skill = 3038,
    paladin = [{4,1200,0}],
    wizard = [{4,1200,0}],
    assassin = [{4,1200,0}],
    soulReaper = [{4,1200,0}],
    mechanic = [{4,1200,0}],
    newplayer_1 = [{4,1200,0}],
    newplayer_2 = [{4,1200,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,44)->
    #shenqiCfg {
    id = 3,
    level = 44,
    upgrade = [{2,2000000},{9,14000}],
    skill = 3038,
    paladin = [{4,1295,0}],
    wizard = [{4,1295,0}],
    assassin = [{4,1295,0}],
    soulReaper = [{4,1295,0}],
    mechanic = [{4,1295,0}],
    newplayer_1 = [{4,1295,0}],
    newplayer_2 = [{4,1295,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,45)->
    #shenqiCfg {
    id = 3,
    level = 45,
    upgrade = [{2,2100000},{9,16000}],
    skill = 3038,
    paladin = [{4,1398,0}],
    wizard = [{4,1398,0}],
    assassin = [{4,1398,0}],
    soulReaper = [{4,1398,0}],
    mechanic = [{4,1398,0}],
    newplayer_1 = [{4,1398,0}],
    newplayer_2 = [{4,1398,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,46)->
    #shenqiCfg {
    id = 3,
    level = 46,
    upgrade = [{2,2200000},{9,18000}],
    skill = 3038,
    paladin = [{4,1509,0}],
    wizard = [{4,1509,0}],
    assassin = [{4,1509,0}],
    soulReaper = [{4,1509,0}],
    mechanic = [{4,1509,0}],
    newplayer_1 = [{4,1509,0}],
    newplayer_2 = [{4,1509,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,47)->
    #shenqiCfg {
    id = 3,
    level = 47,
    upgrade = [{2,2300000},{9,20000}],
    skill = 3038,
    paladin = [{4,1629,0}],
    wizard = [{4,1629,0}],
    assassin = [{4,1629,0}],
    soulReaper = [{4,1629,0}],
    mechanic = [{4,1629,0}],
    newplayer_1 = [{4,1629,0}],
    newplayer_2 = [{4,1629,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,48)->
    #shenqiCfg {
    id = 3,
    level = 48,
    upgrade = [{2,2400000},{9,22000}],
    skill = 3038,
    paladin = [{4,1758,0}],
    wizard = [{4,1758,0}],
    assassin = [{4,1758,0}],
    soulReaper = [{4,1758,0}],
    mechanic = [{4,1758,0}],
    newplayer_1 = [{4,1758,0}],
    newplayer_2 = [{4,1758,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,49)->
    #shenqiCfg {
    id = 3,
    level = 49,
    upgrade = [{2,2500000},{9,25000}],
    skill = 3038,
    paladin = [{4,1898,0}],
    wizard = [{4,1898,0}],
    assassin = [{4,1898,0}],
    soulReaper = [{4,1898,0}],
    mechanic = [{4,1898,0}],
    newplayer_1 = [{4,1898,0}],
    newplayer_2 = [{4,1898,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,50)->
    #shenqiCfg {
    id = 3,
    level = 50,
    upgrade = [{2,3000000},{9,27000}],
    skill = 3038,
    paladin = [{4,2048,0}],
    wizard = [{4,2048,0}],
    assassin = [{4,2048,0}],
    soulReaper = [{4,2048,0}],
    mechanic = [{4,2048,0}],
    newplayer_1 = [{4,2048,0}],
    newplayer_2 = [{4,2048,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,51)->
    #shenqiCfg {
    id = 3,
    level = 51,
    upgrade = [{2,3500000},{9,30000}],
    skill = 3038,
    paladin = [{4,2211,0}],
    wizard = [{4,2211,0}],
    assassin = [{4,2211,0}],
    soulReaper = [{4,2211,0}],
    mechanic = [{4,2211,0}],
    newplayer_1 = [{4,2211,0}],
    newplayer_2 = [{4,2211,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,52)->
    #shenqiCfg {
    id = 3,
    level = 52,
    upgrade = [{2,4000000},{9,34000}],
    skill = 3038,
    paladin = [{4,2386,0}],
    wizard = [{4,2386,0}],
    assassin = [{4,2386,0}],
    soulReaper = [{4,2386,0}],
    mechanic = [{4,2386,0}],
    newplayer_1 = [{4,2386,0}],
    newplayer_2 = [{4,2386,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,53)->
    #shenqiCfg {
    id = 3,
    level = 53,
    upgrade = [{2,4500000},{9,37000}],
    skill = 3038,
    paladin = [{4,2576,0}],
    wizard = [{4,2576,0}],
    assassin = [{4,2576,0}],
    soulReaper = [{4,2576,0}],
    mechanic = [{4,2576,0}],
    newplayer_1 = [{4,2576,0}],
    newplayer_2 = [{4,2576,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,54)->
    #shenqiCfg {
    id = 3,
    level = 54,
    upgrade = [{2,5000000},{9,41000}],
    skill = 3038,
    paladin = [{4,2780,0}],
    wizard = [{4,2780,0}],
    assassin = [{4,2780,0}],
    soulReaper = [{4,2780,0}],
    mechanic = [{4,2780,0}],
    newplayer_1 = [{4,2780,0}],
    newplayer_2 = [{4,2780,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,55)->
    #shenqiCfg {
    id = 3,
    level = 55,
    upgrade = [{2,6000000},{9,45000}],
    skill = 3038,
    paladin = [{4,3000,0}],
    wizard = [{4,3000,0}],
    assassin = [{4,3000,0}],
    soulReaper = [{4,3000,0}],
    mechanic = [{4,3000,0}],
    newplayer_1 = [{4,3000,0}],
    newplayer_2 = [{4,3000,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,56)->
    #shenqiCfg {
    id = 3,
    level = 56,
    upgrade = [{2,7500000},{9,49000}],
    skill = 3038,
    paladin = [{4,3239,0}],
    wizard = [{4,3239,0}],
    assassin = [{4,3239,0}],
    soulReaper = [{4,3239,0}],
    mechanic = [{4,3239,0}],
    newplayer_1 = [{4,3239,0}],
    newplayer_2 = [{4,3239,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,57)->
    #shenqiCfg {
    id = 3,
    level = 57,
    upgrade = [{2,10000000},{9,54000}],
    skill = 3038,
    paladin = [{4,3496,0}],
    wizard = [{4,3496,0}],
    assassin = [{4,3496,0}],
    soulReaper = [{4,3496,0}],
    mechanic = [{4,3496,0}],
    newplayer_1 = [{4,3496,0}],
    newplayer_2 = [{4,3496,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,58)->
    #shenqiCfg {
    id = 3,
    level = 58,
    upgrade = [{2,15000000},{9,60000}],
    skill = 3038,
    paladin = [{4,3773,0}],
    wizard = [{4,3773,0}],
    assassin = [{4,3773,0}],
    soulReaper = [{4,3773,0}],
    mechanic = [{4,3773,0}],
    newplayer_1 = [{4,3773,0}],
    newplayer_2 = [{4,3773,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,59)->
    #shenqiCfg {
    id = 3,
    level = 59,
    upgrade = [{2,20000000},{9,65000}],
    skill = 3038,
    paladin = [{4,4072,0}],
    wizard = [{4,4072,0}],
    assassin = [{4,4072,0}],
    soulReaper = [{4,4072,0}],
    mechanic = [{4,4072,0}],
    newplayer_1 = [{4,4072,0}],
    newplayer_2 = [{4,4072,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,60)->
    #shenqiCfg {
    id = 3,
    level = 60,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,4396,0}],
    wizard = [{4,4396,0}],
    assassin = [{4,4396,0}],
    soulReaper = [{4,4396,0}],
    mechanic = [{4,4396,0}],
    newplayer_1 = [{4,4396,0}],
    newplayer_2 = [{4,4396,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,61)->
    #shenqiCfg {
    id = 3,
    level = 61,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,4696,0}],
    wizard = [{4,4696,0}],
    assassin = [{4,4696,0}],
    soulReaper = [{4,4696,0}],
    mechanic = [{4,4696,0}],
    newplayer_1 = [{4,4696,0}],
    newplayer_2 = [{4,4696,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,62)->
    #shenqiCfg {
    id = 3,
    level = 62,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,4996,0}],
    wizard = [{4,4996,0}],
    assassin = [{4,4996,0}],
    soulReaper = [{4,4996,0}],
    mechanic = [{4,4996,0}],
    newplayer_1 = [{4,4996,0}],
    newplayer_2 = [{4,4996,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,63)->
    #shenqiCfg {
    id = 3,
    level = 63,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,5296,0}],
    wizard = [{4,5296,0}],
    assassin = [{4,5296,0}],
    soulReaper = [{4,5296,0}],
    mechanic = [{4,5296,0}],
    newplayer_1 = [{4,5296,0}],
    newplayer_2 = [{4,5296,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,64)->
    #shenqiCfg {
    id = 3,
    level = 64,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,5596,0}],
    wizard = [{4,5596,0}],
    assassin = [{4,5596,0}],
    soulReaper = [{4,5596,0}],
    mechanic = [{4,5596,0}],
    newplayer_1 = [{4,5596,0}],
    newplayer_2 = [{4,5596,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,65)->
    #shenqiCfg {
    id = 3,
    level = 65,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,5896,0}],
    wizard = [{4,5896,0}],
    assassin = [{4,5896,0}],
    soulReaper = [{4,5896,0}],
    mechanic = [{4,5896,0}],
    newplayer_1 = [{4,5896,0}],
    newplayer_2 = [{4,5896,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,66)->
    #shenqiCfg {
    id = 3,
    level = 66,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,6196,0}],
    wizard = [{4,6196,0}],
    assassin = [{4,6196,0}],
    soulReaper = [{4,6196,0}],
    mechanic = [{4,6196,0}],
    newplayer_1 = [{4,6196,0}],
    newplayer_2 = [{4,6196,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,67)->
    #shenqiCfg {
    id = 3,
    level = 67,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,6496,0}],
    wizard = [{4,6496,0}],
    assassin = [{4,6496,0}],
    soulReaper = [{4,6496,0}],
    mechanic = [{4,6496,0}],
    newplayer_1 = [{4,6496,0}],
    newplayer_2 = [{4,6496,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,68)->
    #shenqiCfg {
    id = 3,
    level = 68,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,6796,0}],
    wizard = [{4,6796,0}],
    assassin = [{4,6796,0}],
    soulReaper = [{4,6796,0}],
    mechanic = [{4,6796,0}],
    newplayer_1 = [{4,6796,0}],
    newplayer_2 = [{4,6796,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,69)->
    #shenqiCfg {
    id = 3,
    level = 69,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,7096,0}],
    wizard = [{4,7096,0}],
    assassin = [{4,7096,0}],
    soulReaper = [{4,7096,0}],
    mechanic = [{4,7096,0}],
    newplayer_1 = [{4,7096,0}],
    newplayer_2 = [{4,7096,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,70)->
    #shenqiCfg {
    id = 3,
    level = 70,
    upgrade = [{2,25000000},{9,72000}],
    skill = 3038,
    paladin = [{4,7396,0}],
    wizard = [{4,7396,0}],
    assassin = [{4,7396,0}],
    soulReaper = [{4,7396,0}],
    mechanic = [{4,7396,0}],
    newplayer_1 = [{4,7396,0}],
    newplayer_2 = [{4,7396,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,71)->
    #shenqiCfg {
    id = 3,
    level = 71,
    upgrade = [{2,30000000},{9,80000}],
    skill = 3038,
    paladin = [{4,7696,0}],
    wizard = [{4,7696,0}],
    assassin = [{4,7696,0}],
    soulReaper = [{4,7696,0}],
    mechanic = [{4,7696,0}],
    newplayer_1 = [{4,7696,0}],
    newplayer_2 = [{4,7696,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,72)->
    #shenqiCfg {
    id = 3,
    level = 72,
    upgrade = [{2,30000000},{9,80000}],
    skill = 3038,
    paladin = [{4,7996,0}],
    wizard = [{4,7996,0}],
    assassin = [{4,7996,0}],
    soulReaper = [{4,7996,0}],
    mechanic = [{4,7996,0}],
    newplayer_1 = [{4,7996,0}],
    newplayer_2 = [{4,7996,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,73)->
    #shenqiCfg {
    id = 3,
    level = 73,
    upgrade = [{2,30000000},{9,80000}],
    skill = 3038,
    paladin = [{4,8296,0}],
    wizard = [{4,8296,0}],
    assassin = [{4,8296,0}],
    soulReaper = [{4,8296,0}],
    mechanic = [{4,8296,0}],
    newplayer_1 = [{4,8296,0}],
    newplayer_2 = [{4,8296,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,74)->
    #shenqiCfg {
    id = 3,
    level = 74,
    upgrade = [{2,30000000},{9,80000}],
    skill = 3038,
    paladin = [{4,8596,0}],
    wizard = [{4,8596,0}],
    assassin = [{4,8596,0}],
    soulReaper = [{4,8596,0}],
    mechanic = [{4,8596,0}],
    newplayer_1 = [{4,8596,0}],
    newplayer_2 = [{4,8596,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(3,75)->
    #shenqiCfg {
    id = 3,
    level = 75,
    upgrade = [{2,30000000},{9,80000}],
    skill = 3038,
    paladin = [{4,8896,0}],
    wizard = [{4,8896,0}],
    assassin = [{4,8896,0}],
    soulReaper = [{4,8896,0}],
    mechanic = [{4,8896,0}],
    newplayer_1 = [{4,8896,0}],
    newplayer_2 = [{4,8896,0}],
    resources = 3,
    name = "塞纳之翼",
    txt = "精灵族所供奉神的弓,所散发出来的光辉护佑着整片精灵大地,千万年来它等待着真正王者的出现。"
    };
getRow(4,0)->
    #shenqiCfg {
    id = 4,
    level = 0,
    skill = 0,
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,1)->
    #shenqiCfg {
    id = 4,
    level = 1,
    upitem = [{2503,1}],
    skill = 3039,
    paladin = [{6,18,0}],
    wizard = [{6,18,0}],
    assassin = [{6,18,0}],
    soulReaper = [{6,18,0}],
    mechanic = [{6,18,0}],
    newplayer_1 = [{6,18,0}],
    newplayer_2 = [{6,18,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,2)->
    #shenqiCfg {
    id = 4,
    level = 2,
    upgrade = [{2,500},{5,100}],
    skill = 3039,
    paladin = [{6,21,0}],
    wizard = [{6,21,0}],
    assassin = [{6,21,0}],
    soulReaper = [{6,21,0}],
    mechanic = [{6,21,0}],
    newplayer_1 = [{6,21,0}],
    newplayer_2 = [{6,21,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,3)->
    #shenqiCfg {
    id = 4,
    level = 3,
    upgrade = [{2,1000},{5,200}],
    skill = 3039,
    paladin = [{6,23,0}],
    wizard = [{6,23,0}],
    assassin = [{6,23,0}],
    soulReaper = [{6,23,0}],
    mechanic = [{6,23,0}],
    newplayer_1 = [{6,23,0}],
    newplayer_2 = [{6,23,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,4)->
    #shenqiCfg {
    id = 4,
    level = 4,
    upgrade = [{2,1500},{5,300}],
    skill = 3039,
    paladin = [{6,24,0}],
    wizard = [{6,24,0}],
    assassin = [{6,24,0}],
    soulReaper = [{6,24,0}],
    mechanic = [{6,24,0}],
    newplayer_1 = [{6,24,0}],
    newplayer_2 = [{6,24,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,5)->
    #shenqiCfg {
    id = 4,
    level = 5,
    upgrade = [{2,2000},{5,400}],
    skill = 3039,
    paladin = [{6,26,0}],
    wizard = [{6,26,0}],
    assassin = [{6,26,0}],
    soulReaper = [{6,26,0}],
    mechanic = [{6,26,0}],
    newplayer_1 = [{6,26,0}],
    newplayer_2 = [{6,26,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,6)->
    #shenqiCfg {
    id = 4,
    level = 6,
    upgrade = [{2,2500},{5,500}],
    skill = 3039,
    paladin = [{6,28,0}],
    wizard = [{6,28,0}],
    assassin = [{6,28,0}],
    soulReaper = [{6,28,0}],
    mechanic = [{6,28,0}],
    newplayer_1 = [{6,28,0}],
    newplayer_2 = [{6,28,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,7)->
    #shenqiCfg {
    id = 4,
    level = 7,
    upgrade = [{2,3000},{5,600}],
    skill = 3039,
    paladin = [{6,31,0}],
    wizard = [{6,31,0}],
    assassin = [{6,31,0}],
    soulReaper = [{6,31,0}],
    mechanic = [{6,31,0}],
    newplayer_1 = [{6,31,0}],
    newplayer_2 = [{6,31,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,8)->
    #shenqiCfg {
    id = 4,
    level = 8,
    upgrade = [{2,3500},{5,700}],
    skill = 3039,
    paladin = [{6,33,0}],
    wizard = [{6,33,0}],
    assassin = [{6,33,0}],
    soulReaper = [{6,33,0}],
    mechanic = [{6,33,0}],
    newplayer_1 = [{6,33,0}],
    newplayer_2 = [{6,33,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,9)->
    #shenqiCfg {
    id = 4,
    level = 9,
    upgrade = [{2,4000},{5,800}],
    skill = 3039,
    paladin = [{6,36,0}],
    wizard = [{6,36,0}],
    assassin = [{6,36,0}],
    soulReaper = [{6,36,0}],
    mechanic = [{6,36,0}],
    newplayer_1 = [{6,36,0}],
    newplayer_2 = [{6,36,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,10)->
    #shenqiCfg {
    id = 4,
    level = 10,
    upgrade = [{2,4500},{5,900}],
    skill = 3039,
    paladin = [{6,39,0}],
    wizard = [{6,39,0}],
    assassin = [{6,39,0}],
    soulReaper = [{6,39,0}],
    mechanic = [{6,39,0}],
    newplayer_1 = [{6,39,0}],
    newplayer_2 = [{6,39,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,11)->
    #shenqiCfg {
    id = 4,
    level = 11,
    upgrade = [{2,5000},{5,1000}],
    skill = 3039,
    paladin = [{6,42,0}],
    wizard = [{6,42,0}],
    assassin = [{6,42,0}],
    soulReaper = [{6,42,0}],
    mechanic = [{6,42,0}],
    newplayer_1 = [{6,42,0}],
    newplayer_2 = [{6,42,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,12)->
    #shenqiCfg {
    id = 4,
    level = 12,
    upgrade = [{2,10000},{5,1200}],
    skill = 3039,
    paladin = [{6,45,0}],
    wizard = [{6,45,0}],
    assassin = [{6,45,0}],
    soulReaper = [{6,45,0}],
    mechanic = [{6,45,0}],
    newplayer_1 = [{6,45,0}],
    newplayer_2 = [{6,45,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,13)->
    #shenqiCfg {
    id = 4,
    level = 13,
    upgrade = [{2,15000},{5,1400}],
    skill = 3039,
    paladin = [{6,49,0}],
    wizard = [{6,49,0}],
    assassin = [{6,49,0}],
    soulReaper = [{6,49,0}],
    mechanic = [{6,49,0}],
    newplayer_1 = [{6,49,0}],
    newplayer_2 = [{6,49,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,14)->
    #shenqiCfg {
    id = 4,
    level = 14,
    upgrade = [{2,20000},{5,1600}],
    skill = 3039,
    paladin = [{6,52,0}],
    wizard = [{6,52,0}],
    assassin = [{6,52,0}],
    soulReaper = [{6,52,0}],
    mechanic = [{6,52,0}],
    newplayer_1 = [{6,52,0}],
    newplayer_2 = [{6,52,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,15)->
    #shenqiCfg {
    id = 4,
    level = 15,
    upgrade = [{2,25000},{5,1900}],
    skill = 3039,
    paladin = [{6,57,0}],
    wizard = [{6,57,0}],
    assassin = [{6,57,0}],
    soulReaper = [{6,57,0}],
    mechanic = [{6,57,0}],
    newplayer_1 = [{6,57,0}],
    newplayer_2 = [{6,57,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,16)->
    #shenqiCfg {
    id = 4,
    level = 16,
    upgrade = [{2,30000},{5,2300}],
    skill = 3039,
    paladin = [{6,61,0}],
    wizard = [{6,61,0}],
    assassin = [{6,61,0}],
    soulReaper = [{6,61,0}],
    mechanic = [{6,61,0}],
    newplayer_1 = [{6,61,0}],
    newplayer_2 = [{6,61,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,17)->
    #shenqiCfg {
    id = 4,
    level = 17,
    upgrade = [{2,35000},{5,2700}],
    skill = 3039,
    paladin = [{6,66,0}],
    wizard = [{6,66,0}],
    assassin = [{6,66,0}],
    soulReaper = [{6,66,0}],
    mechanic = [{6,66,0}],
    newplayer_1 = [{6,66,0}],
    newplayer_2 = [{6,66,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,18)->
    #shenqiCfg {
    id = 4,
    level = 18,
    upgrade = [{2,40000},{5,3100}],
    skill = 3039,
    paladin = [{6,71,0}],
    wizard = [{6,71,0}],
    assassin = [{6,71,0}],
    soulReaper = [{6,71,0}],
    mechanic = [{6,71,0}],
    newplayer_1 = [{6,71,0}],
    newplayer_2 = [{6,71,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,19)->
    #shenqiCfg {
    id = 4,
    level = 19,
    upgrade = [{2,45000},{5,3600}],
    skill = 3039,
    paladin = [{6,77,0}],
    wizard = [{6,77,0}],
    assassin = [{6,77,0}],
    soulReaper = [{6,77,0}],
    mechanic = [{6,77,0}],
    newplayer_1 = [{6,77,0}],
    newplayer_2 = [{6,77,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,20)->
    #shenqiCfg {
    id = 4,
    level = 20,
    upgrade = [{2,50000},{5,4200}],
    skill = 3039,
    paladin = [{6,83,0}],
    wizard = [{6,83,0}],
    assassin = [{6,83,0}],
    soulReaper = [{6,83,0}],
    mechanic = [{6,83,0}],
    newplayer_1 = [{6,83,0}],
    newplayer_2 = [{6,83,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,21)->
    #shenqiCfg {
    id = 4,
    level = 21,
    upgrade = [{2,100000},{5,4800}],
    skill = 3039,
    paladin = [{6,89,0}],
    wizard = [{6,89,0}],
    assassin = [{6,89,0}],
    soulReaper = [{6,89,0}],
    mechanic = [{6,89,0}],
    newplayer_1 = [{6,89,0}],
    newplayer_2 = [{6,89,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,22)->
    #shenqiCfg {
    id = 4,
    level = 22,
    upgrade = [{2,150000},{5,5400}],
    skill = 3039,
    paladin = [{6,97,0}],
    wizard = [{6,97,0}],
    assassin = [{6,97,0}],
    soulReaper = [{6,97,0}],
    mechanic = [{6,97,0}],
    newplayer_1 = [{6,97,0}],
    newplayer_2 = [{6,97,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,23)->
    #shenqiCfg {
    id = 4,
    level = 23,
    upgrade = [{2,200000},{5,6200}],
    skill = 3039,
    paladin = [{6,104,0}],
    wizard = [{6,104,0}],
    assassin = [{6,104,0}],
    soulReaper = [{6,104,0}],
    mechanic = [{6,104,0}],
    newplayer_1 = [{6,104,0}],
    newplayer_2 = [{6,104,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,24)->
    #shenqiCfg {
    id = 4,
    level = 24,
    upgrade = [{2,250000},{5,7000}],
    skill = 3039,
    paladin = [{6,113,0}],
    wizard = [{6,113,0}],
    assassin = [{6,113,0}],
    soulReaper = [{6,113,0}],
    mechanic = [{6,113,0}],
    newplayer_1 = [{6,113,0}],
    newplayer_2 = [{6,113,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,25)->
    #shenqiCfg {
    id = 4,
    level = 25,
    upgrade = [{2,300000},{5,8000}],
    skill = 3039,
    paladin = [{6,121,0}],
    wizard = [{6,121,0}],
    assassin = [{6,121,0}],
    soulReaper = [{6,121,0}],
    mechanic = [{6,121,0}],
    newplayer_1 = [{6,121,0}],
    newplayer_2 = [{6,121,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,26)->
    #shenqiCfg {
    id = 4,
    level = 26,
    upgrade = [{2,350000},{5,9000}],
    skill = 3039,
    paladin = [{6,131,0}],
    wizard = [{6,131,0}],
    assassin = [{6,131,0}],
    soulReaper = [{6,131,0}],
    mechanic = [{6,131,0}],
    newplayer_1 = [{6,131,0}],
    newplayer_2 = [{6,131,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,27)->
    #shenqiCfg {
    id = 4,
    level = 27,
    upgrade = [{2,400000},{5,10000}],
    skill = 3039,
    paladin = [{6,141,0}],
    wizard = [{6,141,0}],
    assassin = [{6,141,0}],
    soulReaper = [{6,141,0}],
    mechanic = [{6,141,0}],
    newplayer_1 = [{6,141,0}],
    newplayer_2 = [{6,141,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,28)->
    #shenqiCfg {
    id = 4,
    level = 28,
    upgrade = [{2,450000},{5,11000}],
    skill = 3039,
    paladin = [{6,153,0}],
    wizard = [{6,153,0}],
    assassin = [{6,153,0}],
    soulReaper = [{6,153,0}],
    mechanic = [{6,153,0}],
    newplayer_1 = [{6,153,0}],
    newplayer_2 = [{6,153,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,29)->
    #shenqiCfg {
    id = 4,
    level = 29,
    upgrade = [{2,500000},{5,13000}],
    skill = 3039,
    paladin = [{6,165,0}],
    wizard = [{6,165,0}],
    assassin = [{6,165,0}],
    soulReaper = [{6,165,0}],
    mechanic = [{6,165,0}],
    newplayer_1 = [{6,165,0}],
    newplayer_2 = [{6,165,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,30)->
    #shenqiCfg {
    id = 4,
    level = 30,
    upgrade = [{2,600000},{5,14000}],
    skill = 3039,
    paladin = [{6,178,0}],
    wizard = [{6,178,0}],
    assassin = [{6,178,0}],
    soulReaper = [{6,178,0}],
    mechanic = [{6,178,0}],
    newplayer_1 = [{6,178,0}],
    newplayer_2 = [{6,178,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,31)->
    #shenqiCfg {
    id = 4,
    level = 31,
    upgrade = [{2,700000},{5,16000}],
    skill = 3039,
    paladin = [{6,192,0}],
    wizard = [{6,192,0}],
    assassin = [{6,192,0}],
    soulReaper = [{6,192,0}],
    mechanic = [{6,192,0}],
    newplayer_1 = [{6,192,0}],
    newplayer_2 = [{6,192,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,32)->
    #shenqiCfg {
    id = 4,
    level = 32,
    upgrade = [{2,800000},{5,18000}],
    skill = 3039,
    paladin = [{6,207,0}],
    wizard = [{6,207,0}],
    assassin = [{6,207,0}],
    soulReaper = [{6,207,0}],
    mechanic = [{6,207,0}],
    newplayer_1 = [{6,207,0}],
    newplayer_2 = [{6,207,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,33)->
    #shenqiCfg {
    id = 4,
    level = 33,
    upgrade = [{2,900000},{5,19000}],
    skill = 3039,
    paladin = [{6,224,0}],
    wizard = [{6,224,0}],
    assassin = [{6,224,0}],
    soulReaper = [{6,224,0}],
    mechanic = [{6,224,0}],
    newplayer_1 = [{6,224,0}],
    newplayer_2 = [{6,224,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,34)->
    #shenqiCfg {
    id = 4,
    level = 34,
    upgrade = [{2,1000000},{5,22000}],
    skill = 3039,
    paladin = [{6,241,0}],
    wizard = [{6,241,0}],
    assassin = [{6,241,0}],
    soulReaper = [{6,241,0}],
    mechanic = [{6,241,0}],
    newplayer_1 = [{6,241,0}],
    newplayer_2 = [{6,241,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,35)->
    #shenqiCfg {
    id = 4,
    level = 35,
    upgrade = [{2,1100000},{5,24000}],
    skill = 3039,
    paladin = [{6,261,0}],
    wizard = [{6,261,0}],
    assassin = [{6,261,0}],
    soulReaper = [{6,261,0}],
    mechanic = [{6,261,0}],
    newplayer_1 = [{6,261,0}],
    newplayer_2 = [{6,261,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,36)->
    #shenqiCfg {
    id = 4,
    level = 36,
    upgrade = [{2,1200000},{5,27000}],
    skill = 3039,
    paladin = [{6,281,0}],
    wizard = [{6,281,0}],
    assassin = [{6,281,0}],
    soulReaper = [{6,281,0}],
    mechanic = [{6,281,0}],
    newplayer_1 = [{6,281,0}],
    newplayer_2 = [{6,281,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,37)->
    #shenqiCfg {
    id = 4,
    level = 37,
    upgrade = [{2,1300000},{5,30000}],
    skill = 3039,
    paladin = [{6,304,0}],
    wizard = [{6,304,0}],
    assassin = [{6,304,0}],
    soulReaper = [{6,304,0}],
    mechanic = [{6,304,0}],
    newplayer_1 = [{6,304,0}],
    newplayer_2 = [{6,304,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,38)->
    #shenqiCfg {
    id = 4,
    level = 38,
    upgrade = [{2,1400000},{5,34000}],
    skill = 3039,
    paladin = [{6,328,0}],
    wizard = [{6,328,0}],
    assassin = [{6,328,0}],
    soulReaper = [{6,328,0}],
    mechanic = [{6,328,0}],
    newplayer_1 = [{6,328,0}],
    newplayer_2 = [{6,328,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,39)->
    #shenqiCfg {
    id = 4,
    level = 39,
    upgrade = [{2,1500000},{5,37000}],
    skill = 3039,
    paladin = [{6,354,0}],
    wizard = [{6,354,0}],
    assassin = [{6,354,0}],
    soulReaper = [{6,354,0}],
    mechanic = [{6,354,0}],
    newplayer_1 = [{6,354,0}],
    newplayer_2 = [{6,354,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,40)->
    #shenqiCfg {
    id = 4,
    level = 40,
    upgrade = [{2,1600000},{5,42000}],
    skill = 3039,
    paladin = [{6,382,0}],
    wizard = [{6,382,0}],
    assassin = [{6,382,0}],
    soulReaper = [{6,382,0}],
    mechanic = [{6,382,0}],
    newplayer_1 = [{6,382,0}],
    newplayer_2 = [{6,382,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,41)->
    #shenqiCfg {
    id = 4,
    level = 41,
    upgrade = [{2,1700000},{5,46000}],
    skill = 3039,
    paladin = [{6,412,0}],
    wizard = [{6,412,0}],
    assassin = [{6,412,0}],
    soulReaper = [{6,412,0}],
    mechanic = [{6,412,0}],
    newplayer_1 = [{6,412,0}],
    newplayer_2 = [{6,412,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,42)->
    #shenqiCfg {
    id = 4,
    level = 42,
    upgrade = [{2,1800000},{5,51000}],
    skill = 3039,
    paladin = [{6,445,0}],
    wizard = [{6,445,0}],
    assassin = [{6,445,0}],
    soulReaper = [{6,445,0}],
    mechanic = [{6,445,0}],
    newplayer_1 = [{6,445,0}],
    newplayer_2 = [{6,445,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,43)->
    #shenqiCfg {
    id = 4,
    level = 43,
    upgrade = [{2,1900000},{5,55000}],
    skill = 3039,
    paladin = [{6,480,0}],
    wizard = [{6,480,0}],
    assassin = [{6,480,0}],
    soulReaper = [{6,480,0}],
    mechanic = [{6,480,0}],
    newplayer_1 = [{6,480,0}],
    newplayer_2 = [{6,480,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,44)->
    #shenqiCfg {
    id = 4,
    level = 44,
    upgrade = [{2,2000000},{5,61000}],
    skill = 3039,
    paladin = [{6,518,0}],
    wizard = [{6,518,0}],
    assassin = [{6,518,0}],
    soulReaper = [{6,518,0}],
    mechanic = [{6,518,0}],
    newplayer_1 = [{6,518,0}],
    newplayer_2 = [{6,518,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,45)->
    #shenqiCfg {
    id = 4,
    level = 45,
    upgrade = [{2,2100000},{5,66000}],
    skill = 3039,
    paladin = [{6,559,0}],
    wizard = [{6,559,0}],
    assassin = [{6,559,0}],
    soulReaper = [{6,559,0}],
    mechanic = [{6,559,0}],
    newplayer_1 = [{6,559,0}],
    newplayer_2 = [{6,559,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,46)->
    #shenqiCfg {
    id = 4,
    level = 46,
    upgrade = [{2,2200000},{5,72000}],
    skill = 3039,
    paladin = [{6,604,0}],
    wizard = [{6,604,0}],
    assassin = [{6,604,0}],
    soulReaper = [{6,604,0}],
    mechanic = [{6,604,0}],
    newplayer_1 = [{6,604,0}],
    newplayer_2 = [{6,604,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,47)->
    #shenqiCfg {
    id = 4,
    level = 47,
    upgrade = [{2,2300000},{5,79000}],
    skill = 3039,
    paladin = [{6,652,0}],
    wizard = [{6,652,0}],
    assassin = [{6,652,0}],
    soulReaper = [{6,652,0}],
    mechanic = [{6,652,0}],
    newplayer_1 = [{6,652,0}],
    newplayer_2 = [{6,652,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,48)->
    #shenqiCfg {
    id = 4,
    level = 48,
    upgrade = [{2,2400000},{5,86000}],
    skill = 3039,
    paladin = [{6,703,0}],
    wizard = [{6,703,0}],
    assassin = [{6,703,0}],
    soulReaper = [{6,703,0}],
    mechanic = [{6,703,0}],
    newplayer_1 = [{6,703,0}],
    newplayer_2 = [{6,703,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,49)->
    #shenqiCfg {
    id = 4,
    level = 49,
    upgrade = [{2,2500000},{5,93000}],
    skill = 3039,
    paladin = [{6,759,0}],
    wizard = [{6,759,0}],
    assassin = [{6,759,0}],
    soulReaper = [{6,759,0}],
    mechanic = [{6,759,0}],
    newplayer_1 = [{6,759,0}],
    newplayer_2 = [{6,759,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,50)->
    #shenqiCfg {
    id = 4,
    level = 50,
    upgrade = [{2,3000000},{5,101000}],
    skill = 3039,
    paladin = [{6,819,0}],
    wizard = [{6,819,0}],
    assassin = [{6,819,0}],
    soulReaper = [{6,819,0}],
    mechanic = [{6,819,0}],
    newplayer_1 = [{6,819,0}],
    newplayer_2 = [{6,819,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,51)->
    #shenqiCfg {
    id = 4,
    level = 51,
    upgrade = [{2,3500000},{5,109000}],
    skill = 3039,
    paladin = [{6,884,0}],
    wizard = [{6,884,0}],
    assassin = [{6,884,0}],
    soulReaper = [{6,884,0}],
    mechanic = [{6,884,0}],
    newplayer_1 = [{6,884,0}],
    newplayer_2 = [{6,884,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,52)->
    #shenqiCfg {
    id = 4,
    level = 52,
    upgrade = [{2,4000000},{5,118000}],
    skill = 3039,
    paladin = [{6,954,0}],
    wizard = [{6,954,0}],
    assassin = [{6,954,0}],
    soulReaper = [{6,954,0}],
    mechanic = [{6,954,0}],
    newplayer_1 = [{6,954,0}],
    newplayer_2 = [{6,954,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,53)->
    #shenqiCfg {
    id = 4,
    level = 53,
    upgrade = [{2,4500000},{5,128000}],
    skill = 3039,
    paladin = [{6,1030,0}],
    wizard = [{6,1030,0}],
    assassin = [{6,1030,0}],
    soulReaper = [{6,1030,0}],
    mechanic = [{6,1030,0}],
    newplayer_1 = [{6,1030,0}],
    newplayer_2 = [{6,1030,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,54)->
    #shenqiCfg {
    id = 4,
    level = 54,
    upgrade = [{2,5000000},{5,139000}],
    skill = 3039,
    paladin = [{6,1112,0}],
    wizard = [{6,1112,0}],
    assassin = [{6,1112,0}],
    soulReaper = [{6,1112,0}],
    mechanic = [{6,1112,0}],
    newplayer_1 = [{6,1112,0}],
    newplayer_2 = [{6,1112,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,55)->
    #shenqiCfg {
    id = 4,
    level = 55,
    upgrade = [{2,6000000},{5,151000}],
    skill = 3039,
    paladin = [{6,1200,0}],
    wizard = [{6,1200,0}],
    assassin = [{6,1200,0}],
    soulReaper = [{6,1200,0}],
    mechanic = [{6,1200,0}],
    newplayer_1 = [{6,1200,0}],
    newplayer_2 = [{6,1200,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,56)->
    #shenqiCfg {
    id = 4,
    level = 56,
    upgrade = [{2,7500000},{5,164000}],
    skill = 3039,
    paladin = [{6,1295,0}],
    wizard = [{6,1295,0}],
    assassin = [{6,1295,0}],
    soulReaper = [{6,1295,0}],
    mechanic = [{6,1295,0}],
    newplayer_1 = [{6,1295,0}],
    newplayer_2 = [{6,1295,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,57)->
    #shenqiCfg {
    id = 4,
    level = 57,
    upgrade = [{2,10000000},{5,177000}],
    skill = 3039,
    paladin = [{6,1398,0}],
    wizard = [{6,1398,0}],
    assassin = [{6,1398,0}],
    soulReaper = [{6,1398,0}],
    mechanic = [{6,1398,0}],
    newplayer_1 = [{6,1398,0}],
    newplayer_2 = [{6,1398,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,58)->
    #shenqiCfg {
    id = 4,
    level = 58,
    upgrade = [{2,15000000},{5,192000}],
    skill = 3039,
    paladin = [{6,1509,0}],
    wizard = [{6,1509,0}],
    assassin = [{6,1509,0}],
    soulReaper = [{6,1509,0}],
    mechanic = [{6,1509,0}],
    newplayer_1 = [{6,1509,0}],
    newplayer_2 = [{6,1509,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,59)->
    #shenqiCfg {
    id = 4,
    level = 59,
    upgrade = [{2,20000000},{5,207000}],
    skill = 3039,
    paladin = [{6,1629,0}],
    wizard = [{6,1629,0}],
    assassin = [{6,1629,0}],
    soulReaper = [{6,1629,0}],
    mechanic = [{6,1629,0}],
    newplayer_1 = [{6,1629,0}],
    newplayer_2 = [{6,1629,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,60)->
    #shenqiCfg {
    id = 4,
    level = 60,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,1758,0}],
    wizard = [{6,1758,0}],
    assassin = [{6,1758,0}],
    soulReaper = [{6,1758,0}],
    mechanic = [{6,1758,0}],
    newplayer_1 = [{6,1758,0}],
    newplayer_2 = [{6,1758,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,61)->
    #shenqiCfg {
    id = 4,
    level = 61,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,1808,0}],
    wizard = [{6,1808,0}],
    assassin = [{6,1808,0}],
    soulReaper = [{6,1808,0}],
    mechanic = [{6,1808,0}],
    newplayer_1 = [{6,1808,0}],
    newplayer_2 = [{6,1808,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,62)->
    #shenqiCfg {
    id = 4,
    level = 62,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,1858,0}],
    wizard = [{6,1858,0}],
    assassin = [{6,1858,0}],
    soulReaper = [{6,1858,0}],
    mechanic = [{6,1858,0}],
    newplayer_1 = [{6,1858,0}],
    newplayer_2 = [{6,1858,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,63)->
    #shenqiCfg {
    id = 4,
    level = 63,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,1908,0}],
    wizard = [{6,1908,0}],
    assassin = [{6,1908,0}],
    soulReaper = [{6,1908,0}],
    mechanic = [{6,1908,0}],
    newplayer_1 = [{6,1908,0}],
    newplayer_2 = [{6,1908,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,64)->
    #shenqiCfg {
    id = 4,
    level = 64,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,1958,0}],
    wizard = [{6,1958,0}],
    assassin = [{6,1958,0}],
    soulReaper = [{6,1958,0}],
    mechanic = [{6,1958,0}],
    newplayer_1 = [{6,1958,0}],
    newplayer_2 = [{6,1958,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,65)->
    #shenqiCfg {
    id = 4,
    level = 65,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,2008,0}],
    wizard = [{6,2008,0}],
    assassin = [{6,2008,0}],
    soulReaper = [{6,2008,0}],
    mechanic = [{6,2008,0}],
    newplayer_1 = [{6,2008,0}],
    newplayer_2 = [{6,2008,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,66)->
    #shenqiCfg {
    id = 4,
    level = 66,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,2058,0}],
    wizard = [{6,2058,0}],
    assassin = [{6,2058,0}],
    soulReaper = [{6,2058,0}],
    mechanic = [{6,2058,0}],
    newplayer_1 = [{6,2058,0}],
    newplayer_2 = [{6,2058,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,67)->
    #shenqiCfg {
    id = 4,
    level = 67,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,2108,0}],
    wizard = [{6,2108,0}],
    assassin = [{6,2108,0}],
    soulReaper = [{6,2108,0}],
    mechanic = [{6,2108,0}],
    newplayer_1 = [{6,2108,0}],
    newplayer_2 = [{6,2108,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,68)->
    #shenqiCfg {
    id = 4,
    level = 68,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,2158,0}],
    wizard = [{6,2158,0}],
    assassin = [{6,2158,0}],
    soulReaper = [{6,2158,0}],
    mechanic = [{6,2158,0}],
    newplayer_1 = [{6,2158,0}],
    newplayer_2 = [{6,2158,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,69)->
    #shenqiCfg {
    id = 4,
    level = 69,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,2208,0}],
    wizard = [{6,2208,0}],
    assassin = [{6,2208,0}],
    soulReaper = [{6,2208,0}],
    mechanic = [{6,2208,0}],
    newplayer_1 = [{6,2208,0}],
    newplayer_2 = [{6,2208,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,70)->
    #shenqiCfg {
    id = 4,
    level = 70,
    upgrade = [{2,25000000},{5,224000}],
    skill = 3039,
    paladin = [{6,2258,0}],
    wizard = [{6,2258,0}],
    assassin = [{6,2258,0}],
    soulReaper = [{6,2258,0}],
    mechanic = [{6,2258,0}],
    newplayer_1 = [{6,2258,0}],
    newplayer_2 = [{6,2258,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,71)->
    #shenqiCfg {
    id = 4,
    level = 71,
    upgrade = [{2,30000000},{5,250000}],
    skill = 3039,
    paladin = [{6,2308,0}],
    wizard = [{6,2308,0}],
    assassin = [{6,2308,0}],
    soulReaper = [{6,2308,0}],
    mechanic = [{6,2308,0}],
    newplayer_1 = [{6,2308,0}],
    newplayer_2 = [{6,2308,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,72)->
    #shenqiCfg {
    id = 4,
    level = 72,
    upgrade = [{2,30000000},{5,250000}],
    skill = 3039,
    paladin = [{6,2358,0}],
    wizard = [{6,2358,0}],
    assassin = [{6,2358,0}],
    soulReaper = [{6,2358,0}],
    mechanic = [{6,2358,0}],
    newplayer_1 = [{6,2358,0}],
    newplayer_2 = [{6,2358,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,73)->
    #shenqiCfg {
    id = 4,
    level = 73,
    upgrade = [{2,30000000},{5,250000}],
    skill = 3039,
    paladin = [{6,2408,0}],
    wizard = [{6,2408,0}],
    assassin = [{6,2408,0}],
    soulReaper = [{6,2408,0}],
    mechanic = [{6,2408,0}],
    newplayer_1 = [{6,2408,0}],
    newplayer_2 = [{6,2408,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,74)->
    #shenqiCfg {
    id = 4,
    level = 74,
    upgrade = [{2,30000000},{5,250000}],
    skill = 3039,
    paladin = [{6,2458,0}],
    wizard = [{6,2458,0}],
    assassin = [{6,2458,0}],
    soulReaper = [{6,2458,0}],
    mechanic = [{6,2458,0}],
    newplayer_1 = [{6,2458,0}],
    newplayer_2 = [{6,2458,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(4,75)->
    #shenqiCfg {
    id = 4,
    level = 75,
    upgrade = [{2,30000000},{5,250000}],
    skill = 3039,
    paladin = [{6,2508,0}],
    wizard = [{6,2508,0}],
    assassin = [{6,2508,0}],
    soulReaper = [{6,2508,0}],
    mechanic = [{6,2508,0}],
    newplayer_1 = [{6,2508,0}],
    newplayer_2 = [{6,2508,0}],
    resources = 4,
    name = "萃寒霜剑",
    txt = "造物者以万年寒冰所铸神剑,剑痕划过之处冰封万里,雪舞漫天。"
    };
getRow(5,0)->
    #shenqiCfg {
    id = 5,
    level = 0,
    skill = 0,
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,1)->
    #shenqiCfg {
    id = 5,
    level = 1,
    upitem = [{2504,1}],
    skill = 3040,
    paladin = [{26,59,0}],
    wizard = [{26,59,0}],
    assassin = [{26,59,0}],
    soulReaper = [{26,59,0}],
    mechanic = [{26,59,0}],
    newplayer_1 = [{26,59,0}],
    newplayer_2 = [{26,59,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,2)->
    #shenqiCfg {
    id = 5,
    level = 2,
    upgrade = [{2,500},{7,100}],
    skill = 3040,
    paladin = [{26,69,0}],
    wizard = [{26,69,0}],
    assassin = [{26,69,0}],
    soulReaper = [{26,69,0}],
    mechanic = [{26,69,0}],
    newplayer_1 = [{26,69,0}],
    newplayer_2 = [{26,69,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,3)->
    #shenqiCfg {
    id = 5,
    level = 3,
    upgrade = [{2,1000},{7,200}],
    skill = 3040,
    paladin = [{26,74,0}],
    wizard = [{26,74,0}],
    assassin = [{26,74,0}],
    soulReaper = [{26,74,0}],
    mechanic = [{26,74,0}],
    newplayer_1 = [{26,74,0}],
    newplayer_2 = [{26,74,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,4)->
    #shenqiCfg {
    id = 5,
    level = 4,
    upgrade = [{2,1500},{7,300}],
    skill = 3040,
    paladin = [{26,80,0}],
    wizard = [{26,80,0}],
    assassin = [{26,80,0}],
    soulReaper = [{26,80,0}],
    mechanic = [{26,80,0}],
    newplayer_1 = [{26,80,0}],
    newplayer_2 = [{26,80,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,5)->
    #shenqiCfg {
    id = 5,
    level = 5,
    upgrade = [{2,2000},{7,400}],
    skill = 3040,
    paladin = [{26,86,0}],
    wizard = [{26,86,0}],
    assassin = [{26,86,0}],
    soulReaper = [{26,86,0}],
    mechanic = [{26,86,0}],
    newplayer_1 = [{26,86,0}],
    newplayer_2 = [{26,86,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,6)->
    #shenqiCfg {
    id = 5,
    level = 6,
    upgrade = [{2,2500},{7,500}],
    skill = 3040,
    paladin = [{26,93,0}],
    wizard = [{26,93,0}],
    assassin = [{26,93,0}],
    soulReaper = [{26,93,0}],
    mechanic = [{26,93,0}],
    newplayer_1 = [{26,93,0}],
    newplayer_2 = [{26,93,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,7)->
    #shenqiCfg {
    id = 5,
    level = 7,
    upgrade = [{2,3000},{7,600}],
    skill = 3040,
    paladin = [{26,101,0}],
    wizard = [{26,101,0}],
    assassin = [{26,101,0}],
    soulReaper = [{26,101,0}],
    mechanic = [{26,101,0}],
    newplayer_1 = [{26,101,0}],
    newplayer_2 = [{26,101,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,8)->
    #shenqiCfg {
    id = 5,
    level = 8,
    upgrade = [{2,3500},{7,700}],
    skill = 3040,
    paladin = [{26,109,0}],
    wizard = [{26,109,0}],
    assassin = [{26,109,0}],
    soulReaper = [{26,109,0}],
    mechanic = [{26,109,0}],
    newplayer_1 = [{26,109,0}],
    newplayer_2 = [{26,109,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,9)->
    #shenqiCfg {
    id = 5,
    level = 9,
    upgrade = [{2,4000},{7,800}],
    skill = 3040,
    paladin = [{26,117,0}],
    wizard = [{26,117,0}],
    assassin = [{26,117,0}],
    soulReaper = [{26,117,0}],
    mechanic = [{26,117,0}],
    newplayer_1 = [{26,117,0}],
    newplayer_2 = [{26,117,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,10)->
    #shenqiCfg {
    id = 5,
    level = 10,
    upgrade = [{2,4500},{7,900}],
    skill = 3040,
    paladin = [{26,127,0}],
    wizard = [{26,127,0}],
    assassin = [{26,127,0}],
    soulReaper = [{26,127,0}],
    mechanic = [{26,127,0}],
    newplayer_1 = [{26,127,0}],
    newplayer_2 = [{26,127,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,11)->
    #shenqiCfg {
    id = 5,
    level = 11,
    upgrade = [{2,5000},{7,1000}],
    skill = 3040,
    paladin = [{26,137,0}],
    wizard = [{26,137,0}],
    assassin = [{26,137,0}],
    soulReaper = [{26,137,0}],
    mechanic = [{26,137,0}],
    newplayer_1 = [{26,137,0}],
    newplayer_2 = [{26,137,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,12)->
    #shenqiCfg {
    id = 5,
    level = 12,
    upgrade = [{2,10000},{7,1200}],
    skill = 3040,
    paladin = [{26,147,0}],
    wizard = [{26,147,0}],
    assassin = [{26,147,0}],
    soulReaper = [{26,147,0}],
    mechanic = [{26,147,0}],
    newplayer_1 = [{26,147,0}],
    newplayer_2 = [{26,147,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,13)->
    #shenqiCfg {
    id = 5,
    level = 13,
    upgrade = [{2,15000},{7,1400}],
    skill = 3040,
    paladin = [{26,159,0}],
    wizard = [{26,159,0}],
    assassin = [{26,159,0}],
    soulReaper = [{26,159,0}],
    mechanic = [{26,159,0}],
    newplayer_1 = [{26,159,0}],
    newplayer_2 = [{26,159,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,14)->
    #shenqiCfg {
    id = 5,
    level = 14,
    upgrade = [{2,20000},{7,1600}],
    skill = 3040,
    paladin = [{26,172,0}],
    wizard = [{26,172,0}],
    assassin = [{26,172,0}],
    soulReaper = [{26,172,0}],
    mechanic = [{26,172,0}],
    newplayer_1 = [{26,172,0}],
    newplayer_2 = [{26,172,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,15)->
    #shenqiCfg {
    id = 5,
    level = 15,
    upgrade = [{2,25000},{7,1900}],
    skill = 3040,
    paladin = [{26,185,0}],
    wizard = [{26,185,0}],
    assassin = [{26,185,0}],
    soulReaper = [{26,185,0}],
    mechanic = [{26,185,0}],
    newplayer_1 = [{26,185,0}],
    newplayer_2 = [{26,185,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,16)->
    #shenqiCfg {
    id = 5,
    level = 16,
    upgrade = [{2,30000},{7,2300}],
    skill = 3040,
    paladin = [{26,200,0}],
    wizard = [{26,200,0}],
    assassin = [{26,200,0}],
    soulReaper = [{26,200,0}],
    mechanic = [{26,200,0}],
    newplayer_1 = [{26,200,0}],
    newplayer_2 = [{26,200,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,17)->
    #shenqiCfg {
    id = 5,
    level = 17,
    upgrade = [{2,35000},{7,2700}],
    skill = 3040,
    paladin = [{26,216,0}],
    wizard = [{26,216,0}],
    assassin = [{26,216,0}],
    soulReaper = [{26,216,0}],
    mechanic = [{26,216,0}],
    newplayer_1 = [{26,216,0}],
    newplayer_2 = [{26,216,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,18)->
    #shenqiCfg {
    id = 5,
    level = 18,
    upgrade = [{2,40000},{7,3100}],
    skill = 3040,
    paladin = [{26,233,0}],
    wizard = [{26,233,0}],
    assassin = [{26,233,0}],
    soulReaper = [{26,233,0}],
    mechanic = [{26,233,0}],
    newplayer_1 = [{26,233,0}],
    newplayer_2 = [{26,233,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,19)->
    #shenqiCfg {
    id = 5,
    level = 19,
    upgrade = [{2,45000},{7,3600}],
    skill = 3040,
    paladin = [{26,252,0}],
    wizard = [{26,252,0}],
    assassin = [{26,252,0}],
    soulReaper = [{26,252,0}],
    mechanic = [{26,252,0}],
    newplayer_1 = [{26,252,0}],
    newplayer_2 = [{26,252,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,20)->
    #shenqiCfg {
    id = 5,
    level = 20,
    upgrade = [{2,50000},{7,4200}],
    skill = 3040,
    paladin = [{26,272,0}],
    wizard = [{26,272,0}],
    assassin = [{26,272,0}],
    soulReaper = [{26,272,0}],
    mechanic = [{26,272,0}],
    newplayer_1 = [{26,272,0}],
    newplayer_2 = [{26,272,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,21)->
    #shenqiCfg {
    id = 5,
    level = 21,
    upgrade = [{2,100000},{7,4800}],
    skill = 3040,
    paladin = [{26,293,0}],
    wizard = [{26,293,0}],
    assassin = [{26,293,0}],
    soulReaper = [{26,293,0}],
    mechanic = [{26,293,0}],
    newplayer_1 = [{26,293,0}],
    newplayer_2 = [{26,293,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,22)->
    #shenqiCfg {
    id = 5,
    level = 22,
    upgrade = [{2,150000},{7,5500}],
    skill = 3040,
    paladin = [{26,316,0}],
    wizard = [{26,316,0}],
    assassin = [{26,316,0}],
    soulReaper = [{26,316,0}],
    mechanic = [{26,316,0}],
    newplayer_1 = [{26,316,0}],
    newplayer_2 = [{26,316,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,23)->
    #shenqiCfg {
    id = 5,
    level = 23,
    upgrade = [{2,200000},{7,6400}],
    skill = 3040,
    paladin = [{26,341,0}],
    wizard = [{26,341,0}],
    assassin = [{26,341,0}],
    soulReaper = [{26,341,0}],
    mechanic = [{26,341,0}],
    newplayer_1 = [{26,341,0}],
    newplayer_2 = [{26,341,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,24)->
    #shenqiCfg {
    id = 5,
    level = 24,
    upgrade = [{2,250000},{7,7500}],
    skill = 3040,
    paladin = [{26,369,0}],
    wizard = [{26,369,0}],
    assassin = [{26,369,0}],
    soulReaper = [{26,369,0}],
    mechanic = [{26,369,0}],
    newplayer_1 = [{26,369,0}],
    newplayer_2 = [{26,369,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,25)->
    #shenqiCfg {
    id = 5,
    level = 25,
    upgrade = [{2,300000},{7,8800}],
    skill = 3040,
    paladin = [{26,398,0}],
    wizard = [{26,398,0}],
    assassin = [{26,398,0}],
    soulReaper = [{26,398,0}],
    mechanic = [{26,398,0}],
    newplayer_1 = [{26,398,0}],
    newplayer_2 = [{26,398,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,26)->
    #shenqiCfg {
    id = 5,
    level = 26,
    upgrade = [{2,350000},{7,10000}],
    skill = 3040,
    paladin = [{26,429,0}],
    wizard = [{26,429,0}],
    assassin = [{26,429,0}],
    soulReaper = [{26,429,0}],
    mechanic = [{26,429,0}],
    newplayer_1 = [{26,429,0}],
    newplayer_2 = [{26,429,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,27)->
    #shenqiCfg {
    id = 5,
    level = 27,
    upgrade = [{2,400000},{7,12000}],
    skill = 3040,
    paladin = [{26,463,0}],
    wizard = [{26,463,0}],
    assassin = [{26,463,0}],
    soulReaper = [{26,463,0}],
    mechanic = [{26,463,0}],
    newplayer_1 = [{26,463,0}],
    newplayer_2 = [{26,463,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,28)->
    #shenqiCfg {
    id = 5,
    level = 28,
    upgrade = [{2,450000},{7,14000}],
    skill = 3040,
    paladin = [{26,500,0}],
    wizard = [{26,500,0}],
    assassin = [{26,500,0}],
    soulReaper = [{26,500,0}],
    mechanic = [{26,500,0}],
    newplayer_1 = [{26,500,0}],
    newplayer_2 = [{26,500,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,29)->
    #shenqiCfg {
    id = 5,
    level = 29,
    upgrade = [{2,500000},{7,16000}],
    skill = 3040,
    paladin = [{26,540,0}],
    wizard = [{26,540,0}],
    assassin = [{26,540,0}],
    soulReaper = [{26,540,0}],
    mechanic = [{26,540,0}],
    newplayer_1 = [{26,540,0}],
    newplayer_2 = [{26,540,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,30)->
    #shenqiCfg {
    id = 5,
    level = 30,
    upgrade = [{2,600000},{7,18000}],
    skill = 3040,
    paladin = [{26,583,0}],
    wizard = [{26,583,0}],
    assassin = [{26,583,0}],
    soulReaper = [{26,583,0}],
    mechanic = [{26,583,0}],
    newplayer_1 = [{26,583,0}],
    newplayer_2 = [{26,583,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,31)->
    #shenqiCfg {
    id = 5,
    level = 31,
    upgrade = [{2,700000},{7,21000}],
    skill = 3040,
    paladin = [{26,629,0}],
    wizard = [{26,629,0}],
    assassin = [{26,629,0}],
    soulReaper = [{26,629,0}],
    mechanic = [{26,629,0}],
    newplayer_1 = [{26,629,0}],
    newplayer_2 = [{26,629,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,32)->
    #shenqiCfg {
    id = 5,
    level = 32,
    upgrade = [{2,800000},{7,24000}],
    skill = 3040,
    paladin = [{26,679,0}],
    wizard = [{26,679,0}],
    assassin = [{26,679,0}],
    soulReaper = [{26,679,0}],
    mechanic = [{26,679,0}],
    newplayer_1 = [{26,679,0}],
    newplayer_2 = [{26,679,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,33)->
    #shenqiCfg {
    id = 5,
    level = 33,
    upgrade = [{2,900000},{7,27000}],
    skill = 3040,
    paladin = [{26,733,0}],
    wizard = [{26,733,0}],
    assassin = [{26,733,0}],
    soulReaper = [{26,733,0}],
    mechanic = [{26,733,0}],
    newplayer_1 = [{26,733,0}],
    newplayer_2 = [{26,733,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,34)->
    #shenqiCfg {
    id = 5,
    level = 34,
    upgrade = [{2,1000000},{7,31000}],
    skill = 3040,
    paladin = [{26,791,0}],
    wizard = [{26,791,0}],
    assassin = [{26,791,0}],
    soulReaper = [{26,791,0}],
    mechanic = [{26,791,0}],
    newplayer_1 = [{26,791,0}],
    newplayer_2 = [{26,791,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,35)->
    #shenqiCfg {
    id = 5,
    level = 35,
    upgrade = [{2,1100000},{7,35000}],
    skill = 3040,
    paladin = [{26,854,0}],
    wizard = [{26,854,0}],
    assassin = [{26,854,0}],
    soulReaper = [{26,854,0}],
    mechanic = [{26,854,0}],
    newplayer_1 = [{26,854,0}],
    newplayer_2 = [{26,854,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,36)->
    #shenqiCfg {
    id = 5,
    level = 36,
    upgrade = [{2,1200000},{7,40000}],
    skill = 3040,
    paladin = [{26,922,0}],
    wizard = [{26,922,0}],
    assassin = [{26,922,0}],
    soulReaper = [{26,922,0}],
    mechanic = [{26,922,0}],
    newplayer_1 = [{26,922,0}],
    newplayer_2 = [{26,922,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,37)->
    #shenqiCfg {
    id = 5,
    level = 37,
    upgrade = [{2,1300000},{7,46000}],
    skill = 3040,
    paladin = [{26,995,0}],
    wizard = [{26,995,0}],
    assassin = [{26,995,0}],
    soulReaper = [{26,995,0}],
    mechanic = [{26,995,0}],
    newplayer_1 = [{26,995,0}],
    newplayer_2 = [{26,995,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,38)->
    #shenqiCfg {
    id = 5,
    level = 38,
    upgrade = [{2,1400000},{7,52000}],
    skill = 3040,
    paladin = [{26,1074,0}],
    wizard = [{26,1074,0}],
    assassin = [{26,1074,0}],
    soulReaper = [{26,1074,0}],
    mechanic = [{26,1074,0}],
    newplayer_1 = [{26,1074,0}],
    newplayer_2 = [{26,1074,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,39)->
    #shenqiCfg {
    id = 5,
    level = 39,
    upgrade = [{2,1500000},{7,59000}],
    skill = 3040,
    paladin = [{26,1159,0}],
    wizard = [{26,1159,0}],
    assassin = [{26,1159,0}],
    soulReaper = [{26,1159,0}],
    mechanic = [{26,1159,0}],
    newplayer_1 = [{26,1159,0}],
    newplayer_2 = [{26,1159,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,40)->
    #shenqiCfg {
    id = 5,
    level = 40,
    upgrade = [{2,1600000},{7,67000}],
    skill = 3040,
    paladin = [{26,1251,0}],
    wizard = [{26,1251,0}],
    assassin = [{26,1251,0}],
    soulReaper = [{26,1251,0}],
    mechanic = [{26,1251,0}],
    newplayer_1 = [{26,1251,0}],
    newplayer_2 = [{26,1251,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,41)->
    #shenqiCfg {
    id = 5,
    level = 41,
    upgrade = [{2,1700000},{7,75000}],
    skill = 3040,
    paladin = [{26,1350,0}],
    wizard = [{26,1350,0}],
    assassin = [{26,1350,0}],
    soulReaper = [{26,1350,0}],
    mechanic = [{26,1350,0}],
    newplayer_1 = [{26,1350,0}],
    newplayer_2 = [{26,1350,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,42)->
    #shenqiCfg {
    id = 5,
    level = 42,
    upgrade = [{2,1800000},{7,85000}],
    skill = 3040,
    paladin = [{26,1457,0}],
    wizard = [{26,1457,0}],
    assassin = [{26,1457,0}],
    soulReaper = [{26,1457,0}],
    mechanic = [{26,1457,0}],
    newplayer_1 = [{26,1457,0}],
    newplayer_2 = [{26,1457,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,43)->
    #shenqiCfg {
    id = 5,
    level = 43,
    upgrade = [{2,1900000},{7,96000}],
    skill = 3040,
    paladin = [{26,1573,0}],
    wizard = [{26,1573,0}],
    assassin = [{26,1573,0}],
    soulReaper = [{26,1573,0}],
    mechanic = [{26,1573,0}],
    newplayer_1 = [{26,1573,0}],
    newplayer_2 = [{26,1573,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,44)->
    #shenqiCfg {
    id = 5,
    level = 44,
    upgrade = [{2,2000000},{7,108000}],
    skill = 3040,
    paladin = [{26,1698,0}],
    wizard = [{26,1698,0}],
    assassin = [{26,1698,0}],
    soulReaper = [{26,1698,0}],
    mechanic = [{26,1698,0}],
    newplayer_1 = [{26,1698,0}],
    newplayer_2 = [{26,1698,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,45)->
    #shenqiCfg {
    id = 5,
    level = 45,
    upgrade = [{2,2100000},{7,123000}],
    skill = 3040,
    paladin = [{26,1832,0}],
    wizard = [{26,1832,0}],
    assassin = [{26,1832,0}],
    soulReaper = [{26,1832,0}],
    mechanic = [{26,1832,0}],
    newplayer_1 = [{26,1832,0}],
    newplayer_2 = [{26,1832,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,46)->
    #shenqiCfg {
    id = 5,
    level = 46,
    upgrade = [{2,2200000},{7,139000}],
    skill = 3040,
    paladin = [{26,1978,0}],
    wizard = [{26,1978,0}],
    assassin = [{26,1978,0}],
    soulReaper = [{26,1978,0}],
    mechanic = [{26,1978,0}],
    newplayer_1 = [{26,1978,0}],
    newplayer_2 = [{26,1978,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,47)->
    #shenqiCfg {
    id = 5,
    level = 47,
    upgrade = [{2,2300000},{7,158000}],
    skill = 3040,
    paladin = [{26,2135,0}],
    wizard = [{26,2135,0}],
    assassin = [{26,2135,0}],
    soulReaper = [{26,2135,0}],
    mechanic = [{26,2135,0}],
    newplayer_1 = [{26,2135,0}],
    newplayer_2 = [{26,2135,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,48)->
    #shenqiCfg {
    id = 5,
    level = 48,
    upgrade = [{2,2400000},{7,179000}],
    skill = 3040,
    paladin = [{26,2304,0}],
    wizard = [{26,2304,0}],
    assassin = [{26,2304,0}],
    soulReaper = [{26,2304,0}],
    mechanic = [{26,2304,0}],
    newplayer_1 = [{26,2304,0}],
    newplayer_2 = [{26,2304,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,49)->
    #shenqiCfg {
    id = 5,
    level = 49,
    upgrade = [{2,2500000},{7,201000}],
    skill = 3040,
    paladin = [{26,2487,0}],
    wizard = [{26,2487,0}],
    assassin = [{26,2487,0}],
    soulReaper = [{26,2487,0}],
    mechanic = [{26,2487,0}],
    newplayer_1 = [{26,2487,0}],
    newplayer_2 = [{26,2487,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,50)->
    #shenqiCfg {
    id = 5,
    level = 50,
    upgrade = [{2,3000000},{7,226000}],
    skill = 3040,
    paladin = [{26,2684,0}],
    wizard = [{26,2684,0}],
    assassin = [{26,2684,0}],
    soulReaper = [{26,2684,0}],
    mechanic = [{26,2684,0}],
    newplayer_1 = [{26,2684,0}],
    newplayer_2 = [{26,2684,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,51)->
    #shenqiCfg {
    id = 5,
    level = 51,
    upgrade = [{2,3500000},{7,252000}],
    skill = 3040,
    paladin = [{26,2897,0}],
    wizard = [{26,2897,0}],
    assassin = [{26,2897,0}],
    soulReaper = [{26,2897,0}],
    mechanic = [{26,2897,0}],
    newplayer_1 = [{26,2897,0}],
    newplayer_2 = [{26,2897,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,52)->
    #shenqiCfg {
    id = 5,
    level = 52,
    upgrade = [{2,4000000},{7,283000}],
    skill = 3040,
    paladin = [{26,3127,0}],
    wizard = [{26,3127,0}],
    assassin = [{26,3127,0}],
    soulReaper = [{26,3127,0}],
    mechanic = [{26,3127,0}],
    newplayer_1 = [{26,3127,0}],
    newplayer_2 = [{26,3127,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,53)->
    #shenqiCfg {
    id = 5,
    level = 53,
    upgrade = [{2,4500000},{7,318000}],
    skill = 3040,
    paladin = [{26,3375,0}],
    wizard = [{26,3375,0}],
    assassin = [{26,3375,0}],
    soulReaper = [{26,3375,0}],
    mechanic = [{26,3375,0}],
    newplayer_1 = [{26,3375,0}],
    newplayer_2 = [{26,3375,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,54)->
    #shenqiCfg {
    id = 5,
    level = 54,
    upgrade = [{2,5000000},{7,356000}],
    skill = 3040,
    paladin = [{26,3643,0}],
    wizard = [{26,3643,0}],
    assassin = [{26,3643,0}],
    soulReaper = [{26,3643,0}],
    mechanic = [{26,3643,0}],
    newplayer_1 = [{26,3643,0}],
    newplayer_2 = [{26,3643,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,55)->
    #shenqiCfg {
    id = 5,
    level = 55,
    upgrade = [{2,6000000},{7,399000}],
    skill = 3040,
    paladin = [{26,3932,0}],
    wizard = [{26,3932,0}],
    assassin = [{26,3932,0}],
    soulReaper = [{26,3932,0}],
    mechanic = [{26,3932,0}],
    newplayer_1 = [{26,3932,0}],
    newplayer_2 = [{26,3932,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,56)->
    #shenqiCfg {
    id = 5,
    level = 56,
    upgrade = [{2,7500000},{7,446000}],
    skill = 3040,
    paladin = [{26,4244,0}],
    wizard = [{26,4244,0}],
    assassin = [{26,4244,0}],
    soulReaper = [{26,4244,0}],
    mechanic = [{26,4244,0}],
    newplayer_1 = [{26,4244,0}],
    newplayer_2 = [{26,4244,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,57)->
    #shenqiCfg {
    id = 5,
    level = 57,
    upgrade = [{2,10000000},{7,499000}],
    skill = 3040,
    paladin = [{26,4581,0}],
    wizard = [{26,4581,0}],
    assassin = [{26,4581,0}],
    soulReaper = [{26,4581,0}],
    mechanic = [{26,4581,0}],
    newplayer_1 = [{26,4581,0}],
    newplayer_2 = [{26,4581,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,58)->
    #shenqiCfg {
    id = 5,
    level = 58,
    upgrade = [{2,15000000},{7,557000}],
    skill = 3040,
    paladin = [{26,4944,0}],
    wizard = [{26,4944,0}],
    assassin = [{26,4944,0}],
    soulReaper = [{26,4944,0}],
    mechanic = [{26,4944,0}],
    newplayer_1 = [{26,4944,0}],
    newplayer_2 = [{26,4944,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,59)->
    #shenqiCfg {
    id = 5,
    level = 59,
    upgrade = [{2,20000000},{7,619000}],
    skill = 3040,
    paladin = [{26,5337,0}],
    wizard = [{26,5337,0}],
    assassin = [{26,5337,0}],
    soulReaper = [{26,5337,0}],
    mechanic = [{26,5337,0}],
    newplayer_1 = [{26,5337,0}],
    newplayer_2 = [{26,5337,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,60)->
    #shenqiCfg {
    id = 5,
    level = 60,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,5760,0}],
    wizard = [{26,5760,0}],
    assassin = [{26,5760,0}],
    soulReaper = [{26,5760,0}],
    mechanic = [{26,5760,0}],
    newplayer_1 = [{26,5760,0}],
    newplayer_2 = [{26,5760,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,61)->
    #shenqiCfg {
    id = 5,
    level = 61,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,6160,0}],
    wizard = [{26,6160,0}],
    assassin = [{26,6160,0}],
    soulReaper = [{26,6160,0}],
    mechanic = [{26,6160,0}],
    newplayer_1 = [{26,6160,0}],
    newplayer_2 = [{26,6160,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,62)->
    #shenqiCfg {
    id = 5,
    level = 62,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,6560,0}],
    wizard = [{26,6560,0}],
    assassin = [{26,6560,0}],
    soulReaper = [{26,6560,0}],
    mechanic = [{26,6560,0}],
    newplayer_1 = [{26,6560,0}],
    newplayer_2 = [{26,6560,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,63)->
    #shenqiCfg {
    id = 5,
    level = 63,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,6960,0}],
    wizard = [{26,6960,0}],
    assassin = [{26,6960,0}],
    soulReaper = [{26,6960,0}],
    mechanic = [{26,6960,0}],
    newplayer_1 = [{26,6960,0}],
    newplayer_2 = [{26,6960,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,64)->
    #shenqiCfg {
    id = 5,
    level = 64,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,7360,0}],
    wizard = [{26,7360,0}],
    assassin = [{26,7360,0}],
    soulReaper = [{26,7360,0}],
    mechanic = [{26,7360,0}],
    newplayer_1 = [{26,7360,0}],
    newplayer_2 = [{26,7360,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,65)->
    #shenqiCfg {
    id = 5,
    level = 65,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,7760,0}],
    wizard = [{26,7760,0}],
    assassin = [{26,7760,0}],
    soulReaper = [{26,7760,0}],
    mechanic = [{26,7760,0}],
    newplayer_1 = [{26,7760,0}],
    newplayer_2 = [{26,7760,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,66)->
    #shenqiCfg {
    id = 5,
    level = 66,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,8160,0}],
    wizard = [{26,8160,0}],
    assassin = [{26,8160,0}],
    soulReaper = [{26,8160,0}],
    mechanic = [{26,8160,0}],
    newplayer_1 = [{26,8160,0}],
    newplayer_2 = [{26,8160,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,67)->
    #shenqiCfg {
    id = 5,
    level = 67,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,8560,0}],
    wizard = [{26,8560,0}],
    assassin = [{26,8560,0}],
    soulReaper = [{26,8560,0}],
    mechanic = [{26,8560,0}],
    newplayer_1 = [{26,8560,0}],
    newplayer_2 = [{26,8560,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,68)->
    #shenqiCfg {
    id = 5,
    level = 68,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,8960,0}],
    wizard = [{26,8960,0}],
    assassin = [{26,8960,0}],
    soulReaper = [{26,8960,0}],
    mechanic = [{26,8960,0}],
    newplayer_1 = [{26,8960,0}],
    newplayer_2 = [{26,8960,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,69)->
    #shenqiCfg {
    id = 5,
    level = 69,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,9360,0}],
    wizard = [{26,9360,0}],
    assassin = [{26,9360,0}],
    soulReaper = [{26,9360,0}],
    mechanic = [{26,9360,0}],
    newplayer_1 = [{26,9360,0}],
    newplayer_2 = [{26,9360,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,70)->
    #shenqiCfg {
    id = 5,
    level = 70,
    upgrade = [{2,25000000},{7,687000}],
    skill = 3040,
    paladin = [{26,9760,0}],
    wizard = [{26,9760,0}],
    assassin = [{26,9760,0}],
    soulReaper = [{26,9760,0}],
    mechanic = [{26,9760,0}],
    newplayer_1 = [{26,9760,0}],
    newplayer_2 = [{26,9760,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,71)->
    #shenqiCfg {
    id = 5,
    level = 71,
    upgrade = [{2,30000000},{7,800000}],
    skill = 3040,
    paladin = [{26,9810,0}],
    wizard = [{26,9810,0}],
    assassin = [{26,9810,0}],
    soulReaper = [{26,9810,0}],
    mechanic = [{26,9810,0}],
    newplayer_1 = [{26,9810,0}],
    newplayer_2 = [{26,9810,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,72)->
    #shenqiCfg {
    id = 5,
    level = 72,
    upgrade = [{2,30000000},{7,800000}],
    skill = 3040,
    paladin = [{26,9860,0}],
    wizard = [{26,9860,0}],
    assassin = [{26,9860,0}],
    soulReaper = [{26,9860,0}],
    mechanic = [{26,9860,0}],
    newplayer_1 = [{26,9860,0}],
    newplayer_2 = [{26,9860,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,73)->
    #shenqiCfg {
    id = 5,
    level = 73,
    upgrade = [{2,30000000},{7,800000}],
    skill = 3040,
    paladin = [{26,9910,0}],
    wizard = [{26,9910,0}],
    assassin = [{26,9910,0}],
    soulReaper = [{26,9910,0}],
    mechanic = [{26,9910,0}],
    newplayer_1 = [{26,9910,0}],
    newplayer_2 = [{26,9910,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,74)->
    #shenqiCfg {
    id = 5,
    level = 74,
    upgrade = [{2,30000000},{7,800000}],
    skill = 3040,
    paladin = [{26,9960,0}],
    wizard = [{26,9960,0}],
    assassin = [{26,9960,0}],
    soulReaper = [{26,9960,0}],
    mechanic = [{26,9960,0}],
    newplayer_1 = [{26,9960,0}],
    newplayer_2 = [{26,9960,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(5,75)->
    #shenqiCfg {
    id = 5,
    level = 75,
    upgrade = [{2,30000000},{7,800000}],
    skill = 3040,
    paladin = [{26,10010,0}],
    wizard = [{26,10010,0}],
    assassin = [{26,10010,0}],
    soulReaper = [{26,10010,0}],
    mechanic = [{26,10010,0}],
    newplayer_1 = [{26,10010,0}],
    newplayer_2 = [{26,10010,0}],
    resources = 5,
    name = "诅咒力量",
    txt = "古代君王被奸臣所害化作万年怨灵依附于生前所佩戴神兵之上,积累了万年之怨恨等待着谁人开启。"
    };
getRow(6,0)->
    #shenqiCfg {
    id = 6,
    level = 0,
    skill = 0,
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,1)->
    #shenqiCfg {
    id = 6,
    level = 1,
    upitem = [{2505,1}],
    skill = 3041,
    paladin = [{28,59,0}],
    wizard = [{28,59,0}],
    assassin = [{28,59,0}],
    soulReaper = [{28,59,0}],
    mechanic = [{28,59,0}],
    newplayer_1 = [{28,59,0}],
    newplayer_2 = [{28,59,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,2)->
    #shenqiCfg {
    id = 6,
    level = 2,
    upgrade = [{2,500},{8,10}],
    skill = 3041,
    paladin = [{28,69,0}],
    wizard = [{28,69,0}],
    assassin = [{28,69,0}],
    soulReaper = [{28,69,0}],
    mechanic = [{28,69,0}],
    newplayer_1 = [{28,69,0}],
    newplayer_2 = [{28,69,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,3)->
    #shenqiCfg {
    id = 6,
    level = 3,
    upgrade = [{2,1000},{8,20}],
    skill = 3041,
    paladin = [{28,74,0}],
    wizard = [{28,74,0}],
    assassin = [{28,74,0}],
    soulReaper = [{28,74,0}],
    mechanic = [{28,74,0}],
    newplayer_1 = [{28,74,0}],
    newplayer_2 = [{28,74,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,4)->
    #shenqiCfg {
    id = 6,
    level = 4,
    upgrade = [{2,1500},{8,30}],
    skill = 3041,
    paladin = [{28,80,0}],
    wizard = [{28,80,0}],
    assassin = [{28,80,0}],
    soulReaper = [{28,80,0}],
    mechanic = [{28,80,0}],
    newplayer_1 = [{28,80,0}],
    newplayer_2 = [{28,80,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,5)->
    #shenqiCfg {
    id = 6,
    level = 5,
    upgrade = [{2,2000},{8,40}],
    skill = 3041,
    paladin = [{28,86,0}],
    wizard = [{28,86,0}],
    assassin = [{28,86,0}],
    soulReaper = [{28,86,0}],
    mechanic = [{28,86,0}],
    newplayer_1 = [{28,86,0}],
    newplayer_2 = [{28,86,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,6)->
    #shenqiCfg {
    id = 6,
    level = 6,
    upgrade = [{2,2500},{8,50}],
    skill = 3041,
    paladin = [{28,93,0}],
    wizard = [{28,93,0}],
    assassin = [{28,93,0}],
    soulReaper = [{28,93,0}],
    mechanic = [{28,93,0}],
    newplayer_1 = [{28,93,0}],
    newplayer_2 = [{28,93,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,7)->
    #shenqiCfg {
    id = 6,
    level = 7,
    upgrade = [{2,3000},{8,60}],
    skill = 3041,
    paladin = [{28,101,0}],
    wizard = [{28,101,0}],
    assassin = [{28,101,0}],
    soulReaper = [{28,101,0}],
    mechanic = [{28,101,0}],
    newplayer_1 = [{28,101,0}],
    newplayer_2 = [{28,101,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,8)->
    #shenqiCfg {
    id = 6,
    level = 8,
    upgrade = [{2,3500},{8,70}],
    skill = 3041,
    paladin = [{28,109,0}],
    wizard = [{28,109,0}],
    assassin = [{28,109,0}],
    soulReaper = [{28,109,0}],
    mechanic = [{28,109,0}],
    newplayer_1 = [{28,109,0}],
    newplayer_2 = [{28,109,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,9)->
    #shenqiCfg {
    id = 6,
    level = 9,
    upgrade = [{2,4000},{8,80}],
    skill = 3041,
    paladin = [{28,117,0}],
    wizard = [{28,117,0}],
    assassin = [{28,117,0}],
    soulReaper = [{28,117,0}],
    mechanic = [{28,117,0}],
    newplayer_1 = [{28,117,0}],
    newplayer_2 = [{28,117,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,10)->
    #shenqiCfg {
    id = 6,
    level = 10,
    upgrade = [{2,4500},{8,90}],
    skill = 3041,
    paladin = [{28,127,0}],
    wizard = [{28,127,0}],
    assassin = [{28,127,0}],
    soulReaper = [{28,127,0}],
    mechanic = [{28,127,0}],
    newplayer_1 = [{28,127,0}],
    newplayer_2 = [{28,127,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,11)->
    #shenqiCfg {
    id = 6,
    level = 11,
    upgrade = [{2,5000},{8,100}],
    skill = 3041,
    paladin = [{28,137,0}],
    wizard = [{28,137,0}],
    assassin = [{28,137,0}],
    soulReaper = [{28,137,0}],
    mechanic = [{28,137,0}],
    newplayer_1 = [{28,137,0}],
    newplayer_2 = [{28,137,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,12)->
    #shenqiCfg {
    id = 6,
    level = 12,
    upgrade = [{2,10000},{8,110}],
    skill = 3041,
    paladin = [{28,147,0}],
    wizard = [{28,147,0}],
    assassin = [{28,147,0}],
    soulReaper = [{28,147,0}],
    mechanic = [{28,147,0}],
    newplayer_1 = [{28,147,0}],
    newplayer_2 = [{28,147,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,13)->
    #shenqiCfg {
    id = 6,
    level = 13,
    upgrade = [{2,15000},{8,120}],
    skill = 3041,
    paladin = [{28,159,0}],
    wizard = [{28,159,0}],
    assassin = [{28,159,0}],
    soulReaper = [{28,159,0}],
    mechanic = [{28,159,0}],
    newplayer_1 = [{28,159,0}],
    newplayer_2 = [{28,159,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,14)->
    #shenqiCfg {
    id = 6,
    level = 14,
    upgrade = [{2,20000},{8,130}],
    skill = 3041,
    paladin = [{28,172,0}],
    wizard = [{28,172,0}],
    assassin = [{28,172,0}],
    soulReaper = [{28,172,0}],
    mechanic = [{28,172,0}],
    newplayer_1 = [{28,172,0}],
    newplayer_2 = [{28,172,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,15)->
    #shenqiCfg {
    id = 6,
    level = 15,
    upgrade = [{2,25000},{8,140}],
    skill = 3041,
    paladin = [{28,185,0}],
    wizard = [{28,185,0}],
    assassin = [{28,185,0}],
    soulReaper = [{28,185,0}],
    mechanic = [{28,185,0}],
    newplayer_1 = [{28,185,0}],
    newplayer_2 = [{28,185,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,16)->
    #shenqiCfg {
    id = 6,
    level = 16,
    upgrade = [{2,30000},{8,150}],
    skill = 3041,
    paladin = [{28,200,0}],
    wizard = [{28,200,0}],
    assassin = [{28,200,0}],
    soulReaper = [{28,200,0}],
    mechanic = [{28,200,0}],
    newplayer_1 = [{28,200,0}],
    newplayer_2 = [{28,200,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,17)->
    #shenqiCfg {
    id = 6,
    level = 17,
    upgrade = [{2,35000},{8,160}],
    skill = 3041,
    paladin = [{28,216,0}],
    wizard = [{28,216,0}],
    assassin = [{28,216,0}],
    soulReaper = [{28,216,0}],
    mechanic = [{28,216,0}],
    newplayer_1 = [{28,216,0}],
    newplayer_2 = [{28,216,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,18)->
    #shenqiCfg {
    id = 6,
    level = 18,
    upgrade = [{2,40000},{8,170}],
    skill = 3041,
    paladin = [{28,233,0}],
    wizard = [{28,233,0}],
    assassin = [{28,233,0}],
    soulReaper = [{28,233,0}],
    mechanic = [{28,233,0}],
    newplayer_1 = [{28,233,0}],
    newplayer_2 = [{28,233,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,19)->
    #shenqiCfg {
    id = 6,
    level = 19,
    upgrade = [{2,45000},{8,180}],
    skill = 3041,
    paladin = [{28,252,0}],
    wizard = [{28,252,0}],
    assassin = [{28,252,0}],
    soulReaper = [{28,252,0}],
    mechanic = [{28,252,0}],
    newplayer_1 = [{28,252,0}],
    newplayer_2 = [{28,252,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,20)->
    #shenqiCfg {
    id = 6,
    level = 20,
    upgrade = [{2,50000},{8,190}],
    skill = 3041,
    paladin = [{28,272,0}],
    wizard = [{28,272,0}],
    assassin = [{28,272,0}],
    soulReaper = [{28,272,0}],
    mechanic = [{28,272,0}],
    newplayer_1 = [{28,272,0}],
    newplayer_2 = [{28,272,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,21)->
    #shenqiCfg {
    id = 6,
    level = 21,
    upgrade = [{2,100000},{8,200}],
    skill = 3041,
    paladin = [{28,293,0}],
    wizard = [{28,293,0}],
    assassin = [{28,293,0}],
    soulReaper = [{28,293,0}],
    mechanic = [{28,293,0}],
    newplayer_1 = [{28,293,0}],
    newplayer_2 = [{28,293,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,22)->
    #shenqiCfg {
    id = 6,
    level = 22,
    upgrade = [{2,150000},{8,210}],
    skill = 3041,
    paladin = [{28,316,0}],
    wizard = [{28,316,0}],
    assassin = [{28,316,0}],
    soulReaper = [{28,316,0}],
    mechanic = [{28,316,0}],
    newplayer_1 = [{28,316,0}],
    newplayer_2 = [{28,316,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,23)->
    #shenqiCfg {
    id = 6,
    level = 23,
    upgrade = [{2,200000},{8,220}],
    skill = 3041,
    paladin = [{28,341,0}],
    wizard = [{28,341,0}],
    assassin = [{28,341,0}],
    soulReaper = [{28,341,0}],
    mechanic = [{28,341,0}],
    newplayer_1 = [{28,341,0}],
    newplayer_2 = [{28,341,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,24)->
    #shenqiCfg {
    id = 6,
    level = 24,
    upgrade = [{2,250000},{8,230}],
    skill = 3041,
    paladin = [{28,369,0}],
    wizard = [{28,369,0}],
    assassin = [{28,369,0}],
    soulReaper = [{28,369,0}],
    mechanic = [{28,369,0}],
    newplayer_1 = [{28,369,0}],
    newplayer_2 = [{28,369,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,25)->
    #shenqiCfg {
    id = 6,
    level = 25,
    upgrade = [{2,300000},{8,240}],
    skill = 3041,
    paladin = [{28,398,0}],
    wizard = [{28,398,0}],
    assassin = [{28,398,0}],
    soulReaper = [{28,398,0}],
    mechanic = [{28,398,0}],
    newplayer_1 = [{28,398,0}],
    newplayer_2 = [{28,398,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,26)->
    #shenqiCfg {
    id = 6,
    level = 26,
    upgrade = [{2,350000},{8,250}],
    skill = 3041,
    paladin = [{28,429,0}],
    wizard = [{28,429,0}],
    assassin = [{28,429,0}],
    soulReaper = [{28,429,0}],
    mechanic = [{28,429,0}],
    newplayer_1 = [{28,429,0}],
    newplayer_2 = [{28,429,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,27)->
    #shenqiCfg {
    id = 6,
    level = 27,
    upgrade = [{2,400000},{8,260}],
    skill = 3041,
    paladin = [{28,463,0}],
    wizard = [{28,463,0}],
    assassin = [{28,463,0}],
    soulReaper = [{28,463,0}],
    mechanic = [{28,463,0}],
    newplayer_1 = [{28,463,0}],
    newplayer_2 = [{28,463,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,28)->
    #shenqiCfg {
    id = 6,
    level = 28,
    upgrade = [{2,450000},{8,270}],
    skill = 3041,
    paladin = [{28,500,0}],
    wizard = [{28,500,0}],
    assassin = [{28,500,0}],
    soulReaper = [{28,500,0}],
    mechanic = [{28,500,0}],
    newplayer_1 = [{28,500,0}],
    newplayer_2 = [{28,500,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,29)->
    #shenqiCfg {
    id = 6,
    level = 29,
    upgrade = [{2,500000},{8,280}],
    skill = 3041,
    paladin = [{28,540,0}],
    wizard = [{28,540,0}],
    assassin = [{28,540,0}],
    soulReaper = [{28,540,0}],
    mechanic = [{28,540,0}],
    newplayer_1 = [{28,540,0}],
    newplayer_2 = [{28,540,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,30)->
    #shenqiCfg {
    id = 6,
    level = 30,
    upgrade = [{2,600000},{8,290}],
    skill = 3041,
    paladin = [{28,583,0}],
    wizard = [{28,583,0}],
    assassin = [{28,583,0}],
    soulReaper = [{28,583,0}],
    mechanic = [{28,583,0}],
    newplayer_1 = [{28,583,0}],
    newplayer_2 = [{28,583,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,31)->
    #shenqiCfg {
    id = 6,
    level = 31,
    upgrade = [{2,700000},{8,300}],
    skill = 3041,
    paladin = [{28,629,0}],
    wizard = [{28,629,0}],
    assassin = [{28,629,0}],
    soulReaper = [{28,629,0}],
    mechanic = [{28,629,0}],
    newplayer_1 = [{28,629,0}],
    newplayer_2 = [{28,629,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,32)->
    #shenqiCfg {
    id = 6,
    level = 32,
    upgrade = [{2,800000},{8,320}],
    skill = 3041,
    paladin = [{28,679,0}],
    wizard = [{28,679,0}],
    assassin = [{28,679,0}],
    soulReaper = [{28,679,0}],
    mechanic = [{28,679,0}],
    newplayer_1 = [{28,679,0}],
    newplayer_2 = [{28,679,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,33)->
    #shenqiCfg {
    id = 6,
    level = 33,
    upgrade = [{2,900000},{8,350}],
    skill = 3041,
    paladin = [{28,733,0}],
    wizard = [{28,733,0}],
    assassin = [{28,733,0}],
    soulReaper = [{28,733,0}],
    mechanic = [{28,733,0}],
    newplayer_1 = [{28,733,0}],
    newplayer_2 = [{28,733,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,34)->
    #shenqiCfg {
    id = 6,
    level = 34,
    upgrade = [{2,1000000},{8,390}],
    skill = 3041,
    paladin = [{28,791,0}],
    wizard = [{28,791,0}],
    assassin = [{28,791,0}],
    soulReaper = [{28,791,0}],
    mechanic = [{28,791,0}],
    newplayer_1 = [{28,791,0}],
    newplayer_2 = [{28,791,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,35)->
    #shenqiCfg {
    id = 6,
    level = 35,
    upgrade = [{2,1100000},{8,440}],
    skill = 3041,
    paladin = [{28,854,0}],
    wizard = [{28,854,0}],
    assassin = [{28,854,0}],
    soulReaper = [{28,854,0}],
    mechanic = [{28,854,0}],
    newplayer_1 = [{28,854,0}],
    newplayer_2 = [{28,854,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,36)->
    #shenqiCfg {
    id = 6,
    level = 36,
    upgrade = [{2,1200000},{8,500}],
    skill = 3041,
    paladin = [{28,922,0}],
    wizard = [{28,922,0}],
    assassin = [{28,922,0}],
    soulReaper = [{28,922,0}],
    mechanic = [{28,922,0}],
    newplayer_1 = [{28,922,0}],
    newplayer_2 = [{28,922,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,37)->
    #shenqiCfg {
    id = 6,
    level = 37,
    upgrade = [{2,1300000},{8,570}],
    skill = 3041,
    paladin = [{28,995,0}],
    wizard = [{28,995,0}],
    assassin = [{28,995,0}],
    soulReaper = [{28,995,0}],
    mechanic = [{28,995,0}],
    newplayer_1 = [{28,995,0}],
    newplayer_2 = [{28,995,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,38)->
    #shenqiCfg {
    id = 6,
    level = 38,
    upgrade = [{2,1400000},{8,650}],
    skill = 3041,
    paladin = [{28,1074,0}],
    wizard = [{28,1074,0}],
    assassin = [{28,1074,0}],
    soulReaper = [{28,1074,0}],
    mechanic = [{28,1074,0}],
    newplayer_1 = [{28,1074,0}],
    newplayer_2 = [{28,1074,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,39)->
    #shenqiCfg {
    id = 6,
    level = 39,
    upgrade = [{2,1500000},{8,740}],
    skill = 3041,
    paladin = [{28,1159,0}],
    wizard = [{28,1159,0}],
    assassin = [{28,1159,0}],
    soulReaper = [{28,1159,0}],
    mechanic = [{28,1159,0}],
    newplayer_1 = [{28,1159,0}],
    newplayer_2 = [{28,1159,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,40)->
    #shenqiCfg {
    id = 6,
    level = 40,
    upgrade = [{2,1600000},{8,840}],
    skill = 3041,
    paladin = [{28,1251,0}],
    wizard = [{28,1251,0}],
    assassin = [{28,1251,0}],
    soulReaper = [{28,1251,0}],
    mechanic = [{28,1251,0}],
    newplayer_1 = [{28,1251,0}],
    newplayer_2 = [{28,1251,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,41)->
    #shenqiCfg {
    id = 6,
    level = 41,
    upgrade = [{2,1700000},{8,950}],
    skill = 3041,
    paladin = [{28,1350,0}],
    wizard = [{28,1350,0}],
    assassin = [{28,1350,0}],
    soulReaper = [{28,1350,0}],
    mechanic = [{28,1350,0}],
    newplayer_1 = [{28,1350,0}],
    newplayer_2 = [{28,1350,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,42)->
    #shenqiCfg {
    id = 6,
    level = 42,
    upgrade = [{2,1800000},{8,1070}],
    skill = 3041,
    paladin = [{28,1457,0}],
    wizard = [{28,1457,0}],
    assassin = [{28,1457,0}],
    soulReaper = [{28,1457,0}],
    mechanic = [{28,1457,0}],
    newplayer_1 = [{28,1457,0}],
    newplayer_2 = [{28,1457,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,43)->
    #shenqiCfg {
    id = 6,
    level = 43,
    upgrade = [{2,1900000},{8,1200}],
    skill = 3041,
    paladin = [{28,1573,0}],
    wizard = [{28,1573,0}],
    assassin = [{28,1573,0}],
    soulReaper = [{28,1573,0}],
    mechanic = [{28,1573,0}],
    newplayer_1 = [{28,1573,0}],
    newplayer_2 = [{28,1573,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,44)->
    #shenqiCfg {
    id = 6,
    level = 44,
    upgrade = [{2,2000000},{8,1340}],
    skill = 3041,
    paladin = [{28,1698,0}],
    wizard = [{28,1698,0}],
    assassin = [{28,1698,0}],
    soulReaper = [{28,1698,0}],
    mechanic = [{28,1698,0}],
    newplayer_1 = [{28,1698,0}],
    newplayer_2 = [{28,1698,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,45)->
    #shenqiCfg {
    id = 6,
    level = 45,
    upgrade = [{2,2100000},{8,1490}],
    skill = 3041,
    paladin = [{28,1832,0}],
    wizard = [{28,1832,0}],
    assassin = [{28,1832,0}],
    soulReaper = [{28,1832,0}],
    mechanic = [{28,1832,0}],
    newplayer_1 = [{28,1832,0}],
    newplayer_2 = [{28,1832,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,46)->
    #shenqiCfg {
    id = 6,
    level = 46,
    upgrade = [{2,2200000},{8,1650}],
    skill = 3041,
    paladin = [{28,1978,0}],
    wizard = [{28,1978,0}],
    assassin = [{28,1978,0}],
    soulReaper = [{28,1978,0}],
    mechanic = [{28,1978,0}],
    newplayer_1 = [{28,1978,0}],
    newplayer_2 = [{28,1978,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,47)->
    #shenqiCfg {
    id = 6,
    level = 47,
    upgrade = [{2,2300000},{8,1820}],
    skill = 3041,
    paladin = [{28,2135,0}],
    wizard = [{28,2135,0}],
    assassin = [{28,2135,0}],
    soulReaper = [{28,2135,0}],
    mechanic = [{28,2135,0}],
    newplayer_1 = [{28,2135,0}],
    newplayer_2 = [{28,2135,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,48)->
    #shenqiCfg {
    id = 6,
    level = 48,
    upgrade = [{2,2400000},{8,2000}],
    skill = 3041,
    paladin = [{28,2304,0}],
    wizard = [{28,2304,0}],
    assassin = [{28,2304,0}],
    soulReaper = [{28,2304,0}],
    mechanic = [{28,2304,0}],
    newplayer_1 = [{28,2304,0}],
    newplayer_2 = [{28,2304,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,49)->
    #shenqiCfg {
    id = 6,
    level = 49,
    upgrade = [{2,2500000},{8,2190}],
    skill = 3041,
    paladin = [{28,2487,0}],
    wizard = [{28,2487,0}],
    assassin = [{28,2487,0}],
    soulReaper = [{28,2487,0}],
    mechanic = [{28,2487,0}],
    newplayer_1 = [{28,2487,0}],
    newplayer_2 = [{28,2487,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,50)->
    #shenqiCfg {
    id = 6,
    level = 50,
    upgrade = [{2,3000000},{8,2390}],
    skill = 3041,
    paladin = [{28,2684,0}],
    wizard = [{28,2684,0}],
    assassin = [{28,2684,0}],
    soulReaper = [{28,2684,0}],
    mechanic = [{28,2684,0}],
    newplayer_1 = [{28,2684,0}],
    newplayer_2 = [{28,2684,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,51)->
    #shenqiCfg {
    id = 6,
    level = 51,
    upgrade = [{2,3500000},{8,2690}],
    skill = 3041,
    paladin = [{28,2897,0}],
    wizard = [{28,2897,0}],
    assassin = [{28,2897,0}],
    soulReaper = [{28,2897,0}],
    mechanic = [{28,2897,0}],
    newplayer_1 = [{28,2897,0}],
    newplayer_2 = [{28,2897,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,52)->
    #shenqiCfg {
    id = 6,
    level = 52,
    upgrade = [{2,4000000},{8,3090}],
    skill = 3041,
    paladin = [{28,3127,0}],
    wizard = [{28,3127,0}],
    assassin = [{28,3127,0}],
    soulReaper = [{28,3127,0}],
    mechanic = [{28,3127,0}],
    newplayer_1 = [{28,3127,0}],
    newplayer_2 = [{28,3127,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,53)->
    #shenqiCfg {
    id = 6,
    level = 53,
    upgrade = [{2,4500000},{8,3590}],
    skill = 3041,
    paladin = [{28,3375,0}],
    wizard = [{28,3375,0}],
    assassin = [{28,3375,0}],
    soulReaper = [{28,3375,0}],
    mechanic = [{28,3375,0}],
    newplayer_1 = [{28,3375,0}],
    newplayer_2 = [{28,3375,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,54)->
    #shenqiCfg {
    id = 6,
    level = 54,
    upgrade = [{2,5000000},{8,4190}],
    skill = 3041,
    paladin = [{28,3643,0}],
    wizard = [{28,3643,0}],
    assassin = [{28,3643,0}],
    soulReaper = [{28,3643,0}],
    mechanic = [{28,3643,0}],
    newplayer_1 = [{28,3643,0}],
    newplayer_2 = [{28,3643,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,55)->
    #shenqiCfg {
    id = 6,
    level = 55,
    upgrade = [{2,6000000},{8,4890}],
    skill = 3041,
    paladin = [{28,3932,0}],
    wizard = [{28,3932,0}],
    assassin = [{28,3932,0}],
    soulReaper = [{28,3932,0}],
    mechanic = [{28,3932,0}],
    newplayer_1 = [{28,3932,0}],
    newplayer_2 = [{28,3932,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,56)->
    #shenqiCfg {
    id = 6,
    level = 56,
    upgrade = [{2,7500000},{8,5690}],
    skill = 3041,
    paladin = [{28,4244,0}],
    wizard = [{28,4244,0}],
    assassin = [{28,4244,0}],
    soulReaper = [{28,4244,0}],
    mechanic = [{28,4244,0}],
    newplayer_1 = [{28,4244,0}],
    newplayer_2 = [{28,4244,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,57)->
    #shenqiCfg {
    id = 6,
    level = 57,
    upgrade = [{2,10000000},{8,6590}],
    skill = 3041,
    paladin = [{28,4581,0}],
    wizard = [{28,4581,0}],
    assassin = [{28,4581,0}],
    soulReaper = [{28,4581,0}],
    mechanic = [{28,4581,0}],
    newplayer_1 = [{28,4581,0}],
    newplayer_2 = [{28,4581,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,58)->
    #shenqiCfg {
    id = 6,
    level = 58,
    upgrade = [{2,15000000},{8,7590}],
    skill = 3041,
    paladin = [{28,4944,0}],
    wizard = [{28,4944,0}],
    assassin = [{28,4944,0}],
    soulReaper = [{28,4944,0}],
    mechanic = [{28,4944,0}],
    newplayer_1 = [{28,4944,0}],
    newplayer_2 = [{28,4944,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,59)->
    #shenqiCfg {
    id = 6,
    level = 59,
    upgrade = [{2,20000000},{8,8690}],
    skill = 3041,
    paladin = [{28,5337,0}],
    wizard = [{28,5337,0}],
    assassin = [{28,5337,0}],
    soulReaper = [{28,5337,0}],
    mechanic = [{28,5337,0}],
    newplayer_1 = [{28,5337,0}],
    newplayer_2 = [{28,5337,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,60)->
    #shenqiCfg {
    id = 6,
    level = 60,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,5760,0}],
    wizard = [{28,5760,0}],
    assassin = [{28,5760,0}],
    soulReaper = [{28,5760,0}],
    mechanic = [{28,5760,0}],
    newplayer_1 = [{28,5760,0}],
    newplayer_2 = [{28,5760,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,61)->
    #shenqiCfg {
    id = 6,
    level = 61,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,6160,0}],
    wizard = [{28,6160,0}],
    assassin = [{28,6160,0}],
    soulReaper = [{28,6160,0}],
    mechanic = [{28,6160,0}],
    newplayer_1 = [{28,6160,0}],
    newplayer_2 = [{28,6160,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,62)->
    #shenqiCfg {
    id = 6,
    level = 62,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,6560,0}],
    wizard = [{28,6560,0}],
    assassin = [{28,6560,0}],
    soulReaper = [{28,6560,0}],
    mechanic = [{28,6560,0}],
    newplayer_1 = [{28,6560,0}],
    newplayer_2 = [{28,6560,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,63)->
    #shenqiCfg {
    id = 6,
    level = 63,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,6960,0}],
    wizard = [{28,6960,0}],
    assassin = [{28,6960,0}],
    soulReaper = [{28,6960,0}],
    mechanic = [{28,6960,0}],
    newplayer_1 = [{28,6960,0}],
    newplayer_2 = [{28,6960,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,64)->
    #shenqiCfg {
    id = 6,
    level = 64,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,7360,0}],
    wizard = [{28,7360,0}],
    assassin = [{28,7360,0}],
    soulReaper = [{28,7360,0}],
    mechanic = [{28,7360,0}],
    newplayer_1 = [{28,7360,0}],
    newplayer_2 = [{28,7360,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,65)->
    #shenqiCfg {
    id = 6,
    level = 65,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,7760,0}],
    wizard = [{28,7760,0}],
    assassin = [{28,7760,0}],
    soulReaper = [{28,7760,0}],
    mechanic = [{28,7760,0}],
    newplayer_1 = [{28,7760,0}],
    newplayer_2 = [{28,7760,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,66)->
    #shenqiCfg {
    id = 6,
    level = 66,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,8160,0}],
    wizard = [{28,8160,0}],
    assassin = [{28,8160,0}],
    soulReaper = [{28,8160,0}],
    mechanic = [{28,8160,0}],
    newplayer_1 = [{28,8160,0}],
    newplayer_2 = [{28,8160,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,67)->
    #shenqiCfg {
    id = 6,
    level = 67,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,8560,0}],
    wizard = [{28,8560,0}],
    assassin = [{28,8560,0}],
    soulReaper = [{28,8560,0}],
    mechanic = [{28,8560,0}],
    newplayer_1 = [{28,8560,0}],
    newplayer_2 = [{28,8560,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,68)->
    #shenqiCfg {
    id = 6,
    level = 68,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,8960,0}],
    wizard = [{28,8960,0}],
    assassin = [{28,8960,0}],
    soulReaper = [{28,8960,0}],
    mechanic = [{28,8960,0}],
    newplayer_1 = [{28,8960,0}],
    newplayer_2 = [{28,8960,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,69)->
    #shenqiCfg {
    id = 6,
    level = 69,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,9360,0}],
    wizard = [{28,9360,0}],
    assassin = [{28,9360,0}],
    soulReaper = [{28,9360,0}],
    mechanic = [{28,9360,0}],
    newplayer_1 = [{28,9360,0}],
    newplayer_2 = [{28,9360,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,70)->
    #shenqiCfg {
    id = 6,
    level = 70,
    upgrade = [{2,25000000},{8,9890}],
    skill = 3041,
    paladin = [{28,9760,0}],
    wizard = [{28,9760,0}],
    assassin = [{28,9760,0}],
    soulReaper = [{28,9760,0}],
    mechanic = [{28,9760,0}],
    newplayer_1 = [{28,9760,0}],
    newplayer_2 = [{28,9760,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,71)->
    #shenqiCfg {
    id = 6,
    level = 71,
    upgrade = [{2,30000000},{8,11000}],
    skill = 3041,
    paladin = [{28,9810,0}],
    wizard = [{28,9810,0}],
    assassin = [{28,9810,0}],
    soulReaper = [{28,9810,0}],
    mechanic = [{28,9810,0}],
    newplayer_1 = [{28,9810,0}],
    newplayer_2 = [{28,9810,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,72)->
    #shenqiCfg {
    id = 6,
    level = 72,
    upgrade = [{2,30000000},{8,11000}],
    skill = 3041,
    paladin = [{28,9860,0}],
    wizard = [{28,9860,0}],
    assassin = [{28,9860,0}],
    soulReaper = [{28,9860,0}],
    mechanic = [{28,9860,0}],
    newplayer_1 = [{28,9860,0}],
    newplayer_2 = [{28,9860,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,73)->
    #shenqiCfg {
    id = 6,
    level = 73,
    upgrade = [{2,30000000},{8,11000}],
    skill = 3041,
    paladin = [{28,9910,0}],
    wizard = [{28,9910,0}],
    assassin = [{28,9910,0}],
    soulReaper = [{28,9910,0}],
    mechanic = [{28,9910,0}],
    newplayer_1 = [{28,9910,0}],
    newplayer_2 = [{28,9910,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,74)->
    #shenqiCfg {
    id = 6,
    level = 74,
    upgrade = [{2,30000000},{8,11000}],
    skill = 3041,
    paladin = [{28,9960,0}],
    wizard = [{28,9960,0}],
    assassin = [{28,9960,0}],
    soulReaper = [{28,9960,0}],
    mechanic = [{28,9960,0}],
    newplayer_1 = [{28,9960,0}],
    newplayer_2 = [{28,9960,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(6,75)->
    #shenqiCfg {
    id = 6,
    level = 75,
    upgrade = [{2,30000000},{8,11000}],
    skill = 3041,
    paladin = [{28,10010,0}],
    wizard = [{28,10010,0}],
    assassin = [{28,10010,0}],
    soulReaper = [{28,10010,0}],
    mechanic = [{28,10010,0}],
    newplayer_1 = [{28,10010,0}],
    newplayer_2 = [{28,10010,0}],
    resources = 6,
    name = "战神巨斧",
    txt = "上古至高天战神之神器,拥有无坚不摧之力,传言得到此神器者可拥有天下。"
    };
getRow(_,_)->[].

getKeyList()->[
    {0,0},
    {1,0},
    {1,1},
    {1,2},
    {1,3},
    {1,4},
    {1,5},
    {1,6},
    {1,7},
    {1,8},
    {1,9},
    {1,10},
    {1,11},
    {1,12},
    {1,13},
    {1,14},
    {1,15},
    {1,16},
    {1,17},
    {1,18},
    {1,19},
    {1,20},
    {1,21},
    {1,22},
    {1,23},
    {1,24},
    {1,25},
    {1,26},
    {1,27},
    {1,28},
    {1,29},
    {1,30},
    {1,31},
    {1,32},
    {1,33},
    {1,34},
    {1,35},
    {1,36},
    {1,37},
    {1,38},
    {1,39},
    {1,40},
    {1,41},
    {1,42},
    {1,43},
    {1,44},
    {1,45},
    {1,46},
    {1,47},
    {1,48},
    {1,49},
    {1,50},
    {1,51},
    {1,52},
    {1,53},
    {1,54},
    {1,55},
    {1,56},
    {1,57},
    {1,58},
    {1,59},
    {1,60},
    {1,61},
    {1,62},
    {1,63},
    {1,64},
    {1,65},
    {1,66},
    {1,67},
    {1,68},
    {1,69},
    {1,70},
    {1,71},
    {1,72},
    {1,73},
    {1,74},
    {1,75},
    {2,0},
    {2,1},
    {2,2},
    {2,3},
    {2,4},
    {2,5},
    {2,6},
    {2,7},
    {2,8},
    {2,9},
    {2,10},
    {2,11},
    {2,12},
    {2,13},
    {2,14},
    {2,15},
    {2,16},
    {2,17},
    {2,18},
    {2,19},
    {2,20},
    {2,21},
    {2,22},
    {2,23},
    {2,24},
    {2,25},
    {2,26},
    {2,27},
    {2,28},
    {2,29},
    {2,30},
    {2,31},
    {2,32},
    {2,33},
    {2,34},
    {2,35},
    {2,36},
    {2,37},
    {2,38},
    {2,39},
    {2,40},
    {2,41},
    {2,42},
    {2,43},
    {2,44},
    {2,45},
    {2,46},
    {2,47},
    {2,48},
    {2,49},
    {2,50},
    {2,51},
    {2,52},
    {2,53},
    {2,54},
    {2,55},
    {2,56},
    {2,57},
    {2,58},
    {2,59},
    {2,60},
    {2,61},
    {2,62},
    {2,63},
    {2,64},
    {2,65},
    {2,66},
    {2,67},
    {2,68},
    {2,69},
    {2,70},
    {2,71},
    {2,72},
    {2,73},
    {2,74},
    {2,75},
    {3,0},
    {3,1},
    {3,2},
    {3,3},
    {3,4},
    {3,5},
    {3,6},
    {3,7},
    {3,8},
    {3,9},
    {3,10},
    {3,11},
    {3,12},
    {3,13},
    {3,14},
    {3,15},
    {3,16},
    {3,17},
    {3,18},
    {3,19},
    {3,20},
    {3,21},
    {3,22},
    {3,23},
    {3,24},
    {3,25},
    {3,26},
    {3,27},
    {3,28},
    {3,29},
    {3,30},
    {3,31},
    {3,32},
    {3,33},
    {3,34},
    {3,35},
    {3,36},
    {3,37},
    {3,38},
    {3,39},
    {3,40},
    {3,41},
    {3,42},
    {3,43},
    {3,44},
    {3,45},
    {3,46},
    {3,47},
    {3,48},
    {3,49},
    {3,50},
    {3,51},
    {3,52},
    {3,53},
    {3,54},
    {3,55},
    {3,56},
    {3,57},
    {3,58},
    {3,59},
    {3,60},
    {3,61},
    {3,62},
    {3,63},
    {3,64},
    {3,65},
    {3,66},
    {3,67},
    {3,68},
    {3,69},
    {3,70},
    {3,71},
    {3,72},
    {3,73},
    {3,74},
    {3,75},
    {4,0},
    {4,1},
    {4,2},
    {4,3},
    {4,4},
    {4,5},
    {4,6},
    {4,7},
    {4,8},
    {4,9},
    {4,10},
    {4,11},
    {4,12},
    {4,13},
    {4,14},
    {4,15},
    {4,16},
    {4,17},
    {4,18},
    {4,19},
    {4,20},
    {4,21},
    {4,22},
    {4,23},
    {4,24},
    {4,25},
    {4,26},
    {4,27},
    {4,28},
    {4,29},
    {4,30},
    {4,31},
    {4,32},
    {4,33},
    {4,34},
    {4,35},
    {4,36},
    {4,37},
    {4,38},
    {4,39},
    {4,40},
    {4,41},
    {4,42},
    {4,43},
    {4,44},
    {4,45},
    {4,46},
    {4,47},
    {4,48},
    {4,49},
    {4,50},
    {4,51},
    {4,52},
    {4,53},
    {4,54},
    {4,55},
    {4,56},
    {4,57},
    {4,58},
    {4,59},
    {4,60},
    {4,61},
    {4,62},
    {4,63},
    {4,64},
    {4,65},
    {4,66},
    {4,67},
    {4,68},
    {4,69},
    {4,70},
    {4,71},
    {4,72},
    {4,73},
    {4,74},
    {4,75},
    {5,0},
    {5,1},
    {5,2},
    {5,3},
    {5,4},
    {5,5},
    {5,6},
    {5,7},
    {5,8},
    {5,9},
    {5,10},
    {5,11},
    {5,12},
    {5,13},
    {5,14},
    {5,15},
    {5,16},
    {5,17},
    {5,18},
    {5,19},
    {5,20},
    {5,21},
    {5,22},
    {5,23},
    {5,24},
    {5,25},
    {5,26},
    {5,27},
    {5,28},
    {5,29},
    {5,30},
    {5,31},
    {5,32},
    {5,33},
    {5,34},
    {5,35},
    {5,36},
    {5,37},
    {5,38},
    {5,39},
    {5,40},
    {5,41},
    {5,42},
    {5,43},
    {5,44},
    {5,45},
    {5,46},
    {5,47},
    {5,48},
    {5,49},
    {5,50},
    {5,51},
    {5,52},
    {5,53},
    {5,54},
    {5,55},
    {5,56},
    {5,57},
    {5,58},
    {5,59},
    {5,60},
    {5,61},
    {5,62},
    {5,63},
    {5,64},
    {5,65},
    {5,66},
    {5,67},
    {5,68},
    {5,69},
    {5,70},
    {5,71},
    {5,72},
    {5,73},
    {5,74},
    {5,75},
    {6,0},
    {6,1},
    {6,2},
    {6,3},
    {6,4},
    {6,5},
    {6,6},
    {6,7},
    {6,8},
    {6,9},
    {6,10},
    {6,11},
    {6,12},
    {6,13},
    {6,14},
    {6,15},
    {6,16},
    {6,17},
    {6,18},
    {6,19},
    {6,20},
    {6,21},
    {6,22},
    {6,23},
    {6,24},
    {6,25},
    {6,26},
    {6,27},
    {6,28},
    {6,29},
    {6,30},
    {6,31},
    {6,32},
    {6,33},
    {6,34},
    {6,35},
    {6,36},
    {6,37},
    {6,38},
    {6,39},
    {6,40},
    {6,41},
    {6,42},
    {6,43},
    {6,44},
    {6,45},
    {6,46},
    {6,47},
    {6,48},
    {6,49},
    {6,50},
    {6,51},
    {6,52},
    {6,53},
    {6,54},
    {6,55},
    {6,56},
    {6,57},
    {6,58},
    {6,59},
    {6,60},
    {6,61},
    {6,62},
    {6,63},
    {6,64},
    {6,65},
    {6,66},
    {6,67},
    {6,68},
    {6,69},
    {6,70},
    {6,71},
    {6,72},
    {6,73},
    {6,74},
    {6,75}
    ].

get1KeyList()->[
    0,
    1,
    2,
    3,
    4,
    5,
    6
    ].

get2KeyList(0)->[
    0
    ];
get2KeyList(1)->[
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30,
    31,
    32,
    33,
    34,
    35,
    36,
    37,
    38,
    39,
    40,
    41,
    42,
    43,
    44,
    45,
    46,
    47,
    48,
    49,
    50,
    51,
    52,
    53,
    54,
    55,
    56,
    57,
    58,
    59,
    60,
    61,
    62,
    63,
    64,
    65,
    66,
    67,
    68,
    69,
    70,
    71,
    72,
    73,
    74,
    75
    ];
get2KeyList(2)->[
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30,
    31,
    32,
    33,
    34,
    35,
    36,
    37,
    38,
    39,
    40,
    41,
    42,
    43,
    44,
    45,
    46,
    47,
    48,
    49,
    50,
    51,
    52,
    53,
    54,
    55,
    56,
    57,
    58,
    59,
    60,
    61,
    62,
    63,
    64,
    65,
    66,
    67,
    68,
    69,
    70,
    71,
    72,
    73,
    74,
    75
    ];
get2KeyList(3)->[
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30,
    31,
    32,
    33,
    34,
    35,
    36,
    37,
    38,
    39,
    40,
    41,
    42,
    43,
    44,
    45,
    46,
    47,
    48,
    49,
    50,
    51,
    52,
    53,
    54,
    55,
    56,
    57,
    58,
    59,
    60,
    61,
    62,
    63,
    64,
    65,
    66,
    67,
    68,
    69,
    70,
    71,
    72,
    73,
    74,
    75
    ];
get2KeyList(4)->[
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30,
    31,
    32,
    33,
    34,
    35,
    36,
    37,
    38,
    39,
    40,
    41,
    42,
    43,
    44,
    45,
    46,
    47,
    48,
    49,
    50,
    51,
    52,
    53,
    54,
    55,
    56,
    57,
    58,
    59,
    60,
    61,
    62,
    63,
    64,
    65,
    66,
    67,
    68,
    69,
    70,
    71,
    72,
    73,
    74,
    75
    ];
get2KeyList(5)->[
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30,
    31,
    32,
    33,
    34,
    35,
    36,
    37,
    38,
    39,
    40,
    41,
    42,
    43,
    44,
    45,
    46,
    47,
    48,
    49,
    50,
    51,
    52,
    53,
    54,
    55,
    56,
    57,
    58,
    59,
    60,
    61,
    62,
    63,
    64,
    65,
    66,
    67,
    68,
    69,
    70,
    71,
    72,
    73,
    74,
    75
    ];
get2KeyList(6)->[
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30,
    31,
    32,
    33,
    34,
    35,
    36,
    37,
    38,
    39,
    40,
    41,
    42,
    43,
    44,
    45,
    46,
    47,
    48,
    49,
    50,
    51,
    52,
    53,
    54,
    55,
    56,
    57,
    58,
    59,
    60,
    61,
    62,
    63,
    64,
    65,
    66,
    67,
    68,
    69,
    70,
    71,
    72,
    73,
    74,
    75
    ];
get2KeyList(_)->[].

